export default [
  {
    name: " തൃപ്പനച്ചി മുഹമ്മദ് മുസ്ലിയാര്‍",
    born: "Year-Month-Day",
    death: "സ്വഫർ-2/1432",
    description: `ഓരോ കാലഘട്ടത്തിലും അല്ലാഹുവിന്റെ ഔലിയാക്കളുണ്ടാകുമെന്നും പലരും പല രീതികളും ജീവിത ശൈലികളും സ്വീകരിക്കുന്നവരായിരിക്കുമെന്നും രേഖകളില്‍ കാണാം. തൃപ്പനച്ചി മുഹമ്മദ് മുസ്‌ലിയാര്‍ പലരില്‍നിന്നും വ്യത്യസ്തനായി ജീവിച്ച മഹോന്നത വ്യക്തിത്വത്തിനു ഉടമയായിരുന്നു. എല്ലാം തന്റെ നാഥനില്‍ അര്‍പ്പിച്ച്, ഐഹിക പരിത്യാഗം ജീവിതമുദ്രയായി കൊണ്ടുനടന്ന്, അല്ലാഹു എന്ന ചിന്തയില്‍ മാത്രം ജീവിതം കഴിച്ചുകൂട്ടിയ വലിയ പണ്ഡിതനും കൂടിയായിരുന്നു മഹാനവര്‍കള്‍.`,
    link: 'tripanachi-muhammed-musliyar',
    image: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZHZZR4O_VqWOtFUjOh2HQks1TVmHNT0siOA&s',
    articles: [
      {
        title: "ജീവിതം",
        content: `ദര്‍സില്‍ പഠിക്കുന്ന കാലത്ത് വസൂരി പോലോത്ത എന്തോ അസുഖം ബാധിച്ചപ്പോള്‍ പിതാവ് പല ദര്‍ഗകളിലും ചെന്ന് രോഗശമനത്തിനു വേണ്ടി പ്രാര്‍ത്ഥിച്ചു. അന്നേരം പരിശുദ്ധ മക്കയില്‍ ചെന്ന് ഹജ്ജ് ചെയ്യാന്‍ തൗഫീഖിനു വേണ്ടിയാണ് ഉസ്താദവര്‍കള്‍ പ്രാര്‍ത്ഥിച്ചിരുന്നത്. അങ്ങനെ 1963ല്‍ മഹാനവര്‍കള്‍ ഹജ്ജിനു പുറപ്പെട്ടു. അതിനു മുമ്പത്തെ വര്‍ഷം (1962ല്‍) മുഹമ്മദിയ്യ എന്ന പേരിലുള്ള ഒരു കപ്പലിറങ്ങി. ആ വര്‍ഷം ശംസുല്‍ഉലമ അതില്‍ ഹജ്ജിനു പുറപ്പെട്ടു; തൊട്ടുടനയുള്ള വര്‍ഷം ഉസ്താദും. അങ്ങനെ ഹറമിലെത്തിയപ്പോള്‍ കേരളത്തിന്റെ ഭാഗത്തേക്ക് ഒരു പ്രകാശഗോപുരം നീങ്ങുന്നത് ദര്‍ശനമുണ്ടായി. പ്രാകാശമെന്നാല്‍ അത് നൂറാണ്. വിജ്ഞാനത്തെ 'അല്ലാഹുവിന്റെ നൂര്‍' എന്നാണല്ലോ വിശേഷിപ്പിക്ക പ്പെടാറുള്ളത്. എന്നാല്‍, ആ വര്‍ഷമാണ് ദക്ഷിണേന്ത്യയിലെ അത്യുന്നത വൈജ്ഞാനിക കലാലയമായ ജാമിഅ നൂരിയ്യക്ക് തറക്കല്ലിട്ടത്. അതാണ് ഉസ്താദവര്‍കള്‍ അവിടുന്ന് ദര്‍ശിച്ചത്. തന്റെ ജീവിതത്തില്‍ ആകെ പങ്കെടുത്തിരുന്നതും ജാമിഅയുടെ സമ്മേളനങ്ങള്‍ക്ക് ആണെന്നത് ആ മതസ്ഥാപനത്തിന് അല്ലാഹുവിങ്കലുള്ള സ്വീകാര്യത വിളിച്ചോതുന്നുണ്ട്.
                   മഹാന്‍മാരെ ആത്മാര്‍ത്ഥമായി സ്‌നേഹിക്കുകയും അവരുമായി ആത്മീയ ബന്ധം പുലര്‍ത്തുകയും ചെയ്യുന്നവരുമായിരുന്നു വലിയ്യുല്ലാഹി തൃപ്പനച്ചി ഉസ്താദ്(ന: മ).ഞാന്‍ മുഹ്‌യിദ്ദീന്‍ ശൈഖില്‍ നിന്ന് നേരിട്ട് ത്വരീഖത് സ്വീകരിച്ചവനാണെന്ന് മഹാനവര്‍കള്‍ പറയാറുണ്ടായിരുന്നു.ഉസ്താദ് താമസിച്ചിരുന്ന മലയുടെ മുകളിലുള്ള രണ്ട് കൊടിമരങ്ങളിലൊന്ന് മുഹ്‌യിദ്ദീന്‍ ശൈഖിന്റെയും മറ്റൊന്ന് രിഫാഈ ശൈഖിന്റെയും പേരിലുള്ളതാണ്.മഹാന്‍മാരില്‍നിന്നുള്ള ആത്മീയ നിര്‍ദേശങ്ങള്‍ വഴിയാണ് അവയവിടെ സ്ഥാപിക്കപ്പെട്ടിട്ടുള്ളത്.മുഹ്‌യിദ്ദീന്‍ ശൈഖ്(റ)വിന്റെ പേരിലുള്ള കൊടിമരം ക്രിസ്തുവര്‍ഷം 2000ത്തിലെ മുഹര്‍റം ഒന്നിനാണ് സ്ഥാപിക്കപ്പെട്ടത്.അതിന്റെ പിന്നില്‍ ഒരു ചരിത്രസംഭവമുണ്ട്.
  
   ഉസ്താദും കുഞ്ഞാപ്പു ഹാജിയും കൂടി അജ്മീര്‍സിയാറത്തിന് പുറപ്പെട്ടു.യാത്ര ചെയ്ത് ബോംബെയിലെത്തി.അവിടെ നിന്ന് രണ്ട് മൂന്ന് ദിവസം എടുത്ത് ചെയ്ത് തീര്‍ക്കേണ്ട ചില കാര്യങ്ങള്‍ കുഞ്ഞാപ്പു ഹാജിക്ക് ഒരു ദിവസം കൊണ്ട് തന്നെ പൂര്‍ത്തിയാക്കാന്‍ സാധിച്ചു.യാത്ര തുടര്‍ന്ന് ഏകദേശം രാത്രി ഒമ്പത് മണി സമയത്ത് അവര്‍ അജ്മീറിലെത്തി.സാധാരണ ദര്‍ഗ അടക്കാനുള്ള സമയമായിട്ടും അവിടത്തെ ഖാദിം അന്ന് ദര്‍ഗ അടച്ചിട്ടില്ല.ഉസ്താദിനും സഹയാത്രികനും സിയാറത്തിനു വേണ്ട സര്‍വ സൗകര്യങ്ങളും ചെയ്തു കൊടുത്തു.ഞങ്ങള്‍ ഭക്ഷണം കഴിച്ച് വരാമെന്ന് പറഞ്ഞപ്പോള്‍ വേണ്ട, നിങ്ങള്‍ക്ക് വേണ്ടത് ഞാന്‍ തന്നെ കൊണ്ടുവന്ന് തരാമെന്നു പറയുകയും കിടക്കാനുള്ള സൗകര്യങ്ങളും ആ മനുഷ്യന്‍ ചെയ്തു കൊടുത്തു.സിയാറത്ത് കഴിഞ്ഞ് കുഞ്ഞാപ്പുഹാജി സുഖമായി ഉറങ്ങി.പിറ്റേ ദിവസം രാവിലെ ഉസ്താദ് ചോദിച്ചുവത്രെ നിങ്ങള്‍ സുഖമായി ഉറങ്ങിയല്ലേ.ഞാന്‍ രാത്രി അവസാനിക്കരുതെന്ന് കൊതിച്ചുപോയി.കാരണം ഞാന്‍ ഇവരുമായി ധാരാളം കാര്യങ്ങള്‍ ചര്‍ച്ച ചെയ്യുകയായിരുന്നു.അന്ന് അവിടെയുള്ള ദര്‍ഗകളൊക്കെ സിയാറത്ത് ചെയ്ത് മലയുടെ മുകളില്‍ കയറി മുഹ്‌യിദ്ദീന്‍ ശൈഖ് അജ്മീര്‍ സന്ദര്‍ശന വേളയില്‍ ഇരുന്ന സ്ഥലത്ത് ചെന്നിരുന്ന് ശൈഖവര്‍കളുമായി ആത്മീയമായി അഭിമുഖം നടത്തി.
  
  ആ അഭിമുഖ സംഭാഷണത്തിനിടയില്‍ നല്‍കിയ നിര്‍ദേശങ്ങളിലൊന്ന് നിങ്ങളുടെ നാട്ടിലെ മലമുകളില്‍ ഒരു കൊടി നാട്ടണമെന്നായിരുന്നു.സമയമാവുമ്പോള്‍ ഞാന്‍ പറയാമെന്നും അവിടുന്ന് പറഞ്ഞു.അങ്ങനെയാണ് 20 വര്‍ഷങ്ങള്‍ക്കു ശേഷം മുഹര്‍റം ഒന്നിന് ആ കൊടിമരം സ്ഥാപിക്കപ്പെടുന്നത്.
  
  മഹാനായ ശംസുല്‍ ഉലമയുമായി വളരെ വലിയ ബന്ധം പുലര്‍ത്തിയിരുന്നവരാണ് ഉസ്താദവര്‍കള്‍.പഠിക്കുന്ന കാലത്തു തന്നെ 1943ല്‍ മുത്തന്നൂര്‍ പള്ളിയുടെ കേസ് ശംസുല്‍ ഉലമ വാദിക്കുന്നത് കേള്‍ക്കാന്‍ തൃപ്പനച്ചി ഉസ്താദ് പോകാറുണ്ടായിരുന്നു.സ്‌നേഹത്തോടെയും ആദരവോടെയും ഇ.കെ.മൊയ്‌ല്യേര് എന്നാണ് അവര്‍ വിളിച്ചിരുന്നത്.ആത്മീയ ദാഹം തീര്‍ക്കാന്‍ തന്നെ സമീപിക്കുന്ന പലരെയും തൃപ്പനച്ചി ഉസ്താദ് ശംസുല്‍ ഉലമയുടെ അടുക്കലേക്കും ശംസുല്‍ ഉലമ തിരിച്ചും അയക്കാറുണ്ടായിരുന്നു.
  
  ശംസുല്‍ ഉലമ വഫാത്തായ സമയം തൃപ്പനച്ചി ഉസ്താദ് ഇങ്ങനെ പറഞ്ഞുവത്രെ: 'ആളുകളെ അയക്കാന്‍ പറ്റിയ ഒരാളായിരുന്നു അദ്ദേഹം, ഇനി ആ ഭാരം കൂടി ഞാന്‍ വഹിക്കണമല്ലോ' എന്ന്.ഒരിക്കല്‍ ശംസുല്‍ ഉലമയെ കാണാന്‍ ഉസ്താദവര്‍കള്‍ ഇടിയങ്ങര ശൈഖിന്റ പള്ളിയില്‍ ചെന്നു.ചെന്ന സമയം ശംസുല്‍ഉലമ സിയാറത്തിലാണ്.സിയാറത്ത് കഴിഞ്ഞപ്പോള്‍ ശംസുല്‍ ഉലമയുടെ കൈപ്പിടിച്ചു.ശംസുല്‍ ഉലമ കൈ വലിച്ചു.പിന്നെ അവിടെയുള്ള ഒരു റൂമിലേക്ക് വിളിച്ച് ഒരുപാട് നേരം സംസാരിച്ചു.എന്നിട്ട് തൃപ്പനച്ചി ഉസ്താദിനെയും കൂടെ വന്നവരെയും ഗെയ്റ്റ് വരെ കൂടെ ചെന്ന് യാത്രയാക്കി.കൈ തട്ടിയതിനെ കുറിച്ച് പിന്നീട് ശംസുല്‍ ഉലമയോട് ആരാഞ്ഞപ്പോള്‍ പറഞ്ഞു.എന്റെ കൈ മഖ്ബറയില്‍ വച്ച് പിടിച്ചാല്‍ അവിടെ കിടക്കുന്ന മഹാനേക്കാള്‍ ഞാന്‍ വലിയവനായി എന്ന തോന്നല്‍ ഉണ്ടാകുമെന്ന ഭയമാണ് അങ്ങനെ ചെയ്യാന്‍ എന്നെ പ്രേരിപ്പിച്ചത്.സമസ്തയില്‍നിന്ന് ചിലര്‍ മാറിപോയതിനുശേഷം പൂക്കൊളത്തൂര് വച്ച് ഒരു നബിദിന സമ്മേളനം നടക്കുകയാണ്.
  
  കണ്ണിയത്ത് ഉസ്താദും ശംസുല്‍ ഉലമയും പങ്കെടുക്കുന്ന സമ്മേളനമാണ്.അന്നു ശക്തമായ മഴ.അസ്വ്‌റിനു ശേഷം തൃപ്പനച്ചി ഉസ്താദ് വന്ന് സ്റ്റേജില്‍ വച്ച് ജലാലിയ്യ റാതീബ് ചൊല്ലി.ഉടന്‍ മഴ നിന്നു.സമ്മേളനം വളരെ ഭംഗിയായി സംഘടിപ്പിക്കപ്പെട്ടു.ശംസുല്‍ ഉലമയോടും സമസ്ത ഉലമാക്കളോടുമുള്ള സ്‌നേഹമാണ് ഇങ്ങനെ ചെയ്യാനുള്ള പ്രേരകം.ശംസുല്‍ ഉലമയ്ക്ക് കലശലായ രോഗം ബാധിച്ചപ്പോള്‍ കോഴിക്കോട് ഹോസ്പിറ്റലില്‍ അഡ്മിറ്റായി.രോഗശമനത്തിനു വേണ്ടി തൃപ്പനച്ചി ഉസ്താദിനോടു പ്രാര്‍ത്ഥിക്കാന്‍ ശംസുല്‍ ഉലമയുടെ ആവശ്യപ്രകാരം പറഞ്ഞു.പ്രാര്‍ത്ഥിച്ചു.പിറ്റേന്ന് പരിശോധിച്ചപ്പോള്‍ രോഗം ശമനമായിട്ടുണ്ട്.ഡിസ്ചാര്‍ജ് ചെയ്തു.അപ്പോള്‍ ശംസുല്‍ ഉലമ പ്രതികരിച്ചതിങ്ങനെയാണ്: പോകാന്‍ ഏതാണ്ട് സമയമായിരുന്നു.തൃപ്പനച്ചി ഉസ്താദ് നീട്ടിയതാണ്.വീണ്ടും രോഗം ബാധിച്ചപ്പോള്‍ തൃപ്പനച്ചി ഉസ്താദിനോട്.ശംസുല്‍ഉലമയുടെ ശിഷ്യന്‍മാര്‍ ദുആ ചെയ്യാന്‍ ആവശ്യപ്പെടാന്‍ വേണ്ടി വന്നു.പക്ഷേ, കണ്ടില്ല.തിങ്കളാഴ്ച സുബ്ഹിക്കാണ് കണ്ടത്.വിഷയം പറഞ്ഞപ്പോള്‍ ചോദിച്ചുവത്രെ ഒരു വിളവ് പാകമായാല്‍ അത് കൊയ്തില്ലെങ്കില്‍ ഉടമക്ക് നഷ്ടമല്ലേ? കൊണ്ടു പൊയ്‌ക്കോട്ടെ.ആ പറഞ്ഞതും ശംസുല്‍ഉലമ(റ) വഫാത്തായതും ഒരേ സമയമാണ്.പാണക്കാട് സാദാത്തീങ്ങളെ അതിരറ്റ് സ്‌നേഹിച്ച തൃപ്പനച്ചി ഉസ്താദ് മുഹമ്മദലി ശിഹാബ് തങ്ങളുമായും ഹൈദരലി തങ്ങളുമായും വലിയ ബന്ധം പുലര്‍ത്തുന്നവരായിരുന്നു.
  
  ശിഹാബ് തങ്ങള്‍ തന്നെ കാണാന്‍ ആഗ്രഹിക്കുന്നുവെന്ന വിവരം കിട്ടിയപ്പോള്‍ തങ്ങള്‍ ഇങ്ങോട്ടു വന്ന് പ്രയാസപ്പെടേണ്ടെന്നും ഞാനങ്ങോട്ട് ചെന്നു കാണാമെന്നും പറഞ്ഞു.പിന്നീട് നടന്ന ജാമിഅ സമ്മേളനത്തില്‍വച്ച് അവര്‍ കണ്ടുമുട്ടി ദീര്‍ഘ നേരം സംഭാഷണം നടത്തി.
  
  മഹാനായ ഹൈദരലി ശിഹാബ് തങ്ങള്‍ ഉസ്താദ് നിര്‍മിച്ച പള്ളിയില്‍ ചെന്നപ്പോള്‍ ആ പള്ളി മുഴുവന്‍ നടന്ന് കാണിച്ചുകൊടുക്കുകയും പല സ്ഥലങ്ങളിലും തബര്‍റുകിന് വേണ്ടി നിസ്‌കരിപ്പിക്കുകയും ചെയ്ത സംഭവം തങ്ങള്‍ തന്നെ അനുസ്മരിക്കുന്നുണ്ട്.ഒരു മഹാപണ്ഡിതന്‍ കൂടിയായിരുന്നു മഹാനായ മുഹമ്മദ് മുസ്‌ലിയാര്‍.നിരവധി പണ്ഡിതര്‍ക്കുണ്ടായ അനുഭവങ്ങള്‍ ഇതാണ് നമ്മെ ബോധ്യപ്പെടുത്തുന്നത്.ഹിദായത്തുണ്ടാകാന്‍ ദുആ ചെയ്യണമെന്ന് ആവശ്യപ്പെട്ട പണ്ഡിതനോട് 'അല്‍ഹിദായതു അംറുന്‍ മിന്‍ ലദൈഹി' എന്ന വാക്യം ഏതു കിതാബില്‍ ഉള്ളതാണെന്നു ചോദിച്ചു.
  
  പെട്ടെന്ന് മറുപടി പറയാന്‍ സാധിക്കാത്ത ആ സുഹൃത്തിന് അത് മൈബദിയിലെ ഇബാറതാണെന്ന് പിന്നീടാണ് ബോധ്യമായത്.കണക്കില്‍ ഉസ്താദിന്റെ പ്രാഗത്ഭ്യം അംഗീകരിച്ച അധ്യാപകരുണ്ട്.വീടു പണി പൂര്‍ത്തിയാകാന്‍ ദുആ ചെയ്യാന്‍ ആവശ്യപ്പെട്ട ഖുതുബി അടക്കം ഓതിക്കൊടുക്കുന്ന മുദരിസിനോട് ഇല്ലത്തുകള്‍ എത്ര വിധമുണ്ടെന്ന് ചോദിച്ച് ഇല്ലത്തുഗാഇയ്യയിലെത്താന്‍ മറ്റു മൂന്ന് ഇല്ലതുകളുണ്ടായാല്‍ മതിയെന്ന് പറഞ്ഞുവിട്ടു.കറാമത്തുകള്‍ ഒരിക്കലും വലിയ്യിനെ അളക്കുവാനുള്ള മാനദണ്ഡമല്ല.ഔലിയാക്കളില്‍ അമാനുഷിക കാര്യങ്ങള്‍ പ്രകടിപ്പിച്ചവരും അല്ലാത്തവരുമുണ്ടായിട്ടുണ്ട്.അമാനുഷികതകള്‍ പ്രകടിപ്പിച്ചവര്‍ മുഴുവന്‍ വലിയ്യിന്റെ പരിധിയില്‍ പെടില്ലതാനും.ഇമാം ഖുശൈരി(റ) തന്റെ അര്‍രിസാലതുല്‍ ഖുശൈരിയ്യയില്‍ പറയുന്നു: ഔലിയാക്കള്‍ക്കുണ്ടാകുന്ന പ്രധാനപ്പെട്ട കറാമത്ത് എന്നുപറഞ്ഞാല്‍ നന്‍മകള്‍ നിത്യമായി ചെയ്യുവാനുള്ള തൗഫീഖും ഇലാഹീ കല്‍പനകള്‍ക്ക് എതിര് ചെയ്യുന്നതില്‍ നിന്നും തെറ്റുകളില്‍നിന്നുമുള്ള സംരക്ഷണവുമാണ്.ഇത് ഉസ്താദിനുണ്ടായിരുന്നുവെന്നതില്‍ യാതൊരു സംശയവുമില്ല.എപ്പോഴും അന്‍ഫാസില്‍ മുഴുകിയിരുന്ന അവര്‍ക്ക് അല്ലാഹ് എന്നല്ലാതെ യാതൊരു ചിന്തയുമുണ്ടായിരുന്നില്ല.
  
  മെഡിക്കല്‍ കോളേജില്‍ നിന്നു മടക്കിയ രോഗങ്ങള്‍ പോലും അവിടുത്തെ നിര്‍ദേശപ്രകാരം ചികിത്സ നടത്തിയപ്പോള്‍ ഭേദമായിട്ടുണ്ട്.രോഗപീഡകളെ കുറിച്ച് പരാതി പറയുന്ന മിക്ക ആളുകളോടും കൊടിമരത്തില്‍ ചെന്ന് പ്രാര്‍ത്ഥിക്കാനും ശിഫാഇന്റെ വെള്ളം കുടിക്കുവാനുമാണ് നിര്‍ദേശിക്കാറുണ്ടായിരുന്നത്.
  
  ഉസ്താദിന്റെ നിര്‍ദേശപ്രകാരം ആരംഭിച്ച റാതീബില്‍ പങ്കെടുത്തുകൊണ്ടിരിക്കെ പാദസരം നഷ്ടപ്പെട്ട സ്ത്രീയുടെ കുടുംബക്കാര്‍ ഉസ്താദിന്റെ അടുക്കല്‍ വന്ന് പരാതി പറഞ്ഞു. ''എടുത്തവന്‍ ഇവിടെ കൊണ്ടു വന്ന് തരും''-ഉസ്താദ് ഉടനെ പ്രതികരിച്ചു.പിന്നീട് പാദസരം കിട്ടിയ വിവരം നടക്കാവ് പോലീസ് അറിയിച്ചപ്പോള്‍ ആ കാര്യം ഉസ്താദിനെ അറിയിച്ചു.അപ്പോള്‍ 'അവനെ കണ്ണൂര്‍ സെന്‍ട്രല്‍ ജയിലിലേക്കയക്കണമെന്ന്' പറഞ്ഞു.സാധാരണ ഇത്തരം കേസുകളില്‍ സെന്‍ട്രല്‍ ജയിലിലേക്ക് അയക്കപ്പെടാറില്ലെങ്കിലും ഉസ്താദിന്റെ വാക്ക് പുലര്‍ന്നു.മാറാട് കേസ് വിചാരണ നടക്കുന്ന സമയമായതു കൊണ്ട് ജയിലില്‍ അനുഭവപ്പെട്ട സ്ഥലപരിമിതി മൂലം അവന്‍ കണ്ണൂര്‍ ജയിലിലേക്ക് മാറ്റപ്പെട്ടു.
  
  അല്ലാഹുവിന്റെ അടിമകളില്‍ ചിലര്‍ എന്തെങ്കിലും പറഞ്ഞാല്‍ അല്ലാഹു അത് പുലര്‍ത്തിക്കൊടുക്കും എന്ന ഗണത്തിലായിരുന്നു ഉസ്താദും.ജനങ്ങള്‍ക്ക് ആത്മീയ ഉന്നമനത്തിനു വേണ്ട കാര്യങ്ങളാണ് ഉസ്താദ് നിര്‍ദേശിച്ചുകൊടുക്കാറുണ്ടായിരുന്നത്.ജലാലിയ്യാ റാതീബും ദിക്‌റ് സദസ്സുകളും മറ്റും ഉസ്താദിന്റെ നിര്‍ദേശാനുസരണം പല സ്ഥങ്ങളിലും ഇന്നും നടക്കുന്നുണ്ട്.മലയുടെ മുകളില്‍ നിര്‍മിക്കപ്പെട്ട കെട്ടിടങ്ങള്‍ എന്തിനാണെന്ന് ആര്‍ക്കും ബോധ്യമില്ലായിരുന്നു.ഇപ്പോള്‍ അവിടെ നടക്കുന്ന വൈജ്ഞാനിക സംരംഭങ്ങള്‍ ആ കെട്ടിട നിര്‍മാണങ്ങള്‍ക്കു പിന്നില്‍ മഹാനവര്‍കള്‍ ലക്ഷ്യം വച്ച കാര്യങ്ങളിലേക്ക് ജനങ്ങളെ വഴിനടത്തുന്നു.സമസ്തയെയും അതിന്റെ പണ്ഡിതശ്രേഷ്ഠരെയും വിശിഷ്യ ശംസുല്‍ഉലമയെയും പാണക്കാട് സാദാത്തീങ്ങളെയും ആദരിച്ചവരായിരുന്നു മഹാനുഭാവന്‍ എന്നത് നമ്മെ ഏറെ സമാധാനത്തിലാക്കുന്നു.അവരുടെ മദദ് കൊണ്ട് അല്ലാഹു നമ്മെ ഇരുവീട്ടിലും രക്ഷപ്പെടുത്തുമാറാകട്ടെ.`,
      },
    ],
  },
  {
    name: " ചീക്കിലോട്ട് കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍",
    born: "Year-Month-Day",
    death: "സ്വഫർ-2/1408",
    description: `കടമേരിയിലെ വിശ്രുതമായ പണ്ഡിത കുടുംബമാണ് കീഴന കുടുംബം. കീഴന വലിയ ഓര്‍ എന്ന പേരിലറിയപ്പെട്ട വലിയും പണ്ഡിതനുമായിരുന്ന കീഴന കുഞ്ഞമ്മദ് കുട്ടി മുസ്ലിയാര്‍ (കുഞ്ഞേറ്റി മുസ്ലിയാര്‍) ഈ കുടുംബത്തിലെ കണ്ണിയാണ്. അദ്ദേഹത്തിന്‍റെ പുത്രന്മാരും പൗത്രന്മാരുമായി ഈ കുടുംബം വിവിധ പണ്ഡിത ധാരകളായി പിരിയുന്നു. പരസ്പരം ഏതെങ്കിലുമൊരു വിധത്തില്‍ കുടുംബ ബന്ധമോ വിവാഹ ബന്ധമോ പുലര്‍ത്തി കടമേരിയിലെ പണ്ഡിത കുടുംബങ്ങള്‍ ബന്ധപ്പെട്ട് കിടക്കുന്നത് അത് കൊണ്ടാണ്.`,
    articles: [
      {
        title: "ജീവിതം",
        content: `നാദാപുരത്തെ റമളാന്‍ ശൈഖ് മുഖേനയാണ് മഹിതമായ പണ്ഡിത സാനിധ്യം കടമേരിയിലെത്തുന്നത് എന്ന് കരുതപ്പെടുന്നു. കുഞ്ഞമ്മദ് കുട്ടി മുസ്ലിയാര്‍ക്ക് മൂന്ന് ആണ്‍മക്കളാണുണ്ടായിരുന്നത്. കുഞ്ഞബ്ദുള്ള മുസ്ലിയാര്‍,കുഞ്ഞഹമ്മദ് ഹാജി, ചിറക്കല്‍ അബ്ദു റഹ്മാന്‍ മുസ്ലിയാര്‍ എന്നിവരാണവര്‍. ഇവരില്‍ കുഞ്ഞബ്ദുള്ള മുസ്ലിയാര്‍ ചീക്കിലോട്ടോര്‍ എന്ന പേരിലും അബ്ദുറഹ്മാന്‍ മുസ്ലിയാര്‍ ചിറക്കലോര്‍ എന്ന പേരിലും വിശ്രുതരായി. ചീക്കിലോട്ട് കുഞ്ഞബ്ദുല്ല മുസ്ലിയാര്‍, ബിയ്യാത്തു ദമ്പതികള്‍ക്ക് ഒരു ആണും ഏഴ് പെണ്‍മക്കളുമാണുള്ളത്. ആ ഏക ആണ്‍ മകനാണ് റഹ്മാനിയ്യ സ്ഥാപകന്‍ ചീക്കിലോട്ട് കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍.
  സഹോദരി ഫാത്വിമയും കുഞ്ഞമ്മദ് മുസ്ലിയാരും ഇരട്ടകളാണ്. 1925 ല്‍ ഫെബ്രുവരി 20 ന് ചീക്കിലോട്ട് തറവാട്ടിലായിരുന്നു കുഞ്ഞമ്മദ് മുസ്ലിയാരുടെ ജനനം.കീഴന കുഞ്ഞമ്മദ് ഹാജി ഫാത്വിമ ദമ്പതികളുടെ മകനാണ് പ്രമുഖ പണ്ഡിതനും കേരള സംസ്ഥാന ജംഇയ്യത്തുല്‍ ഉലമ പ്രസിഡന്‍റുമായിരുന്ന കീഴന കുഞ്ഞബ്ദുല്ല മുസ്ലിയാര്‍.അന്ത്രു മുസ്ലിയാര്‍, കുഞ്ഞേറ്റി മുസ്ലിയാര്‍, മൊയ്തു മുസ്ലിയാര്‍, കുഞ്ഞാമി, ബിയ്യാത്തു, ഖദീജ, ഹലീമ എന്നിവരാണ് ഇവരുടെ മറ്റു മക്കള്‍.ചിറക്കല്‍ അബ്ദുറഹ്മാന്‍ മുസ്ലിയാര്‍ ബിയ്യാത്തു ദമ്പതികള്‍ക്ക് ആറു ആണ്‍മക്കളും മൂന്ന് പെണ്‍മക്കളുമാണ് ഉള്ളത്.`,
      },
      {
        title: " പഠനം",
        content: `ചീക്കിലോട്ട് കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍ അറിവിന്‍റെ വലിയ ഉയരങ്ങള്‍ കണ്ടവരല്ല. പക്ഷെ നിഷ്കപടമായ കര്‍മ്മങ്ങള്‍ കൊണ്ട് ജീവിതത്തോട് ചേര്‍ന്ന അറിവിനെ സമ്പൂര്‍ണമാക്കിയ സാത്വികനാണ്. ആധുനിക ഇംഗ്ലീഷ് മാതൃകയിലുള്ള വിദ്യാഭ്യാസ രീതി സര്‍വ്വ വ്യാപകമല്ലാതിരുന്ന അമ്പതുകളില്‍ ഓത്തുപള്ളികളും എഴുത്തു പള്ളികളുമാണല്ലോ ജ്ഞാന കേന്ദ്രങ്ങളായി നിലകൊണ്ടിരുന്നത്.
  തന്‍റെ വീടിന്‍റെ തൊട്ടടുത്തുണ്ടായിരുന്ന ചിറക്കല്‍ ഓത്തു പള്ളിയില്‍ നിന്നും കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍ പ്രാഥമിക പഠനം പൂര്‍ത്തിയാക്കി.തയ്യില്‍ കുഞ്ഞബ്ദുള്ള മുസ്ലിയാര്‍ ഓത്തു പള്ളിയിലേയും ചോയികണ്ടത്തില്‍ സൂപ്പി മുസ്ലിയാര്‍, ശങ്കരന്‍ കുരിക്കള്‍ എന്നിവര്‍ എഴുത്തു പള്ളിയിലേയും ഗുരുനാഥന്മാരായിരുന്നു.
  പ്രാഥമിക പഠനത്തിന് ശേഷം ഉപ്പയുടെ സഹോദരന്‍ ചിറക്കല്‍ അബ്ദുറഹ്മാന്‍ മുസ്ലിയാരുടെ വില്യാപ്പള്ളി, തളിപ്പറമ്പ്, ദര്‍സുകളില്‍ ഏതാനും വര്‍ഷം ഓതിപ്പഠിച്ചു. 1945, 46 കാലയളവിലാണ് കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍ തളിപ്പറമ്പില്‍ ഓതുന്നത്.തുടര്‍ന്ന് കോട്ടുമല ഉസ്താതിന്‍റെ മലപ്പുറം ജില്ലയിലെ വേങ്ങരക്കടുത്തുള്ള കോട്ടുമല ദര്‍സില്‍ ചേര്‍ന്നു. 1943 ല്‍ വെല്ലൂര്‍ ബാഖിയാത്തില്‍ നിന്നും ബിരുദം നേടിയതിന് ശേഷം തുടങ്ങിയതായിരുന്നു പ്രസ്തുത ദര്‍സ്.അന്ന് കടമേരി, നാദാപുരം ഭാഗങ്ങളില്‍ നിന്നുള്ള ഒരു പാട് ആളുകള്‍ അവിടെ പഠിക്കാറുണ്ടായിരുന്നു.ഇ കെ ഹസന്‍ മുസ്ലിയാരും എം എം ബശീര്‍ മുസ്ലിയാരും അന്ന് അവിടെ ദര്‍സില്‍ ഉണ്ടായിരുന്നു.പാരമ്പര്യ സമൂഹത്തിന് ശ്രദ്ധേയമായ സംഭാവനകള്‍ നല്‍കിയ പണ്ഡിത കേസരികളായണവര്‍.
  സമുദായത്തിന്‍റെ പില്‍ക്കാല ദര്‍ശനങ്ങള്‍ക്ക വലിയ സംഭാവന നല്‍കിയ കേന്ദ്രമായി കോട്ടുമലയിലെ ദര്‍സ് മാറിയത് ഇത്തരം പണ്ഡിതന്മാരുടെ സൃഷ്ടിപ്പിലൂടെയായിരുന്നു.ബശീര്‍ മുസ്ലിയാരും കുഞ്ഞമ്മദ് മുസ്ലിയാരും മഹല്ലി, ശറഹു തഹ്സീബ് തുടങ്ങിയ പല കിതാബുകളും ഇവിടെ നിന്ന് ഒരുമിച്ചോതിയുട്ടുണ്ട്.കുഞ്ഞമ്മദ് മുസ്ലിയാരുടെ കോട്ടുമല ദര്‍സ് പഠനം ഏകദേശം രണ്ട് വര്‍ഷം മാത്രമേ നീണ്ടു നിന്നുള്ളൂ.ഉപ്പ രോഗ ബാധിതനായതോടെ കുടുംബ ബാധ്യത മുഴുവന്‍ ഏക മകനു മുകളില്‍ വന്ന് വീണപ്പോള്‍ പഠനം അവസാനിപ്പിച്ച് കുടുംബത്തിലേക്ക് മടങ്ങേണ്ടി വന്നു.പക്ഷെ ഒരു സമൂഹത്തിന് അറിവ് നല്‍കാനുള്ള ജീവിതത്തിന്‍റെ രാപ്പകലുകള്‍ക്കും തുടക്കമിടലായിരുന്നു ആ മടങ്ങല്‍.`,
      },
      {
        title: " സാമൂഹ്യ സേവകന്‍",
        content: `സേവന തല്‍പരത കുഞ്ഞമ്മദ് മുസ്ലിയാരുടെ ജൈവിക ഗുണമായിരുന്നു. നാടിന്‍റെ വിവധ ആവിശ്യങ്ങളുടെ കേന്ദ്രമയ കുടുംബത്തില്‍പെടുന്ന കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍ മത രാഷ്ട്രീയ സാമൂഹിക വിദ്യാഭ്യാസ മേഘടകളില്‍ ഒരു പോലെ തന്‍റെ വ്യക്തിപ്രഭാവത്തിന്‍റെ മുദ്രപതിപ്പിച്ചു. റഹ്മാനിയ്യ ആരംഭിച്ചതോടെ മുഴുവന്‍ നേരവും അതിനോടൊപ്പമായി. അതിനു മുമ്പ് നാട്ടിലെ വിവധ സേവന് പ്രവര്‍ത്തനങ്ങളിലായിരുന്നു കുഞ്ഞമ്മദ് മുസ്ലിയാരുടെ ശ്രദ്ധ. ലീഗ് പ്രവര്‍ത്തകന്‍ ആയതോട് കൂടെ നാട്ടിലെ വിവിധ വിഷയങ്ങളില്‍ വ്യാപൃതനായിരുന്നു. തെരെഞ്ഞെടുപ്പ് വേളകളില്‍ ലീഗ് സ്ഥാനാര്‍ത്ഥികളുടെ വിജയത്തനായി പ്രവര്‍ത്തിച്ചു. ലീഗ് രൊതുയോഗങ്ങളിലും നാട്ടിലെ കമ്മിറ്റി യോഗങ്ങളിലും പങ്കെടുക്കും. ചിലപ്പോള്‍ വീടുകളിലായിരിക്കും യോഗം കൂടുക.
  കടമേരി പ്രദേശത്ത് ചന്ദ്രിക ദിനപത്രം പ്രചരിപ്പിക്കുന്നതില്‍ മുഖ്യ പങ്ക് വഹിച്ചു.കടമേരി പ്രദേശത്ത് ചന്ദ്രിക പത്രം ആദ്യം എത്തിക്കുന്നത് തന്നെ കുഞ്ഞമ്മദ് മുസ്ലിയാരായിരുന്നു.അനാഥ അഗതികളുടെ സംരക്ഷണവും പാവപ്പെട്ട പെണ്‍കുട്ടികളുടെ വിവാഹവും കുഞ്ഞമ്മദ് മുസ്ലിയാര്‍ ജീവിതത്തിലെ അനിവാര്യയായി ഏറ്റെടുത്തു.
  പാവപ്പെട്ടവന് വീട് വെച്ച് കൊടുക്കാന്‍ മുന്നില്‍ നിന്നു.ദാരിദ്രത്തിന്‍റെയും പരാധീനതയുടെയും ജീവിത യാഥാര്‍ത്ഥ്യങ്ങള്‍ക്ക് കാവല്‍ നിന്നു.ആ മനുഷ്യ സ്നേഹിയുടെ മനസ്സറിഞ്ഞുള്ള ഓരോ പ്രവര്‍ത്തനങ്ങളും ഒരു നാടിന്‍റെ പയ്യാരങ്ങള്‍ക്ക് പരിഹാരം കാണലായിരുന്നു.തന്‍റെ സാമ്പത്തിക ശേഷിക്കും നിലവാരത്തിനുമപ്പുറമായിരുന്നു ഓരോ സേവനങ്ങള്‍ക്കുമുള്ള കുഞ്ഞമ്മദ് മുസ്ലിയാരുടെ പിന്തുണ.
  `,
      },
    ],
  },
  {
    name: " സി.എം. അബ്ദുല്ല മൗലവി ",
    born: "Year-Month-Day",
    death: "സ്വഫർ-30/1430",
    description: `ഖാസി സി.എം.അബ്ദുല്ല മൗലവി  കേരളത്തിലെ സുന്നി മുസ്ലീം മതപണ്ഡിതരിൽ പ്രമുഖനും സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമ വൈസ്‌ പ്രസിഡന്റും മംഗലാപുരം, കീഴൂർ സംയുക്ത മുസ്‌ലിം ജമാഅത്ത് ഖാസിയുമായിരുന്ന അദ്ദേഹം കാസറഗോഡ് ജില്ലയിലെ ചന്ദ്രഗിരി പുഴയോരത്തെ തളങ്കരയിൽ ഒരു സമുന്നത പണ്ഡിത കുടുംബത്തിലാണ് ജനിച്ചത്‌. മതപണ്ഡിതൻ, ഗ്രന്ഥകർത്താവ്‌, നേതാവ്‌, ഖാസി, വിദ്യാഭ്യാസവിദഗ്ദ്ധൻ എന്നീ നിലകളിൽ പ്രശസ്തൻ. മലബാർ ഇസ്‌ലാമിക് കോംപ്ലെക്, ജാമിഅ: സഅദിയ്യ അറബിയ്യ  എന്നീ വിദ്യാഭ്യാസ സ്ഥാപനങ്ങളുടെ സ്ഥാപക അംഗവുമായി അറിയപ്പെടുന്നു.`,
    articles: [
      {
        title: " ജനനം, കുടുംബം",
        content: `ചെമ്പരിക്ക ഖാസിയും പ്രമുഖ ഇസ്‌ലാംമത പണ്ഡിതവര്യനുമായിരുന്ന മർഹും സി മുഹമ്മദ് കുഞ്ഞി മുസ്ല്യാർ-ബീപാത്തുമ്മ ഹജ്ജുമ്മ എന്ന ദമ്പതികളുടെ ഏഴു മക്കളിൽ മൂത്തമകനായി 1933 സെപ്റ്റംബർ മൂന്നിന് കാസര്‍കോട് തളങ്കരയിലെ പള്ളിക്കാലിലെ മാതൃഗൃഹത്തിൽ ജനിച്ചു. ലക്ഷ ദ്വീപു വഴി എത്തിച്ചേർന്ന പൂർവികരുടെ തുടർപരമ്പരയായി പിന്നീട് വന്ന ആറ് തലമുറകളുടെ വിശദമായ ചരിത്രം മാത്രമാണ് ലഭ്യമായിട്ടുള്ളത്. ചെമ്മനാട് ജീവിച്ചിരുന്ന ഇസ്‌ലാംമത പണ്ഡിതനും സൂഫിവര്യനുയിരുന്ന പോക്കർഷാ, അദ്ദേത്തിന്റെ മകൻ ഇസ്‌ലാംമത പണ്ഡിതനും ആധ്യാത്മിക പുരുഷനും പ്രഭാഷകനുമായിരുന്ന അബ്ദുല്ലാഹിൽ ജംഹരി എന്ന അബ്ദുല്ല മുസ്ലിയാർ, പിന്നെ അദ്ദേഹത്തിന്റെ മകൻ ജ്ഞാനിയും സൂഫിവര്യനുമായിരുന്ന സി മുഹമ്മദ് കുഞ്ഞി മുസ്ലിയാർ (ചെമ്പരിക്ക വലിയ ഖാളി എന്നപേരിൽ അക്കാലത്ത്‌ അറിയപ്പെട്ടിരുന്നു), അദ്ദേഹത്തിന്റെ മകൻ സി.എം അബ്ദുല്ല മൗലവി എന്നിങ്ങനെയാണ് അദ്ദേഹത്തിന്റെ കുടുംബ പരമ്പര. മതപണ്ഡിത കുടുംബമായതിനാൽ ഖാസിയാറടുക്കം എന്നപേരിലാണ് ഈ കുടുംബം അറിയപ്പെടുന്നത് പത്നി: ആയിഷ ഹജ്ജുമ്മ. മക്കൾ: മുഹമ്മദ് ഷാഫി, മുനീർ, ഉസ്മാൻ, ഫാത്തിമത്ത് സുഹറ, ഹഫ്‌സ, ഹസീന, റാബിയ. മരുമക്കൾ: മുഹമ്മദ് അബ്ദുൾഖാദർ (ചെമ്പിരിക്ക), മുഹമ്മദ് ഷാഫി (ദേളി), അബ്ബാസ് (ഉദുമ പടിഞ്ഞാർ), അബ്ദുള്ള (പള്ളിക്കര), ഖൈറുന്നീസ, ആസുറ, ഫസീലe.`,
      },
      {
        title: " മരണം",
        content: `2010 ഫെബ്രുവരി 15ന് രാവിലെ ചെമ്പരിക്ക കടുക്ക കല്ലിന് സമീപം ഖാസിയെ മരിച്ച നിലയിൽ കാണപ്പെട്ടു. മരണം കൊലപാതകമാണെന്ന് കരുതുന്നു.`,
      },
    ],
  },
  {
    name: " ടി കെ എം ബാവ മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "2013 ജൂൺ 16 ",
    description: `ടി കെ എം ബാവ മുസ്ലിയാർ ഒരു ഇന്ത്യൻ മുസ്ലീം പണ്ഡിതനും സമസ്ത കേരള ഇസ്ലാം മാതാ വിദ്യാഭ്യാസ ബോർഡിന്റെ മുൻ പ്രസിഡന്റുമായിരുന്നു.  മലപ്പുറം സ്വദേശിയായ അദ്ദേഹം 25 വർഷം കസർഗോട് ഖാസിയായി (മുഖ്യ നിയമജ്ഞൻ) സേവനമനുഷ്ഠിക്കുകയും മലബാർ മേഖലയിലെ ആത്മീയ നേതാവെന്ന ഖ്യാതിയും നേടിയിരുന്നു. അഞ്ചാം ക്ലാസ് ബോർഡ് പരീക്ഷയുടെ ശാസ്ത്രീയ മാതൃകയും മൂല്യനിർണ്ണയത്തിൽ ആധികാരികവും വിശ്വസനീയവുമായ മാർഗ്ഗം അവതരിപ്പിക്കുന്നത് പോലെ വിദ്യാഭ്യാസ ബോർഡിന്റെ വിദ്യാഭ്യാസ സമ്പ്രദായത്തിൽ വിപ്ലവകരമായ നിരവധി പരിഷ്കാരങ്ങൾ അദ്ദേഹം അവതരിപ്പിച്ചു.`,
    articles: [
      {
        title: " ആദ്യകാല ജീവിതം",
        content: `പണ്ഡിതനും മതപണ്ഡിതനുമായ പറമ്പിൻ പീടികയിൽ ഫാത്തിമയുടെയും ബീരാൻ കുട്ടി മുസ്ലിയാരുടെയും മകനായി 1930 ജൂലൈ 21ന് ജനിച്ചു. സ്വന്തം പ്രദേശത്തെ പ്രാഥമിക വിദ്യാഭ്യാസത്തിന് ശേഷം അദ്ദേഹം നിരവധി ദർസുകളിൽ (മസ്ജിദ് അധിഷ്ഠിത കോളേജ്) ചേരുകയും വെല്ലൂർ ബാഖിയാത്ത് സ്വാലിഹാത്തിൽ നിന്ന് ബിരുദാനന്തര ബിരുദം നേടുകയും ചെയ്തു. പിതാമഹൻമാരായ മൊയ്തീൻ മുസ്‌ലിയാർ, കോമു മുസ്‌ലിയാർ, കോട്ടുമല ഉസ്താദ്, പറവണ്ണ മുഹ്‌യദീൻ മുസ്‌ലിയാർ, ശൈഖ് ആദം ഹസ്‌റത്ത്, ശൈഖ് ഹസ്സൻ ഹസ്‌റത്ത് എന്നിവർ അദ്ദേഹത്തിന്റെ ഗുരുക്കന്മാരായിരുന്നു. സി എം വലിയുള്ള, എം എം ബഷീർ മുസ്ലിയാർ, സി എച്ച് ഹൈദ്രോസ് മുസ്ലിയാർ, കെ കെ അബ്ദുല്ല മുസ്ലിയാർ എന്നിവരും അദ്ദേഹത്തോടൊപ്പമുണ്ടായിരുന്നു .`,
      },
      {
        title: " സേവന മേഖലയിൽ",
        content: `1976 ജൂലൈ 31-ന് സമസ്ത മുശാവറ ബോർഡിൽ ചേരുകയും വിയോഗം വരെ സേവനം അനുഷ്ഠിക്കുകയും ചെയ്തു. ഹജ്ജ് നിർവഹിക്കാൻ മക്കയിലേക്ക് പോകുമ്പോൾ പിതാവ് മൊയ്തീൻ മുസ്‌ലിയാരുടെ പേരിൽ അദ്ദേഹം വള്ളിമുക്ക് ദർസെ (മസ്ജിദ് അടിസ്ഥാനമാക്കിയുള്ള സെമിനാരി) ചുമതലയേറ്റു. 1989 ഫെബ്രുവരി 21-ന് കേരളത്തിലെ ഏറ്റവും വലിയ സർക്കാരിതര വിദ്യാഭ്യാസ സ്ഥാപനങ്ങളിലൊന്നായ സമസ്ത മാതാ വിദ്യാഭ്യാസ ബോർഡിന്റെ പ്രസിഡന്റായി അദ്ദേഹം തിരഞ്ഞെടുക്കപ്പെട്ടു, അദ്ദേഹത്തിന്റെ മരണം വരെ അദ്ദേഹം അതിൽ തുടർന്നു. ബോർഡ് പരീക്ഷാ സമ്പ്രദായം നവീകരിക്കുകയും പത്താം ക്ലാസ് മുതൽ പ്ലസ് ടു വരെ വർധിപ്പിക്കുകയും ചെയ്തതിനാൽ അദ്ദേഹം ബോർഡിൽ നിരവധി ശാസ്ത്രീയ പരിഷ്കാരങ്ങൾ അവതരിപ്പിച്ചു. അദ്ദേഹം ചെയർമാനായിരുന്ന കാലത്ത് ബോർഡ് ഉർദു ഭാഷയിൽ പോലും നിരവധി ഗ്രന്ഥങ്ങൾ പ്രസിദ്ധീകരിച്ചു. കാസർഗോട് ഖാസി (മുഖ്യ നിയമജ്ഞൻ) എന്ന നിലയിൽ പ്രമുഖ പണ്ഡിതനായിരുന്ന ഇ കെ ഹസൻ മുസ്ലിയാരുടെ നിര്യാണത്തെത്തുടർന്ന് 1983 മെയ് 18 ന് സിംഹാസനത്തിൽ അവരോധിക്കപ്പെട്ട അദ്ദേഹം വിയോഗം വരെ അവിടെ സേവനമനുഷ്ഠിച്ചു. മാലിക് ദീനാർ ഉറൂസിൽ മൂന്ന് പതിറ്റാണ്ട് നീണ്ട സേവനമാണ് അദ്ദേഹത്തെ ആദരിച്ചത്.`,
      },
      {
        title: " മരണം",
        content: `വാർദ്ധക്യ സഹജമായ അസുഖത്തെ തുടർന്ന് വെളിമുക്കിലെ വസതിയിൽ 2013 ജൂൺ 16 ന് അന്തരിച്ചു. സ്വന്തം ഗ്രാമത്തിൽ അടക്കം ചെയ്തു.`,
      },
    ],
  },
  {
    name: " എ. മരക്കാര്‍ ഫൈസി",
    born: "1946 ",
    death: "1442/04/03",
    description: `സമസ്ത മുശാവറ മെമ്പറായിരുന്ന നിറമരുതൂര്‍ ബീരാന്‍ കുട്ടി മുസ്‌ലിയാരുടെ മകനാണ് അദ്ദേഹം.ഭാര്യ. ഫാത്വിമ. മക്കള്‍: അബ്ദു റഹ്മാന്‍,ശരീഫ,റാബിഅ റൈഹാനത്ത്, ഉമ്മു ഹബീബ, ഹന്നത്, അബ്ദുല്‍ ഹക്കീം.`,
    "articles ": [
      {
        title: "ജീവിതം",
        content: `1946 ല്‍ ആണ് മരക്കാര്‍ ഫൈസിയുടെ ജനനം. പ്രാഥമിക പഠനങ്ങള്‍ക്ക് ശേഷം താനൂര്‍ ഇസ്‌ലാഹുല്‍ ഉലൂമിലും വലിയകുളങ്ങര പള്ളിയിലുമായി സ്വന്തം പിതാവില്‍ നിന്ന് പത്ത് വര്‍ഷത്തെ ദര്‍സ് പഠനം. കെ കെ അബൂബക്കര്‍ ഹസ്‌റത്ത് അടക്കമുള്ള പണ്ഡിതരില്‍ നിന്ന് അറിവ് നുകര്‍ന്നു. 1967 ല്‍ ഉപരിപഠനത്തിനായി പട്ടിക്കാട് ജാമിഅ നൂരിയ്യയിലെത്തി. വിഖ്യാത പണ്ഡിതരായ കണ്ണിയത്ത് അഹമ്മദ് മുസ്‌ലിയാര്‍, ശംസുല്‍ ഉലമ ഇകെ അബൂബക്കര്‍ മുസ്‌ലിയാര്‍, കോട്ടുമല ബാപ്പു മുസ്‌ലിയാര്‍ തുടങ്ങിയവരുടെ ശിഷ്യത്വം സ്വീകരിച്ചു. ഒന്നാം റാങ്കോടെ ഫൈസി ബിരുദം കരസ്ഥമാക്കി.
      ജാമിഅയിലെ പഠന ശേഷം കരിങ്ങനാട് മുദരിസായി ജോലിയേറ്റു.മൂന്ന് വര്‍ഷത്തെ സേവന ശേഷം ശൈഖുനാ ചാപ്പനങ്ങാടി ഉസ്താദിന്റെ നിര്‍ദ്ദേശ പ്രകാരം കോട്ടക്കല്‍ പാലപ്പുറയിലേക്ക് മാറി.എഴുപതോളം കുട്ടികള്‍ അന്ന് അവിടെ പഠനം നടത്തിയിരുന്നു.ഒന്‍പത് വര്‍ഷം അവിടെ തുടര്‍ന്നു.ശേഷം ചെമ്മന്‍കടവ്, വള്ളിക്കാഞ്ഞിരം, കൈനിക്കര, കാരത്തൂര്‍ ബദ്രിയ്യ, അയ്യായ, പൊന്മുണ്ടം എന്നിവിടങ്ങളിലും ദര്‍സ് നടത്തി.പിന്നീട് 22 വര്‍ഷം വാണിയന്നൂര്‍ മുദരിസായി സേവനം ചെയ്തു.അതിനു ശേഷം താനൂര്‍ ഇസ്‌ലാഹുല്‍ ഉലൂം അറബിക് കോളജില്‍ അധ്യാപകനായി.
      അര നൂറ്റാണ്ട് കാലം ദര്‍സ് മേഖലയില്‍ സജീവമായിരുന്ന മരക്കാര്‍ ഫൈസി സമസ്തയുടെ തിരൂര്‍ താലൂക്ക് പ്രസിഡണ്ടുമായിരുന്നു.ആയിരക്കണക്കിന് പണ്ഡിതരുടെ ഗുരുനാഥനാണ്.`,
      },
    ],
  },
  {
    name: " ഇ.കെ. അബൂബക്കർ മുസ്‌ലിയാർ",
    born: "Year-Month-Day",
    death: "1417/04/04",
    description: ` ഇ.കെ. അബൂബക്കർ മുസ്ലിയാർ, ഷംസുൽ-ഉലമ, "പണ്ഡിതന്മാരുടെ സൂര്യൻ" എന്ന് അനുയായികളാൽ അറിയപ്പെടുന്നു, ദക്ഷിണേന്ത്യയിലെ കേരളത്തിലെ ഒരു ശാഫിഈ പണ്ഡിതനും സമുദായ നേതാവുമായിരുന്നു, 1957 മുതൽ 1996 വരെ കേരളത്തിലെ  പ്രധാന സുന്നി-ശാഫിഈ പണ്ഡിതസഭയായ സമസ്ത കേരള ജംഇയത്തു ഉലമയുടെ ജനറൽ സെക്രട്ടറിയായി പ്രവർത്തിച്ചു.`,

    articles: [
      {
        title: " ജീവിതം",
        content: `ഹിജ്‌റ 1333-ൽ (ക്ര.1914) കോഴിക്കോടിനടുത്ത് പറമ്പിൽകടവിലെ എഴുത്തച്ഛൻകണ്ടി എന്ന തറവാട്ടിലാണ് ഇ.കെ.ജനിച്ചത്.യമനിൽ നിന്ന് കുടിയേറിപ്പാർത്ത പണ്ഡിത പരമ്പരയിലെ പ്രമുഖ കണ്ണി കോയക്കുട്ടി മുസ്‌ലിയാരാണ് പിതാവ്.
      1957 മുതൽ 1989 വരെ അവിഭക്ത സമസ്ത ജനറൽ സെക്രട്ടറി യും തുടർന്ന് 1989 ൽ സമസ്ത യിൽ അഭിപ്രായം വെത്യാസം കാരണം പിളർന്നു സമസ്ത രണ്ട് വിഭാഗം ആയി അങ്ങനെ സമസ്ത ഇകെ വിഭാഗം 1989 മുതൽ 1996 ൽ ദിവംഗതനാകുന്നതുവരെ ek വിഭാഗം സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമ ജനറൽ സെക്രട്ടറി ആയിരുന്നു.ഉജ്ജ്വല വാഗ്മിയും, സുന്നീ പ്രസ്ഥാനത്തിന്റെ പടനായകനുമായിരുന്ന ആ മഹാനുഭാവൻ സമസ്തയെ ഒരു അജയ്യ പ്രസ്ഥാനമാക്കി വളർത്തുന്നതിൽ വളരെയേറെ പ്രയത്‌നിച്ചിട്ടുണ്ട്.
       ഇ.കെ.ഹസൻ മുസ്‌ലിയാർ, കെ.കെ.അബൂബക്കർ ഹസ്‌റത്ത്, കോട്ടുമല അബൂബക്കർ മുസ്‌ലിയാർ, മടവൂർ സി.എം.വലിയുള്ളാഹി, സയ്യിദ് ഉമറലി ശിഹാബ് തങ്ങൾ, സയ്യിദ് ഹൈദരലി ശിഹാബ് തങ്ങൾ, എ.കെ.അബ്ദുറഹ്മാൻ മുസ്‌ലിയാർ, കെ.ആലിക്കുട്ടി മുസ്‌ലിയാർ തുടങ്ങി അനേകായിരം ബാഖവി, ഫൈസി, ദാരിമി മറ്റും ബിരുദധാരികൾ അദ്ദേഹത്തിന്റെ ശിഷ്യന്മാരായുണ്ട്.`,
      },
      {
        title: " ജീവിതരേഖ ",
        content: `യമനില് വേരുകളുള്ള കോയക്കുട്ടി മുസ്ലിയാരുടെയും ഫാത്തിമ ബീവിയുടേയും മകനായി കോഴിക്കോട് പറമ്പിൽകടവിലെ എഴുത്തച്ഛൻകണ്ടി തറവാട്ടിൽ 1914 ൽ ജനനം. വെല്ലൂര്  ഉപരിപഠനം നേടിയ അബൂബക്‌ർ മുസ്‌ലിയാർ, പഠനത്തിനു ശേഷം അവിടെതന്നെ അദ്ധ്യാപകനായി ചേർന്നു. 1948 ൽ അനാരോഗ്യം കാരണം വെല്ലൂർ വിടുകയും നാട്ടിൽ തിരിച്ചെത്തി തളിപ്പറമ്പ് ഖുവ്വത്തുൽ ഇസ്ലാം അറബിക് കോളേജ്, പാറക്കടവ് ജുമാമസ്ജിദ് എന്നിവിടങ്ങളിൽ അദ്ധ്യാപകനായി സേവനമനുഷ്ഠിക്കുകയും ചെയ്തു. പട്ടിക്കാട് ജാമിഅഃനൂരിയ്യ അറബിക് കോളേജിന്റെയും നന്തി ദാറുസ്സലാം കോളേജിന്റെയും പ്രിൻസിപ്പലായും അദ്ദേഹം സേവനം ചെയ്തു. ഒരു ബഹുഭാഷാ പണ്ഡിതനായിരുന്നു അബൂബക്‌ർ മുസ്‌ലിയാർക്ക് മലയാളം, ഇംഗ്ലീഷ്, അറബിക്, ഉർദു, തമിഴ്, പാഴ്സി എന്നിവയ്ക്ക് പുറമെ സുറിയാനി ഭാഷയിലും അറിവുണ്ടായിരുന്നു.ആനുകാലികങ്ങളിൽ നിരവധി ലേഖനങ്ങൾ എഴുതിയിട്ടുണ്ട്. ഖാദിയാനിസത്തെ ഖണ്ഡിക്കുന്ന ഗ്രന്ഥവും രിസാലാത്തുൽമാറദീനിയുടെ വ്യാഖ്യാനവും അദ്ദേഹത്തിന്റെ മുഖ്യ രചനകളാണ്‌. ഖാദിയാനികൾ കാഫിറുകൾ (അമുസ്ലിമുകൾ) എന്ന് ആദ്യം ഫത്‌വ (മതവിധി) പ്രഖ്യാപിച്ചത്‌ ഇദ്ദേഹമാണ്. പിന്നീട് ലോകത്തെ ബഹൂഭൂരിപക്ഷ മുസ്ലിംമത പണ്ഡിതരും ഇതേ രീതിയിലുള്ള ഫത്‌വ ഇറക്കുകയുണ്ടായി. ഇക്കാരണത്താൽ പാകിസ്താനിൽനിന്നുള്ള ഖാദിയാനികൾക്ക് ഹജ്ജ്‌ തീർഥാടനത്തിനു അനുമതി അവിടെത്തെ സർക്കാർ നൽക്കാറില്ല.`,
      },
      {
        title: " കുടുംബം",
        content: `ഫാത്തിമയാണ്‌ ഭാര്യ. അബ്ദുസ്സലാം, അബ്ദുൽ റഷീദ്, ആയിഷ, ആമിന, ബീവി, നഫീസ, ഹലീമ എന്നിവർ മക്കളാണ്‌. ഇ.കെ ഉമർ മുസ്‌ലിയാർ, ഇ.കെ ഉസ്മാൻ മുസ്‌ലിയാർ, ഇ.കെ അലി മുസ്‌ലിയാർ, ഇ.കെ അഹ്മദ്‌ മുസ്‌ലിയാർ മുറ്റിച്ചൂർ, ഇ.കെ ഹസ്സൻ മുസ്‌ലിയാർ, ഇ.കെ അബ്ദുല്ല മുസ്‌ലിയാർ എന്നിവർ സഹോദരന്മാരും ആമിന, ആയിഷ എന്നിവർ സഹോദരിമാരുമാണ്.`,
      },
      {
        title: " മരണം",
        content: `1996 ആഗസ്റ്റ് 19 ന് (ഹിജ്റ വർഷം:1417 റബീഉൽ ആഖിർ 4) സുബ്ഹി വാങ്കിന് ഉത്തരം നൽകി മരണപ്പെട്ടു. കോഴിക്കോട് പുതിയങ്ങാടി വരക്കൽ മഖാമിലാണ് ഖബറടക്കം ചെയ്തത്.`,
      },
    ],
  },
  {
    name: " ചെമ്മുക്കന്‍ കുഞ്ഞാപ്പു ഹാജി",
    born: "Year-Month-Day",
    death: "1442/04/06",
    description: `സമസ്ത കേരള സുന്നി മഹല്ല് ഫെഡറേഷന്‍ സംസ്ഥാന ജനറല്‍ സെക്രട്ടറിയും ദാറുല്‍ ഹുദാ ഇസ്‌ലാമിക്ക് യൂനിവേഴ്‌സിറ്റി ജനറല്‍ സെകട്ടറിയുമായ ചെമ്മുക്കന്‍ കുഞ്ഞാപ്പു ഹാജി. പട്ടിക്കാട് ജാമിഅ ജാമിഅ നൂരിയ്യ ട്രഷറര്‍ കൂടിയായിരുന്നു.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `സമസ്തയുടെയും മുസ്‌ലിം ലീഗിന്റെയും പ്രവര്‍ത്തനങ്ങളില്‍ സജീവ സാന്നിധ്യമായിരുന്നു കുഞ്ഞാപ്പു ഹാജി. 1971 മുതല്‍ പുലിക്കോട് മഹല്ല് സദനത്തുല്‍ ഇസ്‌ലാം സംഘം പ്രസിഡന്റായിരുന്നു. കോട്ടക്കല്‍ പഞ്ചായത്ത് മുസ്‌ലിം ലീഗ് പ്രസിഡന്റ് സ്ഥാനവും വഹിച്ചിരുന്നു. 1977 ല്‍ എസ്.എം.എഫ് രൂപീകരിച്ചതു മുതല്‍ മലപ്പുറം ജില്ലാ ജനറല്‍ സെക്രട്ടറി പദവും അലങ്കരിച്ചു. വളവന്നൂർ ബാഫഖി യതീംഖാന ജനറല്‍ സെക്രട്ടറിയായും സേവനമനുഷ്ഠിച്ചു.

      മലപ്പുറം ചെമ്മങ്കടവ് സ്വദേശി പറവത്ത് മറിയുമ്മ ഹജ്ജുമ്മയാണ് കുഞ്ഞാപ്പു ഹാജിയുടെ പ്രിയതമ.മക്കള്‍: മുഹമ്മദ് സലീം, അബ്ദുള്‍ നാസര്‍, ഖാലിദ്, ഹംസത്ത്, ജാഫര്‍, അബ്ദുല്ല ഉമറുല്‍ ഫാറൂഖ്, സിറാജ്, മുംതാസ്, ഫാത്തിമ, റൈഹാനത്ത്, സൗദ, സുമയ്യ.
      .`,
      },
    ],
  },
  {
    name: " കോട്ടുമല ടി.എം ബാപ്പു മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1438/04/11.  / 2017 ജനുവരി 10",
    description: `സമസ്ത  ( ഇ.കെ ) ജോയിൻറ് സെക്രട്ടറി, സമസ്ത  കേരളാ ഇസ്ലാം മത വിദ്യാഭ്യാസ ബോർഡ് ജനറൽ സെക്രട്ടറി , സമസ്ത ഫത്‌വ കമ്മിറ്റി കൺവീനർ, ജംഇയ്യതുൽ മുഫത്തിശീൻ സംസ്ഥാന പ്രസിഡന്റ് ,കടമേരി റഹ്മാനിയ്യ അറബിക് കോളേജ് പ്രിൻസിപ്പാൾ, എം.ഇ.എ എഞ്ചിനീയറിംഗ് കോളേജ് ജനറൽ കൺവീനർ, കേരള ഹജ്ജ് കമ്മറ്റി ചെയർമാൻ, സുപ്രഭാത ദിനപത്രം ചെയർമാൻ, എഡിറ്റർ,പബ്ലിഷർ എന്നീ നിലകളിൽ പ്രവർത്തിച്ചു.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `മലപ്പുറം ജില്ലയിലെ പെരിങ്ങോട്ടുപുലം മാരത്തോട് എന്ന സ്ഥലത്ത് അബൂബക്കർ മുസ്ലിയാർ മുരിങ്ങേക്കൽ ഫാത്തിമ ദമ്പതികളുടെ മകനായി 1952 ഫെബ്രുവരി 10 ഒരു ഞായറാഴ്ചയായിരുന്നു ജനനം. പെരിങ്ങോട്ടുപുലത്തെ ഓത്തുപള്ളി -സ്കൂളിൽ നിന്ന് പ്രാഥമിക പഠനം. ശേഷം പരപ്പനങ്ങാടി പനയത്തിൽ (ഒരു വർഷത്തിലധികം ) , ജാമിഅഃ നൂരിയ്യ അറബിക് കോളേജ് (ഒന്നാം ഘട്ടം 2 വർഷം), ആലത്തൂർ പടി (രണ്ട് വർഷം) ,പൊട്ടച്ചിറ അൻവരിയ്യ (3 വർഷം) , ജാമിഅഃ നൂരിയ്യ അറബിക് കോളേജ് ( രണ്ടാം ഘട്ടം 4 വർഷം) എന്നിങ്ങനെ മതപഠനം നടത്തി. (1974-ൽ)ഫൈസി ബിരുദം നേടി.
      പിതാവ് ശൈഖുനാ കോട്ടുമല അബൂബകർ മുസ്ലിയാർ, ഇ കെ അബൂബക്കർ മുസ്ലിയാർ, കെ കെ അബൂബകർ ഹസ്രത്, വല്ലപ്പുഴ ഉണ്ണീൻകുട്ടി മുസ്ലിയാർ, കോക്കൂർ കുഞ്ഞി മുഹമ്മദ് മുസ്‌ലിയാർ എന്നിവരായിരുന്നു പ്രധാന ഗുരുനാഥൻമാർ.`,
      },
      {
        title: " സേവനം",
        content: `രണ്ടു വർഷത്തെ അരിപ്ര വേളൂർ ജുമുഅ മസ്ജിദിൽ ദർസ് നടത്തി കൊണ്ടാണ് ജ്ഞാന മേഖലയിലെ സേവനത്തിന് അദ്ദേഹം തുടക്കം കുറിച്ചത് , തുടർന്ന് പിതാവിൻറെ നിർദ്ദേശ പ്രകാരം ഒരു വർഷം നന്തി ദാറുസ്സലാമിലും , 38 വർഷം കടമേരി റഹ്മാനിയ്യയിലുമായി സേവനം നടത്തി. ഇന്ത്യയിലെ തന്നെ മികച്ച മതഭൗതിക വിദ്യാഭ്യാസ സ്ഥാപനമായി റഹ്മാനിയ്യയെ മാറ്റിയെടുക്കുന്നതിൽ അദ്ദേഹം വലിയ പങ്ക് വഹിച്ചു.
                        .`,
      },
    ],
  },
  {
    name: " അത്തിപ്പറ്റ മൊയ്തീൻ കുട്ടി മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1440/04/11",
    description: `അത്തിപ്പറ്റ മൊയ്തീൻ കുട്ടി മുസ്ലിയാർ അത്തിപ്പറ്റ ഉസ്താദ് ഒരു ഇസ്ലാമിക പണ്ഡിതനും സമുദായ നേതാവും ഇഖ്വാനി ട്രസ്റ്റിന്റെയും (ലാഭരഹിത വിദ്യാഭ്യാസ സ്ഥാപനം) ഗ്രേസ് വാലി പബ്ലിക് സ്കൂളിന്റെയും സ്ഥാപകനുമായിരുന്നു.`,
    articles: [
      {
        title: " വ്യക്തിഗത ജീവിതവും വിദ്യാഭ്യാസവും",
        content: `1936 സെപ്തംബർ 18 മലപ്പുറം ജില്ലയിലെ കോട്ടക്കലിനടുത്തുള്ള അച്ചിപ്പുരയില് ജനിച്ചു . മാപ്പിള കവിയും എഴുത്തുകാരനും വൈദ്യനും അധ്യാപകനുമായിരുന്ന പാലക്കാട്ട് മൊയ്തീൻകുട്ടി മുസ്‌ലിയാരായിരുന്നു പിതാവ്. പ്രാഥമിക വിദ്യാഭ്യാസത്തിനു ശേഷം പിതൃസഹോദരൻ കുഞ്ഞാലൻകുട്ടി മുസ്‌ലിയാർ, അണക്കര സൈദലവി മുസ്‌ലിയാർ, പുലിക്കോട് മൊയ്തു മുസ്‌ലിയാർ, വഹ്‌സി മുഹമ്മദ് മുസ്‌ലിയാർ എന്നിവരുടെ കീഴിൽ മതപഠനം നടത്തി.
      അച്ചിപ്പുര ചെറുപറമ്പ് മദ്രസ, നൂറുൽ ഇസ്ലാം മദ്രസ തെക്ക് വള്ളം പെരുമ്പാവൂർ, കിഴക്കേപ്പുര രണ്ടത്താണി മദ്രസ, പന്താരങ്ങാടി മദ്രസ, തൃശൂർ അകലാട് മദ്രസ, സിറത്തു സേവിയ് മദ്രസ ചേർപ്പ് ചെറുചേനം എന്നിവിടങ്ങളിൽ പ്രവർത്തിച്ചിട്ടുണ്ട്.
      28 വർഷം(1977 - 2006 കാലഘട്ടത്തിൽ) യൂ എ ഇന്റെ കീഴിൽ ഇമാം ആയിരുന്നു .
      1988ൽ അൽഐൻ ദാറുൽ ഹുദാ സ്കൂളിന്റെ സ്ഥാപകനും ചെയർമാനുമായി മൊഹ്യുദ്ധീൻ കുട്ടി മുസ്‌ലിയാർ.`,
      },
      {
        title: " മരണം",
        content: "  അത്തിപ്പറ്റയിലെ വസതിയിൽ 2018 ഡിസംബർ 19 ന് 82 ആം വയസ്സിൽ.",
      },
    ],
  },
  {
    name: " മിതാബൈൽ ജബ്ബാർ ഉസ്താദ്",
    born: "Year-Month-Day",
    death: "1440/05/02",
    description:
      " മിതാബൈൽ ജബ്ബാർ ഉസ്താദ്, ജ്യോതിശാസ്ത്രം, ദൈവശാസ്ത്രം, ഹദീസ് എന്നിവയിൽ മഹാ പണ്ഡിതൻ.",
    articles: [
      {
        title: " ജീവിതം",
        content: `ഉത്തരേന്ത്യയിലെ ദേവ്ബന്ദിൽ പഠിക്കുകയും ഖാസ്മി പദവി പിന്തുടരുകയും ചെയ്ത ഒരു പണ്ഡിതൻ
      മുതിർന്ന മതപണ്ഡിതനും സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമ വൈസ് പ്രസിഡന്റെ കർണാടക ഇസ്‌ലാമിക് അക്കാദമി ഡയറക്‌ടറുമായ കുമ്പ്ര ശൈഖുനാ അൽഹാജ് അബ്ദുൽ ജബ്ബാർ മുസ്‌ലിയാർ മിത്താബയിൽ ഉസ്താദ്.
      അവിഭക്ത ഡികെ ജില്ലയിലെ മുസ്ലീം സമുദായത്തിന്റെ ആത്മീയ നേതാവായിരുന്ന ജബ്ബാർ ഉസ്താദ്, ലക്ഷ്വദീപ് കിൽത്താൻ ഖാസി ഷെയ്ഖ് കെ.പി.സിറാജ് കോയയുടെയും കണ്ണിപ്പുരിലെ മർഹൂമത്ത് ബീബി ഫാത്തിമയുടെയും രണ്ടാമത്തെ മകനാണ്.മിത്താബയിൽ ഉസ്താദ് എന്ന പേരിൽ പ്രശസ്തനായ അദ്ദേഹം 49 വർഷമായി ബിസി റോഡ് മിത്താബയിൽ ജുമാ മസ്ജിദിൽ മുദർരിസായി ജോലി ചെയ്തുവരികയായിരുന്നു.
      കുടുംബത്തോടൊപ്പം മിഠാബെയിലിന് സമീപം ശാന്തിയങ്ങാടിയിലെ വീട്ടിലായിരുന്നു താമസം.ആരോഗ്യപ്രശ്നങ്ങൾക്കിടയിലും അദ്ദേഹം മതപരമായ പരിപാടികളിലും ടൂറുകളിലും സജീവമായി പങ്കെടുത്തു.`,
      },
    ],
  },
  {
    name: " വാളക്കുളം അബ്ദുൽ ബാരി മുസ്‌ലിയാർ ",
    born: "Year-Month-Day",
    death: "1385/05/02",
    description:
      " ഇരുപതാം നൂറ്റാണ്ടിൽ കേരളത്തിൽ ജീവിച്ച പ്രമുഖ ഇസ്ലാമിക പണ്ഡിതനും, ആധ്യാത്മിക ജ്ഞാനിയുമാണ് അബ്ദുൽ ഹഖ് മുഹമ്മദ് അബ്ദുൽ ബാരി.",
    articles: [
      {
        title: " ജീവിതം",
        content: `ഹിജ്റ 1298 ജമാദുൽ ആഖർ 22-നാണ് അബ്ദുൽ ബാരി മുസ്ലിയാരുടെ ജനനം. പൗര പ്രമുഖനും രിഫാഇയ്യ, ഖാദിരിയ്യ സൂഫി ത്വരീഖത്തുകളുടെ ശൈഖും പ്രസിദ്ധ പണ്ഡിതനുമായിരുന്ന ഖാജാ അഹ്മദ് എന്ന കോയാമുട്ടി മുസ്ലിയാർ ആണ് മുഹമ്മദ് അബ്ദുൽ ബാരിയുടെ പിതാവ്.
      മുഹമ്മദ് അബ്ദുൽ ബാരിക്ക് പിതാവിനെ പോലെ മത രംഗത്തും സേവന രംഗത്തും ശ്രദ്ധ പതിപ്പിക്കാനായിരുന്നു താൽപര്യം.സ്വ പിതാവിൽ നിന്നും പ്രാഥമിക പഠനം പൂർത്തിയാക്കിയ അദ്ദേഹം നാദാപുരം, തിരൂരങ്ങാടി, ദർസ്സുകളിൽ പഠിച്ചു പൊന്നാനി ദർസിൽ വിളക്കത്തിരുന്നു മുസ്‌ലിയാർ പട്ടം നേടി.പ്രശസ്തരായ മഖ്ദൂം അഹ്മദ് വലിയ ബാവ, മഖ്ദൂം ചെറിയ ബാവ എന്നിവരായിരുന്നു പൊന്നാനിയിലെ ഗുരുക്കന്മാർ.പൊന്നാനി പഠനത്തിന് ശേഷം ഉപരിപഠനത്തിനായി 1898-ൽ വെല്ലൂർ ബാഖിയാത്തിൽ ചേർന്ന അദ്ദേഹം.അഞ്ചു വർഷകാല പഠന ശേഷം ബാഖവി ബിരുധം നേടി.തുടർന്ന് കോഴിക്കോട്, അയ്യായ, പുതുപ്പറമ്പ് എന്നിവിടങ്ങളിൽ ദർസ് മുദരിസ്സായി(പ്രധാനദ്ധ്യാപകൻ) ആയി ജോലി നോക്കി.ആധ്യാത്മിക പാതയിൽ പരപ്പനങ്ങാടി ഔക്കോയ മുസ്ലിയാർ, കോഴിക്കോട് അപ്പാണി കുഞാമുട്ടി ഹാജി എന്നിവരുടെ ശിഷ്വത്വം സ്വീകരിച്ചു.സമസ്ത കേരള, സമസ്ത കേരള ഇസ്ലാം മത വിദ്യാഭ്യാസ ബോർഡ്, സുന്നി യുജവനസംഘം എന്നീ മത സംഘടനകളുടെ രൂപീകരണത്തിൽ സജീവ പങ്കു വഹിച്ച ഇദ്ദേഹമാണ് വാളക്കുളം പുതുപ്പറമ്പ് ബയാനുൽ ഇസ്ലാം മദ്രസ, മൗലവിയ്യ കോളേജ് മസ്ജിദുൽ ബാരി, ഖുതുബ് ഖാന എന്നിവ നിർമ്മിച്ചത്.ജാമിഅ നൂരിയ്യ അറബിക്ക് കോളേജ് സ്ഥാപിക്കാനും അൽ ബയാൻ മാസിക ഇറക്കാനും മുന്നിട്ടിറങ്ങിയതും ബാരി മുസ്‌ലിയാർ ആയിരുന്നു.ഇംഗ്ലീഷ്, ഉറുദു, പാർസി തുടങ്ങിയ വിവിധ ഭാഷകൾ അനായാസം കൈകാര്യം ചെയ്തിരുന്ന അദ്ദേഹം നല്ലൊരു വാഗ്മിയും ആ കാലത്ത് നല്ല മലയാളത്തിൽ പ്രസംഗിക്കുന്ന ചുരുക്കം മുസ്ലിം പണ്ഡിതരിലൊരാളായിരുന്നു.
      അന്നത്തെ പാരമ്പര്യ പണ്ഡിതന്മാരിൽ നിന്നും വ്യത്യസ്തമായി ഭൗതിക വിദ്യാഭ്യാസത്തെ പ്രോത്സാഹിപ്പിക്കുന്ന സമീപനമായിരുന്നു ബാരി മുസ്ലിയാരുടേത്.സ്വന്തം ചിലവിൽ എൽ.പി സ്കൂൾ സ്ഥാപിക്കുകയും നടത്തി കൊണ്ട് പോവുകയും ചെയ്തിരുന്നു പിന്നീട് സർക്കാർ ഏറ്റെടുക്കുകയും ശേഷം പുതുപ്പറമ്പ് ഗവ.ഹൈസ്കൂളായി അതുയർത്തി കൊണ്ട് വരികയുമുണ്ടായി
      ബുഖാരി, മുസ്ലിമിന്റെ 2648 ഹദീസുകളടങ്ങിയ സിഹാഹുശ്ശൈഖൈൻ, ജംഉൽ ബാരി, ഫത്ഹുൽ ബാരി, അൽ മൻഖൂസ് തുടങ്ങി നിരവധി ഗ്രന്ഥങ്ങൾ അദ്ദേഹം രചിച്ചിട്ടുണ്ട്.
      1926 മുതൽ 1945 വരെ സമസ്ത കേരള ജം ഇ യ്യത്തുൽ ഉലമായുടെ വൈസ് പ്രസിഡണ്ടും 1945 - 1965 കാലയളവിൽ പ്രസിഡണ്ടുമായി സേവനമനുഷ്ടിച്ചു.വിയോഗം 1385 ജമാദുൽ അവ്വൽ 2(1965 ജൂലൈ 29) ന്.`,
      },
    ],
  },
  {
    name: " ചെറുശേരി സൈനുദ്ധീൻ മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1437/05/09",
    description: `1980 മുതൽ പണ്ഡിത സഭയിൽ അംഗമായ അദ്ദേഹം ഫത്‌വ കമ്മിറ്റി ചെയർമാൻ പദവിയും വഹിച്ചിരുന്നു. ജനറൽ സെക്രട്ടറിയായിരുന്ന ഇ കെ അബൂബക്കർ മുസ്ലിയാരുടെ നിര്യാണത്തെ തുടർന്ന് 1996ൽ സമസ്തയുടെ നേതൃപദവി ഏറ്റെടുത്തു. ഇസ്‌ലാമിക കർമ ശാസ്ത്രത്തിൽ ആഴത്തിൽ പഠനം നടത്തിയിട്ടുള്ള ചെറുശേരി സൈനുദ്ദീൻ മുസ്‌ലിയാർ,  വൈസ് പ്രസിഡന്റ്, പരീക്ഷാ ബോർഡ് വൈസ് ചെയർമാൻ, സുന്നി മഹല്ല് ഫെഡറേഷൻ സംസ്ഥാന പ്രസിഡന്റ്, താനൂർ ഇസ്‌ലാഹുൽ ഉലൂം അറബിക് കോളജ് മാനേജർ സ്ഥാനങ്ങൾ വഹിച്ചിട്ടുള്ള അദ്ദേഹം നിരവധി മഹല്ലുകളുടെ ഖാസിയുമായിരുന്നു.`,
    articles: [
      {
        title: " ജനനം",
        content: `മലപ്പുറം ജില്ലയിലെ പ്രശസ്ത പണ്ഡിത കുടുംബമായ ഖാസിയാരകം കുടുംബത്തിൽ ചെറുശ്ശേരി മുഹമ്മദ് മുസ്‌ലിയാർ പാത്തുമ്മുണ്ണി ദമ്പതികളുടെ ഏക മകനായി 1937ലായിരുന്നു ജനനം. വീടിന് സമീപത്തെ ഖാസിയാരകം പള്ളിയിൽ നിന്നായിരുന്നു പ്രാഥമിക പഠനം. കൊണ്ടോട്ടി സ്‌കൂളിൽ ഭൗതിക വിദ്യാഭ്യാസത്തിന് ശേഷം മഞ്ചേരി, ചാലിയം എന്നീ ദർസുകളിൽ മതപഠനം നടത്തി. പിതാവ് ചെറുശ്ശേരി മുഹമ്മദ് മുസ്‌ലിയാർ, ഓവുങ്ങൽ അബ്ദുറഹ്മാൻ മുസ്‌ലിയാർ, ഓടയ്ക്കൽ സൈനുദ്ദീൻ കുട്ടി മുസ്‌ലിയാർ എന്നിവരായിരുന്നു പ്രധാന ഗുരുനാഥൻമാർ. പള്ളി ദർസുകളിലെ പഠനത്തിനു ശേഷം വളരെ ചെറുപ്രായത്തിൽ തന്നെ മുദരിസായി.`,
      },
      {
        title: " സേവനം ",
        content: `കൊണ്ടോട്ടി ജുമുഅ മസ്ജിദിൽ 22 വർഷത്തോളം മുദരിസായിരുന്നു. ശേഷം 18 വർഷത്തോളം ചെമ്മാട് മുദരിസായി. 1994 മുതൽ ചെമ്മാട് ദാറുൽ ഹുദയിൽ സേവനം. എം.എം ബശീർ മുസ്‌ലിയാരുടെ നിര്യാണത്തോടെ ദാറുൽ ഹുദയുടെ പ്രിൻസിപ്പൽ സ്ഥാനത്ത് നിയമിതനായി. ദാറുൽ ഹുദ ഇസ്‌ലാമിക് യൂനിവേഴ്സിറ്റിയായി ഉയർന്നപ്പോൾ പ്രോ ചാൻസലറായി നിയമിക്കപ്പെട്ടു. ഇന്ത്യയിലെ തന്നെ മികച്ച മതഭൗതിക വിദ്യാഭ്യാസ സ്ഥാപനമായി ദാറുൽഹുദയെ മാറ്റിയെടുക്കുന്നതിൽ ചെറുശേരി സൈനുദ്ദീൻ മുസ്‌ലിയാർ വലിയ പങ്ക് വഹിച്ചു.`,
      },
      {
        title: " മരണം ",
        content: "2016 ഫെബ്രുവരി 18ന് പുലർച്ചെ മരണപ്പെട്ടു.",
      },
    ],
  },
  {
    name: " ആലി മുസ്‌ലിയാർ",
    born: "Year-Month-Day",
    death: "17/02/1922",
    description: `1922, ഫെബ്രുവരി 17, വെള്ളിയാഴ്ച ദിവസം.
      കോയമ്പത്തൂർ സെന്ട്രൽ ജയിലിന്റെ 11-ാം ബ്ലോകിലെ ആ സെല്ലിൽ സുബ്ഹി നിസ്കാരം കഴിഞ്ഞ് ഇരിക്കുകയാണ് ആലി മുസ്ല‌ിയാർ.ബ്രിട്ടീഷുകാർക്കെതിരെ സമരം നടത്തി എന്ന കാരണത്തിന് വധ ശിക്ഷ വിധിച്ച് അത് നടപ്പാക്കാനായി, കോയമ്പത്തൂരിലെത്തിച്ചതായിരുന്നു അദ്ദേഹത്തെ.
      അൽപം കഴിഞ്ഞപ്പോൾ, ജയിലുദ്യോഗസ്ഥൻ വന്ന് ഇങ്ങനെ പറഞ്ഞു, താങ്കളെ തൂക്കിലേറ്റാൻ കൊണ്ട് പോവുകയാണ്, അവസാനമായി എന്തെങ്കിലും ആഗ്രഹമുണ്ടോ.
      ഖാദിരിയ്യ സ്യൂഫിയും തികഞ്ഞ പണ്ഡിതനുമായിരുന്ന അദ്ദേഹത്തിന്, അധികമൊന്നും ആലോചിക്കാനുണ്ടായിരുന്നില്ല, പുഞ്ചിരിച്ച് കൊണ്ട് അദ്ദേഹം ഇങ്ങനെ മറുപടി പഞ്ഞു.അൽപം വെള്ളം കിട്ടിയാൽ, ഒന്ന് കൂടി വളു ചെയ്ത്, രണ്ട് റകഅത്ത് സുന്നത്ത് നിസ്കരിക്കാമായിരുന്നു.
      വുളു ചെയ്ത്, നിസ്കാരത്തിലേക്ക് പ്രവേശിച്ച അദ്ദേഹം, പ്രാർത്ഥനയുമായി നാഥന്റെ മുമ്പിൽ സുജൂദിൽ കിടന്നു.അത് അദ്ദേഹത്തിൻ്റെ അവസാന ചലനമായിരുന്നു.ബ്രിട്ടീഷ് സാമ്രാജ്യത്തിന്റെ തൂക്കുകയറിനെ പോലും തോൽപ്പിച്ച് മഹാനുഭാവൻ ആ സുജൂദിൽ തന്നെ അല്ലാഹുവിലേക്ക് യാത്രയായി. 58 വയസ്സ് മാത്രമായിരുന്നു അദ്ദേഹത്തിന്റെ പ്രായം.ബ്രിട്ടീഷ് വായനകളിൽ അദ്ദേഹത്തെ തൂക്കിലേറ്റി എന്ന് കാണാമെങ്കിലും, ജനങ്ങളറിയാതിരിക്കാനായി അധികൃതർ ആ മൃതദേഹത്തെ ശേഷം തൂക്കിലേറ്റുകയായിരുന്നു എന്നാണ് ചരിത്രം മനസ്സിലാക്കി തരുന്നത്.
      ചരിത്രം വക്രീകരിക്കപ്പെടുന്ന ഇക്കാലത്ത്, എരിക്കുന്നൻപാലത്ത് മുലയിൽ കുഞ്ഞിമൊയ്തീൻ പുത്രൻ ആലി മുസ്‌ലിയാർ എന്ന ആ ധീരദേശാഭിമാനിയുടെ ഓർമ്മകൾ നമുക്ക് പുതുക്കിക്കൊണ്ടേയിരിക്കാം.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `1864 ൽ മഞ്ചേരി നെല്ലിക്കുത്തിലെ എരിക്കുന്നൻ പാലത്ത് മുലയിൽ കുഞ്ഞിമൊയ്തീന്റെയും പൊന്നാനിയിലെ മഖ്‌ദൂം കുടുംബത്തിലെ ഒറ്റകത്ത് മുഹമ്മദ് കുട്ടി മുസ്ലിയാരുടെ മകൾ ആമിനയുടെയും മകനായി ആലി മുസ്‌ലിയാർ എന്ന ഇതിഹാസപുരുഷൻ ജന്മം കൊണ്ടു. പാരമ്പര്യ ബ്രിട്ടീഷ് വിരുദ്ധരും അചഞ്ചലമത വിശ്വാസികളുമായിരുന്നു ഈ കുലീന കുടുംബം. ബാല്യകാലത്ത് തന്നെ ആലി മുസ്ലിയാർ ധീരനും ബുദ്ധി ശാലിയുമായിരുന്നു. നെല്ലിക്കുത്ത് ഓത്തുപള്ളിയിലെ പ്രാഥമിക പഠനവും തുടർന്ന് പൊന്നാനിയിലെ പത്തുവർഷത്തെ മതവിദ്യാഭ്യാസവും അദ്ദേഹത്തെ ഉത്തമ മതപണ്ഡിതനാക്കി. സൈനുദ്ധീൻ മഖ്‌ദും, കൊങ്ങണം വീട്ടിൽ ഇബ്രാഹിം മുസ‌ലിയാർ, പുതിയകത്ത് ചെറിയ ബാവ മുസ്‌ലിയാർ ഉൾപെടെയുള്ള പണ്ഡിതകേസരികളായിരുന്നു ആലി മുസ്‌ലിയാരുടെ പ്രധാന ഗുരുക്കന്മാർ.
      ശേഷം 8 വർഷത്തോളം മക്കയിൽ കഴിച്ച് കൂട്ടി, സൈനി ദഹ്‌ലാൻ ഉൾപെടെയുള്ള പ്രമുഖ ഗുരുക്കന്മാരിൽ നിന്ന് വിശിഷ്യ തസവുഫ് ഉൾപെടെയുള്ള നിരവധി ഫന്നുകളിൽ അഗാധപരിജ്ഞാനവും നേടി.മക്കയിൽ നിന്ന് തിരിച്ചെത്തിയ ശേഷം ലക്ഷദ്വീപിലെ കവരത്തിയിൽ അദ്ദേഹം ഖാദിയും അധ്യാപകനുമായിരുന്നു. 1896- ൽ മഞ്ചേരിയിൽ നടന്ന കർഷക കലാപമാണ് ആലി മുസ്ലിയാരുടെ ബ്രിട്ടീഷ് വിരോധത്തിന് മൂർച്ച കൂട്ടിയത്. 1894-ൽ തൻ്റെ ജ്യേഷ്ടനെ ബ്രിട്ടീഷുകാർ വധിച്ചു എന്ന വിവരമറിഞ്ഞതോടെയാണ് ആലി മുസ്‌ലിയാർ ലക്ഷദ്വിപിൽ നിന്നും തന്റെ ജന്മനാടായ ഏറനാട്ടിലേക്ക് തിരിച്ചു വരുന്നത്.അദ്ദേഹം നാട്ടിൽ എത്തുന്നതിന് മുമ്പേ സഹോദരൻ അബ്‌ദുല്ല ഹാജിയെ ബ്രിട്ടീഷുകാർ നാടുകടത്തിയിരുന്നു.
      തിരൂരങ്ങാടി പള്ളി കേന്ദ്രമാക്കിയാണ് ആലി മുസ്ലിയാർ അധിനിവേശ പോരാട്ടത്തിനിറങ്ങുന്നത്. 1907 ലാണ് അദ്ദേഹം തിരൂരങ്ങാടി പള്ളിയിൽ പ്രധാന അധ്യാപകനായി നിയമിക്കപെടുന്നത്.പിന്നീട് ക്രമേണ അദ്ദേഹം ഖിലാഫത്തിലേക്കും കോൺഗ്രസിലേക്കും ഇറങ്ങി ചെന്നു.ഇന്ത്യൻ നാഷണൽ കോൺഗ്രസും നിസ്സഹകരണ പ്രസ്ഥാനവുമായി ആലി മുസ്ലിയാർ ബന്ധം സ്ഥാപിക്കാനുള്ള സുപ്രധാന കാരണം എംപി നാരായണ മേനോനും കട്ടിലശ്ശേരിയുമായുള്ള സൗഹൃദമായിരുന്നു.പിന്നീട് ഗാന്ധിജി വരെ പങ്കെടുത്ത കോഴിക്കോട് സമ്മേളനത്തിൽ വാരിയൻ കുന്നപ്പം ആലി മുസ്ലിയാരും പങ്കെടുത്തിരുന്നു.
      അതോടൊപ്പം എറനാട്ടിലെ ഖിലഫത്ത് സഭയുടെ ചുമതല ഏറ്റെടുക്കുകയും ചെയ്തിരുന്നു. 1920 അവസാനത്തോടെയാണ് അദ്ദേഹം തിരൂരങ്ങാടിയിൽ ഖിലാഫത്ത് കമ്മിറ്റിക്ക് രൂപം നൽകിയത്.ബ്രിട്ടീഷ് സമരങ്ങളിൽ ജ്വലിച്ചു നിൽക്കുന്നത് ഒരു മതപണ്ഡിതൻ ആയതു കൊണ്ടുതന്നെ.ജനങ്ങളെല്ലാം എളുപ്പത്തിൽ പ്രസ്ഥാനത്തിലേക്ക് ആകർഷിക്കപ്പെട്ടു.അദ്ദേഹം കടന്നു വരുമ്പോഴെല്ലാം ജനങ്ങൾ തക്‌ബീറുകൾ മുഴക്കാറുണ്ടായിരുന്നു.ഇത് കണ്ട് വിറളി പിടിച്ച ഭരണാധികാരികൾ അദ്ദേഹം ബ്രിട്ടീഷ് വിതവത പ്രചരിപ്പിക്കുകയാണെന്ന് വിലയിരുത്തുകയും അവിടെ നടന്നിരുന്ന നേർച്ചകൾക്കും റാത്തിബുകൾക്കും വിലക്കേർപ്പെടുത്തുകയുമായിരുന്നു.ഇതോടെയാണ് മലബാർ കലാപത്തിന് വിത്തുപാകുന്നത്.ഈ നിയമത്തെ ലംഘിച്ചു കൊണ്ടാണ് ആലി മുസ്ലിയാരുടെ നേതൃത്വത്തിൽ ചേറുർ നേർച്ച അരങ്ങേറിയത്.ഇത് തുടർന്നതോടെ വിലക്ക് ലംഘിക്കുന്നവരെ നേരിടുമെന്ന് കളക്ടർ ആലി മുസ്ലിയാർക്ക് കത്തയച്ചു.പിന്നീട് ആരാധന തടയാൻ വന്ന നിയമപാലകരെ തള്ളി വീഴ്ത്തി കൊണ്ട് അദ്ദേഹവും സംഘവും സിയറാത്ത് യാത്ര നടത്തി.ഇതിനെ തുടർന്ന് മലബാർ കളക്ടർ തോമസ് ഉൾപ്പെടെയുള്ള അഞ്ഞുറോളം പട്ടാളക്കാർ തിരൂരങ്ങാടിയിലേക്ക് ഇരച്ചു കയറുകയും കിഴക്കേപള്ളിയിലും മറ്റു അനവധി മാപ്പിള വീടുകളിലും പരിശോധന നടത്തുകയും പലരെയും അറസ്റ്റ് ചെയ്യുകയും ചെയ്‌തു.പക്ഷെ അവരെ ചോദ്യം ചെയ്തിട്ടും ഒന്നും കണ്ടെത്താൻ സാധിച്ചില്ല.
      എരി തീയിൽ എണ്ണ ഒഴിക്കുന്നത് പോലെ, പള്ളിയിൽ പട്ടാളം ബുട്ടിട്ട് കയറിയെന്നും മമ്പുറം മഖാം തകർത്തു എന്നൊക്കെയുള്ള വ്യാജവർത്തകൾ പരന്നു. 1921 ആഗസ്റ്റ് 20 ന് അറസ്റ്റു ചെയ്ത മൂന്ന് ആളുകളെ വിട്ടയ്ക്കണമെന്ന ആവശ്യവുമായി ആലി മുസ്ലിയാർ ഉൾപെടെയുള്ള ഒരു സംഘം തിരൂരങ്ങാടി പോലീസ് സ്റ്റേഷനിൽ എത്തി.എസ് പി റൗള അവരോട് ഇരിക്കാൻ ആവശ്യപ്പെടുകയായിരുന്നു.ഉത്തരവ് അനുകരിച്ചു അവിടെ കാത്തിരുന്നപ്പോൾ കേട്ടത് വെടിയൊച്ചയുടെ ശബ്ദങ്ങളായിരുന്നു.പിന്നീട് അവിടെ രൂക്ഷമായ പോരാട്ടമായിരുന്നു.ഈ സംഘർഷത്തിൽ റൗളി ഉൾപ്പെടെ നിരവധി പേർ കൊല്ലപ്പെടുകയും ചെയ്തു.മലബാറിലെ കളക്ടർ തോമസിന്റെ അശാസ്ത്രീയ നടപടികളാണ് കാര്യങ്ങൾ ഈ നിലയിൽ എത്തിച്ചത്.സംഘർഷം അതിരൂക്ഷമായപ്പോൾ നേരിടാനാവാതെ ബ്രിട്ടീഷ് സൈന്യം പിന്തിരിഞ്ഞോടി.
      പിറ്റേദിവസവും നിരവധി അക്രമങ്ങൾ അരങ്ങേറി ആഗസ്റ്റ് 21 ന് ആലി മുസ്‌ലിയാർ ഭരണാധികാരിയായി പ്രഖ്യാപിക്കപ്പെട്ടു.കോൺഗ്രസ് സമരത്തെ നിരാകരിച്ചപ്പോൾ മറ്റ് അധികാര കേന്ദ്രങ്ങളുടെ അഭാവത്തിൽ ആലി മുസ്‌ലിയാർ നേരിട്ട് കാര്യങ്ങൾ നിയന്ത്രിക്കാൻ തുടങ്ങി.തുടർന്ന് കെ പി കേശവമേനോൻ ഉൾപ്പെടെയുള്ളവർ ആലി മുസ്ലിയാരെ സന്ദർശിക്കുകയും കലാപസാധ്യതകളെ കുറിച്ച് സംസാരിക്കുകയും കീഴടങ്ങൽ ആണ് ഉത്തമെന്ന് ഉപദേശിക്കുകയും ചെയ്തു.സഹപ്രവർത്തകാരോട് കൂടിയാലോചിച്ച ശേഷമാവാം തീരുമാനം എന്നായിരുന്നു അദ്ദേഹത്തിൻന്റെ മറുപടി.വാരിയൻ കുന്നത്തും ലവക്കുട്ടിയും കുഞ്ഞലവിയും ഇത് അംഗീകരിക്കാൻ തയ്യാറയില്ല.പോരാടി മരിക്കുമെന്നായിരുന്നു ലവക്കുട്ടിയുടെ മറുപടി.
      1921 ആഗസ്റ്റ് 30 ന് സായുധരായ വർസേനാവ്യൂഹം തിരൂരങ്ങാടി കിഴക്കേ പള്ളി വലയം ചെയ്തു.ആലി മുസ്‌ലിയാരും ആറോളം അനുയായികളും പള്ളിയുടെ മുകളിൽ ഉണ്ടായിരുന്നു.വെള്ളക്കൊടി പിടിച്ചു കീഴടങ്ങാനായിരുന്നു സോയുടെ ആവശ്യം...പ്രതികരണം രാവിലെ അറിയിക്കാമെന്ന് ആലി മുസ്‌ലിയാർ അവരെ അറിയിച്ചു.ആലി മുസ്ലിയാരും കൂട്ടരും ഹദ്ദാദ് ചൊല്ലി, പ്രാർത്ഥന നടത്തി, മധുരവിതരണം കൂടി നടത്തിയാണ് ആ രാത്രി ഉറങ്ങാൻ കിടന്നത്.

      അവരുടെ മറുപടിക്ക് കാത്ത് നിൽക്കാതെ, സുബ്‌ഹി നിസ്ക‌ാരത്തോട് കൂടി സൈന്യം പള്ളിയിലേക്ക് വെടിയുതിർക്കുകയായിരുന്നു.വൈകുന്നേരം വരെ പോരാട്ടം നിണ്ടുനിന്നു.അക്ഷമരായ സൈനികർ പീരങ്കി ഉപയോഗിച്ചു പള്ളി തകർക്കുമെന്ന് താക്കീത് നൽകി.ഇതോടെ പള്ളി തകർക്കുന്നത് ഒഴിവാക്കാൻ ആലി മുസലിയാർ ഉൾപെടെ 36 ആളുകൾ സൈന്യത്തിന് കീഴടങ്ങി.ഈ സംഘത്തെ ഉടനെ കോഴിക്കോട് എത്തിക്കുകയും ബ്രിട്ടീഷ് ചക്രവർത്തിക്കെതിരായി യുദ്ധത്തിലേർപ്പെട്ട എന്ന കുറ്റം ചുമത്തി ചോദ്യം ചെയ്യുകയും ചെയ്‌തു.നവംബർ 20ന് ആലി മുസ്ലിയാർ ഉൾപെടെ പത്തുപേരെ വധശിക്ഷക്ക് വിധിച്ചു.
                        തുടർന്ന്, ശിക്ഷ നടപ്പാക്കാനായി അദ്ദേഹത്തെ കോയമ്പത്തൂരിലേക്ക് കൊണ്ട് പോയി.അദ്ദേഹത്തിന്റെ ഖബ്‌റ് സിയാറത്ത് കേന്ദ്രമാവുമോ എന്നും അത് ജനങ്ങൾക്ക് ആവേശം പകരുമോ എന്നു പോലും ഭയപ്പെട്ടത് കൊണ്ടായിരുന്നു അവർ അങ്ങനെ ചെയ്തത്.വാരിയൻ കുന്നത്തും സിതികൊയ തങ്ങളും ചെമ്പ്രശ്ശേരിയും കൊന്നാര തങ്ങളും പിടിയിലാവുകയും പിന്നീട് വെടിവെച്ചു കൊല്ലപ്പെടുകയുമായിരുന്നു.പരിക്ക് പറ്റിയ ലവക്കുട്ടി അധികം വൈകാതെ മരണം വരിച്ചു.മറ്റൊരു പ്രമുഖ പോരാളിയായിരുന്ന കുഞ്ഞലവിയാവട്ടെ വലിയോറയിലെ അക്രമത്തിൽ കൊല്ലപ്പെടുകയും ചെയ്തിരുന്നു.ഇന്ത്യൻ സ്വാതന്ത്ര്യ സമരത്തിലെ, ഒരിക്കലും മറക്കാനാവാത്ത ഏടായിരുന്നു മലബാർ സമരം.ആ അധ്യായത്തിന് അതോടെ സമാപ്തിയായെന്ന് പറയാം.`,
      },
    ],
  },
  {
    name: " പാണക്കാട് പൂക്കോയ തങ്ങൾ",
    born: "Year-Month-Day",
    death: "1395/06/26",
    description:
      "അവിസ്മരണിയമാണി നാമം. ഒരവർണ്ണനിയ വ്യക്തിത്വം, ആത്മീയ ഗുരു, മതനേതാവ്, സമുദായ പരിഷ്‌കർത്താവ്, വിദ്യാഭ്യാസ പ്രചാരകൻ, അനാഥ സംരക്ഷകൻ, ആതുരശുശ്രൂഷകൻ, നിതിന്യായപാലകൻ സർവ്വോപരി സൽഗുണസമ്പന്നരം, സുസമ്മതമായ രാഷ്ട്രീയ നേതാവ് എന്നീ നിലകളിലെല്ലാം പ്രശസ്തവം.",
    articles: [
      {
        title: " ജീവിതം",
        content: `പ്രഗത്ഭവുമായിരുന്നു ആ ബഹുമുഖ വ്യക്തിത്വം. അന്ത്യപ്രവാചകനായ സുൽ കരീം (സ)യുടെ 36-ാമത്തെ സന്താനമാണ് മർഹും തങ്ങൾ പാണക്കാട് സയ്യിദ് വംശപരമ്പരയിലെ മലബാറിൽ കുടിയേറിപ്പാർത്ത ആദ്യത്തെ കണ്ണി 18-ാം നൂറ്റാണ്ടിൽ അറേബ്യയിലെ ഹളർമൗത്തിൽ നിന്നാണ് കേരളത്തിൽ വന്നത്. പതിനെട്ടാം നൂറ്റാണ്ടിൽ സയ്യിദലി ശിഹാബുദ്ദീൻ തങ്ങൾ വളപട്ടണത്തു വന്നു താമസമാക്കി. അദ്ദേഹത്തിന്റെ പുത്രൻ സയ്യിദ് ഹുസൈൻ തങ്ങൾ കണ്ണൂർ അറക്കൽ വീട്ടിൽ നിന്ന് വിവാഹം ചെയ്ത് കുടുംബസമേതം കോഴിക്കോട്ട് താമസമാക്കി. പൂക്കോയ തങ്ങളുടെ പിതാമഹനായ സയ്യിദ് ഹുസൈൻ തങ്ങൾ അത്തെ പണ്ഡിതന്മാരിൽ പ്രമുഖനും മഹാരമായിരുന്നു. സാമൂഹ്യ സാംസ്‌കാരിക രംഗത്ത് മായാത്ത വ്യക്തിമുദ്ര പതിപ്പിച്ച അദ്ദേഹം ഇന്ത്യൻ സ്വാതന്ത്ര്യസമരത്തിന് മുസ്‌ലിങ്ങൾക്കകമാനം ആവേശവും, പ്രചോദനവും നൽകി എന്ന കാരണത്താൽ ബ്രിട്ടീഷ് ഗവൺമെന്റ് അദ്ദേഹത്തെ തടങ്കലിൽ വെക്കാനുത്തരവിട്ടു.
      ഹിജ്റ 1302-ൽ നിര്യാതനായ അദ്ദേഹം വെല്ലൂർ ബാഖിയാത്തുസ്സാലിഹാത്തിനു സമീപം അന്ത്യവിശ്രമം കൊള്ളുന്നു.ഈ സ്വാതന്ത്ര്യസമര സേനാനിയുടെ പുത്രൻ സെയ്തു മുഹമ്മദ് കോയത്തിതങ്ങളുടെ പുത്രനാണ് പാണക്കാട് തങ്ങൾ എന്ന പേരിൽ വിഖ്യാതനായ പുതിയ മാളിയേക്കൽ സയ്യിദ് അഹമ്മദ് പൂക്കോയ തങ്ങൾ അഥവാ പി.എം.എസ്.എ.പൂക്കോയ തങ്ങൾ.എല്ലാ അർത്ഥത്തിലും ഒരാത്മീയ നേതാവായിരുന്നു മർഹും തങ്ങൾ. 80 ഓളം പള്ളികളിലെ മേൽ ഖാളിയായിരുന്നു അദ്ദേഹത്തിന്റെ ആശീർവ്വാദങ്ങളോടെ കേരളമൊട്ടുക്കും പണിതീർത്ത പള്ളികളുടേയും, മദ്റസകളുടേയും എണ്ണത്തിന് കയ്യും കണക്കുമില്ല.അദ്ദേഹത്തിൽ നിന്നും 'തബർറുക്ക്' സ്വീകരിച്ചാരംഭിച്ച സ്ഥാപനങ്ങളുടെ എണ്ണവും തിട്ടമായി പറയാൻ ആർക്കും കഴിയില്ല.ഇതര മതസ്ഥരിലും അദ്ദേഹത്തിന്റെ ആത്മിയത ആദരിക്കുന്ന ആയിരക്കണക്കിനാളുകളുണ്ട്.അഹ്ലുസ്സുന്നത്തി വൽജമാത്തിൻ്റെ ആദർശങ്ങളിലാണ് തങ്ങൾ നിലകൊണ്ടിരുന്നതെങ്കിലും മുസ്ലിംങ്ങളിലെ സകല വിഭാഗവും പാണക്കാട് തങ്ങളെ ആത്മീയ നേതാവായിത്തന്നെ ആദരിച്ചുപോന്നു.നാലുപതിറ്റാണ്ട് കേരളത്തിലെ മത- രാഷ്ട്രീയ - വിദ്യാഭ്യാസ - സാംസ്‌കാരിക രംഗങ്ങളിൽ നിർണ്ണായകവും, നിസ്തൂലവുമായ സേവനമനുഷ്ഠിച്ച മഹാനായിരുന്നു പാണക്കാട് പൂക്കോയ തങ്ങൾ. 1959 ജനുവരി 29, 30 തീയ്യതികളിൽ വടകരയിൽ ചേർന്ന വിദ്യാഭ്യാസ ബോർഡിന്റെ സമ്മേളനോത്ഘാടകൾ തങ്ങളായിരുന്നു. 24 /02 / 1973 നു ചേർന്ന സമസ്ത മുശാവറ അദ്ദേഹത്തെ മുശാവറ അംഗമായി തിരഞ്ഞെടുത്തു.സമസ്തയുടെ കക്കാട്, തിരുനാവായ സമ്മേളനങ്ങളുടെ സ്വാഗതസംഘം അദ്ധ്യക്ഷൻ, സമസ്തയുടെ കീഴിൽ സ്ഥാപിതമായ പ്രഥമ സാദാന കോളേജ് ജാമിഅഃ നൂരിയ്യഃ അറബിക് കോളേജ് കമ്മിറ്റി വൈസ് പ്രസിഡണ്ട്, ജനറൽ സെക്രട്ടറി, 1968 മുതൽ എസ്.വൈ.എസ്.സ്റ്റേറ്റ് പ്രസിഡണ്ട്, പൊന്നാനി മഊനത്തുൽ ഇസ്‌ലാം സഭയുടെ പ്രസിഡണ്ട്.മുസ്ല‌ിം ലീഗ് സ്റ്റേറ്റ് പ്രസിഡണ്ട് എന്നീ നിലകളിൽ സമസ്ത വേദികളിൽ വെട്ടിത്തിളങ്ങിയ വ്യക്തിത്വമായിരുന്നു തങ്ങൾ.പരശ്ശതം പള്ളി മദ്റസകളുടേയും, അനാഥശാല, അറബിക് കോളേജുകളുടേയും പ്രസിഡണ്ട്, സെക്രട്ടറി സ്ഥാനങ്ങൾ അവിടുന്ന് വഹിച്ചിരുന്നു.അദ്ദേഹത്തിന്റെ ആസ്ഥാനമായ പാണക്കാട്ടെ കൊടപ്പനക്കൽ വീട് ഒരിക്കലെങ്കിലും ആളൊഴിഞ്ഞ സന്ദർഭമുണ്ടായിട്ടില്ല.ഏവരുടേയും ഒരഭയ കേന്ദ്രമായിരുന്നു ആ ഭവനം.കാലത്തു മുതൽ രാത്രിയുടെ അന്ത്യയാമങ്ങൾ വരെ അവിടെ സന്ദർശകരുടെ തിരക്കായിരിക്കും.പല പ്രശ്‌നങ്ങൾക്കും പരിഹാരം തേടുന്നതിനും, ഉപദേശങ്ങളും, നിർദ്ദേശങ്ങളും ലക്ഷിക്കുന്നതിനും നാനാഭാഗങ്ങളിൽ നിന്നും ജനങ്ങൾ പാണക്കാട്ടെത്തും.പിടിവാശിക്കാരനും, കലഹപ്രിയരും മാത്രമല്ല; രോഗികളും നേതാക്കളും തങ്ങളുടം നിർദ്ദേശങ്ങൾക്കും അഭിപ്രായങ്ങൾക്കും വലിയ സ്ഥാനമാണ് നൽകിയിരുന്നത്.
      ദിനംപ്രതി എത്തുന്ന നൂറുകണക്കിന് സന്ദർശകരുടെ സങ്കീർണ്ണമായ പ്രശ്‌നങ്ങൾ കൈകാര്യം ചെയ്യുന്നതിന് സർവ്വശക്തനായ അള്ളാഹു അദ്ദേഹത്തിന് പ്രത്യേക കഴിവു തന്നെ നൽകിയിരുന്നു.വിവാദപരമായ പല കേസുകൾക്കും തങ്ങൾ വിധി പ്രഖ്യാപിച്ചു നടപ്പാക്കിയിട്ടുണ്ട്.കോടതികൾക്ക് പരിഹാരം കാണാൻ കഴിയാത്ത കുടിപ്പകയും, വിവാഹപ്രശ്നങ്ങളും മാന്യമായ രീതിയിൽ തങ്ങളുടെ സാന്നിധ്യത്തിൽ ഒത്തുതീർന്ന നൂറുകണക്കിനു ഉദാഹരണങ്ങളുണ്ട്.വിവിധ കോടതികളിൽ നടക്കുന്ന കേസുകൾ ചാണക്കാട്ടു നിന്നും കക്ഷികൾ തമ്മിൽ യോജിപ്പിലായാൽ വിവരം കോടതിയെ അറിയിച്ച കേസ് പിൻവലിച്ച സംഭവങ്ങൾ നിരവധിയുണ്ട്.മാനസികവും മറ്റുമായ രോഗമുള്ളവരുമായി നിത്യേന തങ്ങളുടെ ചികിത്സയ്ക്കായി പാണക്കാട്ടെത്തുന്നവരിൽ സ്ത്രീകളും, കുട്ടികളും, വൃദ്ധന്മാരും തുടങ്ങി ജീവിതത്തിന്റെ വിവിധ തുറകളിലുള്ള നാനാജാതി മതസ്ഥരും ഉൾപ്പെടുന്നു.ദീനീ സ്ഥാപനങ്ങളായാലും, വ്യാപാര - വ്യവസായ സ്ഥാപനങ്ങളായാലും, വിവാഹ നിശ്ചയമായാലും, ഗൃഹപ്രവേശനമായാലും തങ്ങളോട് അന്വേഷിച്ചു ചെയ്യുക എന്നത് മുസ്‌ലിംകളുടെ മാത്രമല്ല.ഇതര സമുദായങ്ങളുടെ ശീലമായിരുന്നു.ആ തിരുസന്നിധിയിൽ വെച്ച് കീരിയും പാമ്പും പോലെ വന്നു ശത്രുക്കൾ എല്ലാംമറന്ന് മിത്രങ്ങളായി മാറി.കൊടുമ്പിരികൊള്ളുന്ന മാനസിക രോഗികൾ ശാന്തചിത്തരായി മാറും.തർക്കങ്ങൾ ഒത്തുതീരുന്നു.നിഷ്‌കളങ്കമായ സ്നോഹം, നിസ്വാർത്ഥമായ സേവനതൽപ്പരത, നിർമ്മലമായ സ്വഭാവ വൈശിഷ്ട്യം, അചഞ്ചലമായ വിശ്വാസദാർഢ്യം, അടിപതറാത്ത ആദർശ സ്ഥിരത തുടങ്ങിയ ഗുണങ്ങളുടെ വിളനിലമായിരുന്നു ആ ന്യായാധിപന്റെ നിഷ്പക്ഷമായ മദ്ധ്യസ്ഥ നിർദ്ദേശങ്ങൾ അംഗികരിക്കാത്തവരോ, സ്വീകരിക്കാത്തവരോ ഉണ്ടായിരുന്നില്ല. 1966 - ൽ സമസ്തക്കെതിരെ അഖില കേരള ജംഇയ്യത്തുൽ ഉലമാ രൂപീകൃതമായപ്പോൾ അതിൻ്റെ ആവശ്യകത നിരാകരിച്ചു കൊണ്ട് തങ്ങൾ പറഞ്ഞു 'ഇവിടെ സമസ്ത മതി. അഖിലയും, കൊഖിലയും വേണ്ട.' 03 /04 / 1966 ന് കോഴിക്കോട് കുറ്റിച്ചിറയിൽ സമസ്തയുടെ വിശദീകരണയോഗത്തിൽ അദ്ധ്യക്ഷം വഹിച്ചുകൊണ്ടാണ് തങ്ങൾ ഇപ്രകാരം പ്രഖ്യാപിച്ചത്.അതോടെ അഖിലയുടെ അടിത്തറ തകർന്നു.അൽപ്പകാലം കൊണ്ട് അത് നാമാവശേഷമായി. 1975 ഏപ്രിൽ 27ന് തിയ്യതി ബാംഗ്ലൂർക്കു പോകുമ്പോഴാണ് തങ്ങൾക്ക് ആദ്യമായി രോഗലക്ഷണം കണ്ടത്.തുടർന്ന് കോഴിക്കോട്ടും, ബോംബൈയിലും, അദ്ദേഹത്തിന് ആധുനിക രീതിയിലുള്ള ചികിത്സ നൽകിയെങ്കിലും അപ്പോഴേക്കും തൻ്റെ ജനസേവനം നിർത്തി തിരിച്ചുപോകേണ്ട സമയമായിക്കഴിഞ്ഞിരുന്നു.സമകാലിന ചരിത്രത്തിൽ പൂക്കോയ തങ്ങളുടെ സാന്നിധ്യം മുസ്ലിം സമൂഹത്തിന് അല്ലാഹു നൽകിയ പ്രത്യേക അനുഗ്രഹമായിരുന്നു.`,
      },
      {
        title: " മരണം",
        content:
          " മുഴുസമയം ദിനി സേവകനായിരുന്ന മഹാനുഭാവൻ 1975 ജൂലൈ 6 ന് (ജമാദുൽ ഉഖ്‌റാ 26) വഫാത്തായി. പാണക്കാട് ജുമാമസ്ജിദിനു സമിപം അന്ത്യവിശ്രമം കൊള്ളുന്നു.",
      },
    ],
  },
  {
    name: " ഉമറലി ശിഹാബ് തങ്ങൾ",
    born: "Year-Month-Day",
    death: "1430/07/01",
    description: `ഭൂമിയിൽ ഇസ്‌ലാം മത പ്രബോധനം പൂർത്തീകരി, ഖു‍ർആൻ എന്ന ദിവ്യാദ്ഭുത ഗ്രന്ഥം ലോകത്തിന്‌ എത്തിച്ചു നൽകിയ പ്രവാചകൻ മുഹമ്മദ്‌ നബിയുടെ വംശ പരമ്പരയിലെ കണ്ണിയായ പാണക്കാട്‌ കുടുംബത്തിൽ നിന്ന് മുഹമ്മദ് നബിയുടെ സന്താന പരമ്പരയിൽ നാൽപതാം തലമുറയാണ്‌ ഉമറലി ശിഹാബ്‌ തങ്ങളും സഹോദരൻമാരും. മുഹമ്മദ്‌ നബിയുടെ മകൾ ഫാത്തിമയുടെ മകൻ ഇമാം ഹുസൈനിലൂടെയാണ്‌ പ്രവാചകന്റെ കുടുംബപരമ്പര ആരംഭിക്കുന്നത്‌. മുഹമ്മദ്‌ നബി മുതൽ ഉമറലി ശിഹാബ്‌ തങ്ങൾ വരെയുള്ള വംശാവലി ഇങ്ങനെ:
        1) മുഹമ്മദ്‌ നബി
        2) ഫാത്തിമ
        3) ഇമാം ഹുസൈൻ
        4) സയ്യിദ്‌ സൈനുൽ ആബിദീൻ അലി
        5) സയ്യിദ്‌ മുഹമ്മദുൽ ബാഖിർ
        6) സയ്യിദ്‌ ജഅഫർ സാദിഖ്‌
        7) സയ്യിദ്‌ അലിയ്യുൽ ഉറൈളി
        8) സയ്യിദ്‌ മുഹമ്മദ്‌
        9) സയ്യിദ്‌ ഈസന്നഖീബ്‌
        10) സയ്യിദ്‌ അഹമ്മദുൽ മുഹാജിർ
        11) അൽ ആരിഫു ബില്ലാഹി അലവി
        12) സയ്യിദ്‌ മുഹമ്മദ്‌
        13) അൽ ആരിഫു ബില്ലാഹി അസ്സയ്യിദ്‌ അലവി
        14) അസ്സയ്യിദ്‌ അലിഖാലി അഖ്സം
        15) അൽ ആരിഫു ബില്ലാഹി സാഹിബുൽ മിർബാത്ത്‌
        16) സയ്യിദുൽവലിയ്യു അലി
        17) അസ്സയ്യിദുൽ മുഹമ്മദുൽ ഫ്ഖീഹുൽ മുഖദ്ദം
        18) സയ്യിദ്‌ അലവി
        19) സയ്യിദ്‌ അലി
        20) സയ്യിദ്‌ മുഹമ്മദ്‌ മൌലദ്ദവീല
        21) സയ്യിദ്‌ അബ്ദുറഹിമാൻ സഖാഫ്‌
        22) സയ്യിദ്‌ അബൂബക്കറിസ്സഖ്‌റാൻ
        23) സയ്യിദ്‌ ഷെയ്ഖ്‌ അലി
        24) സയ്യിദ്‌ അബ്ദുറഹിമാൻ
        25) സയ്യിദ്‌ അഹമ്മദ്‌
        26) സയ്യിദ്‌ ശിഹാബുദ്ദീൻ അഹമ്മദ്‌
        27) സയ്യിദ്‌ ഉമർ
        28) സയ്യിദ്‌ ശിഹാബൂദ്ദീൻ
        29) സയ്യിദ്‌ ഉമർ മെഹബൂബ്‌
        30) സയ്യിദ്‌ അലി ശിഹാബുദ്ദീൻ
        31) സയ്യിദ്‌ മുഹമ്മദ്‌
        32) സയ്യിദ്‌ അലി
        33) സയ്യിദ്‌ അഹമ്മദ്‌
        34) സയ്യിദ്‌ അലി ശിഹാബുദ്ദീൻ
        35) സയ്യിദ്‌ ഹുസൈൻ
        36) സയ്യിദ്‌ മുഹളാർ
        37) സയ്യിദ്‌ ഹുസൈൻ ആറ്റക്കോയ തങ്ങൾ
        38) സയ്യിദ്‌ മുഹമ്മദ്‌ കുഞ്ഞിക്കോയ തങ്ങൾ
        39) സയ്യിദ്‌ അഹമ്മദ്‌ പൂക്കോയ തങ്ങൾ(പി.എം.എസ്‌.എ.പൂക്കോയ തങ്ങൾ)
        40) സയ്യിദ്‌ ഉമറലി ശിഹാബ്‌ തങ്ങളും സഹോദരൻമാരും.`,
    articles: [
      {
        title: " ജീവിതം",
        content: ` മുസ്ലിം കൈരളിയുടെ സാന്ത്വനത്തിന്റെ പൂമരത്തണൽ പാണക്കാട് കൊടപ്പനക്കൽ തറവാട്ടിലെ ബഹുവന്ദ്യരായ പുതിയ മാളിയേക്കൽ സയ്യിദ് അഹ്മദ് (പി.എം.എസ്.എ) പൂക്കോയ തങ്ങളുടെയും  സയ്യിദ് ഹാമിദ് കുഞ്ഞി സീതിക്കോയ തങ്ങളുടെ മകളായ സയ്യിദ ആഇശ ചെറുകുഞ്ഞി ബീവിയുടെയും രണ്ടാത്തെ മകനായി 1941 നവംബർ 28 ഹി. 1360 ദുൽഖഅദഃ 8 വെള്ളിയാഴ്ച രാവിലെ ഒൻപത് മണിക്ക്  ജനിച്ചു.
      സയ്യിദ് അഥവാ തങ്ങന്മാർ എന്നറിയപ്പെടുന്ന നബികുടുംബ പരമ്പരയിലെ അനേകം മഹദ് വ്യക്തിത്വങ്ങൾ കേരളത്തിലെ മുസ്‌ലിം സാമുദായിക ജീവിതത്തെയും കേരളീയ പൊതുമണ്ഡലത്തെയും സാംസ്‌കാരിക- വൈജ്ഞാനിക മേഖലകളെയുമൊക്കെ ആഴത്തിൽ സ്വാധീനിച്ചത് ആ അധ്യായത്തിലെ കനമുള്ള ഏടുകളാണ്.മുസ്‌ലിംസമുദായത്തെ മുഖ്യധാരയിലേക്ക് ആനയിച്ചതും പോരാട്ടവീര്യം പ്രദാനം ചെയ്തതും സമന്വയത്തിന്റെയും സമവായത്തിന്റെയും സഹിഷ്ണുതയുടെയും പാഠങ്ങൾ പഠിപ്പിച്ചതും ഇവരായിരുന്നു.ഇസ്‌ലാം മതപ്രബോധന പ്രവർത്തനങ്ങളെ ത്വരിതപ്പെടുത്തിയ മതനേതാക്കളും സാമൂഹിക രംഗങ്ങളെ കർമോന്മുഖമാക്കിയ രാഷ്ട്രീയ നായകന്മാരും പോർച്ചുഗീസ്, ബ്രിട്ടീഷ് വൈതാളികന്മാർക്കെതിരെ പോരാടിയ സമരനായകന്മാരും വിജ്ഞാനത്തിന്റെയും സംസ്‌കാരത്തിന്റെയും തുറകളെ ജ്വലിപ്പിച്ച ഗ്രന്ഥകാരന്മാരും കവികളും മറ്റും അവരിലുണ്ടായിരുന്നു.
      പാരമ്പര്യവും കടപ്പാടും നിലനിർത്തുന്നതാണ്‌ പാണക്കാട്‌ തങ്ങൻമാരുടെ പേരുകൾ.പി.എം.എസ്‌.എ.പൂക്കോയ തങ്ങളെ പിതൃസഹോദരൻ അലി പൂക്കോയ തങ്ങളാണ്‌ വളർത്തിയത്‌.മക്കളില്ലാതിരുന്ന അലി പൂക്കോയ തങ്ങൾ, പൂക്കോയ തങ്ങൾക്ക്‌ പാണക്കാട്‌ കൊടപ്പനക്കൽ തറവാടു വീടും നൽകി.തന്നെ സ്വന്തം മകനെപ്പോലെ വളർത്തിയ അലീ പൂക്കോയ തങ്ങളുടെ സ്മരണ നിലനിർത്താൻ പി.എം.എസ്‌.എ.തങ്ങൾ മക്കളുടെയെല്ലാം പേരിനൊപ്പം അലി ചേർത്തു.ശിഹാബ്‌ എന്നത്‌ കുടുംബപ്പേരാണ്‌.പ്രവാചകൻ മുഹമ്മദ്‌ നബിയുടെ സന്താന പരമ്പരയ്ക്ക്‌ കേരള സമൂഹം ആദരിച്ചു നൽകുന്ന സ്ഥാനമാണ്‌ തങ്ങൾ എന്നത്‌.തങ്ങൻമാർ പലരുടെയും ഔദ്യോഗിക പേരിനൊപ്പം തങ്ങൾ എന്നത്‌ ഉണ്ടാകാറില്ല.
      ഉറവ വറ്റാത്ത സ്നേഹവും നിലയ്ക്കാത്ത ശാന്തിമന്ത്രവും തെറ്റാത്ത നീതിശാസ്‌ത്രവുമായിരുന്നു ഉമറലി ശിഹാബ് തങ്ങളുടെ  മുഖമുദ്രകൾ.അതുകൊണ്ടാണ്‌ അഷ്ടദിക്കിൽനിന്നും ആളുകൾ പാണക്കാട്‌ കൊടപ്പനക്കലിലെ ആ സാനിധ്യം തേടി തറവാട്ടിലെത്തിയിരുന്നത്.
      അനേകകാലം പരസ്പരം പോരാടി വസ്‌തുതർക്കങ്ങളും കേസുകളുമെല്ലാം ഉമറലി ശിഹാബ്‌ തങ്ങളുടെ മധ്യസ്ഥതയിൽ, അദ്ദേഹത്തിന്റെ വിധിയിൽ തീർപ്പാകുന്നത്‌ പതിവായിരുന്നു.രോഗശാന്തിയും മനഃശാന്തിയും തേടി നിരവധി പേർ തങ്ങൾക്കരികിലെത്തിയിരുന്നു.തങ്ങളുടെ സാമീപ്യവും പ്രാർഥനയും അനുഗ്രഹവുമായിരുന്നു അവർക്കുള്ള മരുന്നുകൾ.
      പാണക്കാട് ദേവധാർ എൽ.പി സ്‌കൂളിൽ പ്രാഥമിക പഠനം പൂർത്തിയാക്കിയ ഉമറലി ശിഹാബ് തങ്ങൾ കോഴിക്കോട് എം.എം ഹൈസ്‌കൂളിൽ വെച്ച് 1959 ൽ എസ്.എസ്.എൽ.സി പഠനം പൂർത്തിയാക്കി.തുടർന്ന് കാനഞ്ചേരി, അച്ചിപ്പുറം, ഒറവംപുറം എന്നിവടങ്ങളിൽ അഞ്ച് വർഷത്തെ ദർസ് പഠനം പൂർത്തിയാക്കി.പിന്നീട് 1964 ൽ പട്ടിക്കാട് ജാമിഅഃ നൂരിയ്യഃ അറബിക്കോളേജിൽ ചേരുകയും 1968 ൽ മൗലവി ഫാസിൽ ഫൈസി ബിരുദം കരസ്ഥമാക്കി.പിതാവ് പി.എം.എസ്.എ പൂക്കോയ തങ്ങളുടെ കയ്യിൽ നിന്നായിരുന്ന സനദ് ഏറ്റുവാങ്ങിയത്.
      പൊന്മള പുവാടൻ മൊയ്തീൻ മുസ്‌ലിയാർ, ശംസുൽ ഇ.കെ അബൂബക്കർ മുസ്‌ലിയാർ, കോട്ടുമല ടി.അബൂബക്കർ മുസ്‌ലിയാർ, കെ.സി ജമാലുദ്ധീൻ മുസ്‌ലിയാർ, താഴെക്കോട് കുഞ്ഞലവി മുസ്‌ലിയാർ എന്നിവർ പ്രധാന ഗുരുനാഥന്മാരാണ്.
      1968 ഏപ്രിൽ 28 ന് സയ്യിദ് ശിഹാബുദ്ധീൻ ഇമ്പിച്ചിക്കോയ തങ്ങളുടെ പുത്രി സയ്യിദ ഖദീജ മുല്ല ബീവിയുമായിട്ടായിരുന്നു ഉമറലി തങ്ങളുടെ വിവാഹം.
      സമസ്ത വൈസ് പ്രസിഡണ്ട്, സുന്നി യുവജന സംഘം സംസ്ഥാന പ്രസിഡണ്ട്, കേരള വഖ്ഫ് ബോർഡ് ചെയർമാൻ, വയനാടി ജില്ലാ ഖാസി, ജംഇയ്യത്തുൽ ഖുളാത്തി വൽ മഹല്ലാത്ത് ചെയർമാൻ, അലീഗഡ് മുസ്‌ലിം യൂണിവേഴ്‌സിറ്റി കോർട്ട് അംഗം, സെൻട്രൽ വഖ്ഫ് കൗൺസിൽ മെമ്പർ, കേന്ദ്ര ഹജ്ജ് കമ്മിറ്റി അംഗം, കേരളാ ഹജ്ജ് കമ്മിറ്റി എക്‌സ് ഒഫീഷ്യോ അംഗം, സുന്നി അഫ്കാർ വാരിക മാനേജിംഗ് ഡയറക്ടർ, 1970 മുതൽ പാണക്കാട് മഅ്ദനുൽ ഉലൂം ജനറൽ സെക്രട്ടറി, പാണക്കാട് വാർഡ് മുസ്‌ലിം ലീഗ് പ്രസിഡണ്ട്, പാണക്കാട് ദാറുൽ ഉലൂം ഹൈസകൂൾ മാനേജർ, 2006 ൽ മുസ്‌ലിം ലീഗിന്റെ പാർലമെന്റെറി ബോർഡ് ചെയർമാൻ എന്നീ സ്ഥാനങ്ങൾ വഹിച്ച സയ്യിദ് ഉമറലി ശിഹാബ് തങ്ങൾ ദാറുൽ ഹുദാ ഇസ്‌ലാമിക് അക്കാദമി പ്രസിഡണ്ട്, പട്ടിക്കാട് ജാമിഅഃ നൂരിയ്യഃ മാനേജിംഗ് കമ്മിറ്റി അംഗം, താനൂർ ഇസ്‌ലാഹുൽ ഉലൂം അറബിക് കോളേജ്, കുണ്ടൂർ മർക്കസുസ്സഖാഫതുൽ ഇസ്‌ലാമിയ്യഃ, പൂക്കോട്ടൂർ ഖിലാഫത്ത് മെമ്മോറിയൽ യതീം ഖാനഃ, ആക്കോട് ഇസ്‌ലാമിക് സെന്റർ, വയനാട് വെങ്ങപ്പള്ളി ശംസുൽ ഉലമ അക്കാദമി, എളേറ്റിൽ വാദി ഹുസ്‌ന, കൊടിഞ്ഞി സുന്നി എഡ്യുക്കേഷണൽ സെന്റർ, ഒളവട്ടൂർ യതീംഖാന, മുണ്ടുപറമ്പ് യതീംഖാന, മൈത്ര യതീംഖാന, വട്ടത്തൂർ യതീംഖാന, മേൽമുറി എം.ടി.സി ബി.എഡ് കോളേജ് തുടങ്ങിയ സ്ഥാപനങ്ങളിൽ സാരഥ്യമരുളി.
                സമസ്ത, വഖ്ഫ് ബോർഡ്, എസ്.വൈ.എസ് തുടങ്ങിയ കർമ്മ വഴികളിൽ തങ്ങൾ കാഴ്ചവെച്ച സ്തുത്യർഹമായ പ്രവർത്തനങ്ങൾ നിരവധിയാണ്.
      സ്വന്തമായ ജീവിത നിഷ്ഠകളും കർമ്മ രീതികൾ കൊണ്ടും വേറിട്ടു നിന്ന മഹാനുഭാവനായിരുന്നു ഉമറലി ശിഹാബ് തങ്ങൾ.വ്യത്യസ്തമായ കർമ്മ മേഖലകളിൽ മുഴുകുമ്പോഴും അധികാരങ്ങളും നേതൃത്വവും ആലങ്കാരികതക്കപ്പുറം ഉത്തരവാദിത്തമാണെന്ന ഉത്തമ ബോധ്യത്തോടെ പ്രവർത്തിച്ച നായകൻ കൂടിയായിരുന്നു ഉമറലി തങ്ങൾ.അചഞ്ചലമായ തീരുമാനങ്ങളും സ്വീകാര്യമായ പരിഹാരങ്ങളും തങ്ങളുടെ രീതിയായിരുന്നു.`,
      },
      {
        title: " മരണം",
        content:
          " നാടും കുടുംബവുമായി അഗാധമായ ബന്ധം സ്ഥാപിച്ചിരുന്ന ഉമറലി ശിഹാബ് തങ്ങളുടെ ജീവിതവും പെരുമാറ്റവും എന്നന്നേക്കും എല്ലാവർക്കും ഒരു മാതൃക കൂടിയാണ്. പുറത്തെ ഗൗരവത്തിനപ്പുറം അകത്ത് വലിയൊരു സ്‌നേഹ സാഗരം സൂക്ഷിച്ചിരുന്ന ബഹുവന്ദ്യരായ ഉമറലി ശിഹാബ് തങ്ങൾ 2008 ജൂലൈ 3 റജബ് മാസം ഒന്നിന് വ്യാഴാഴ്ച രാത്രി 10.10 ന് നമ്മോട് വിട പറഞ്ഞു.",
      },
    ],
  },
  {
    name: " നാട്ടിക വി. മൂസ മുസ്‌ലിയാർ",
    born: "Year-Month-Day",
    death: "1422/07/17",
    description:
      " ജീവിതവും മരണവും സമസ്തക്ക് വേണ്ടി മാറ്റിവെച്ച നേതാവും പ്രഭാഷകനും എഴുത്തുകാരനുമായിരുന്നു നാട്ടിക വി. മൂസ മുസ്‌ലിയാർ.",
    articles: [
      {
        title: " ജീവിതം ",
        content: ` മലപ്പുറം ജില്ലയിലെ മേലാറ്റൂർ പഞ്ചായത്തിലെ എടയാട്ടുരിൽ 1952 ഏപ്രിൽ 2ന് വെമ്പുള്ളി മുഹമ്മദ് എന്ന കുഞ്ഞാപ്പ ഹാജിയുടെയും ഖദീജ ഹജ്ജുമ്മയുടെയും മകനായിട്ടാണ് ജനനം. അറിവിൻ്റെ ബാലപാഠങ്ങൾ നാട്ടിൽ നിന്നു തന്നെ അഭ്യസിച്ച മൂസ മുസ്‌ലിയാർ ചെങ്ങര ജുമുഅത്ത് പള്ളിയിൽ നിന്നും പൊന്നാനി മഊനതുൽ ഉലൂമിൽ നിന്നും കൂടുതൽ വിജ്ഞാനം കരസ്ഥമാക്കി. നാട്ടിലെ ഔപചാരിക പഠനം കഴിഞ്ഞപ്പോൾ പുറത്തുള്ള സ്ഥാപനങ്ങളെയാണ് ഇദ്ദേഹം ലക്ഷ്യം വെച്ചത്. വെല്ലൂരിലെ ബാഖിയാതുസ്വാലിഹാതിലും ദയൂബന്ദിലെ ദാറുൽ ഉലൂമിലും പഠിച്ച മൂസ മുസ്‌ലിയാർ അഫ്‌സലുൽ ഉലമ ബിരുദവും കരസ്ഥമാക്കി. RELATED ARTICLES സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമ (1926) (3) കേരളത്തിലെ എയ്‌ഡഡ് അറബിക്കോളെജുകൾ അറബി ഭാഷാ പഠന സ്ഥാപനങ്ങൾ (11) 1952-2001 18 പഠനം കഴിഞ്ഞ് നാട്ടിൽ തിരിച്ചെത്തിയ ഇദ്ദേഹം വിവിധ സ്ഥലങ്ങളിലും സ്ഥാപനങ്ങളിലും ജോലിചെയ്തു. താൻ പഠനം നടത്തിയ പൊന്നാനി മഊനതുൽ ഇസ്‌ലാമിൽ തന്നെയാണ് ആദ്യമായി ജോലിക്ക് കയറിയത്. തുടർന്ന് ചേന്ദമംഗല്ലൂർ സുന്നിയ്യയിൽ അധ്യാപകനായും നാട്ടിക ജുമാ മസ്‌ജിദിൽ ഖാദിയായി സേവനം അനുഷ്ഠിച്ചു. ഈ സമയത്താണ് ഇദ്ദേഹത്തിന്റെ പേരിനോട് കൂടെ നാട്ടിക എന്ന് ചേർക്കാൻ തുടങ്ങിയത്. അറിവ് പകരുന്നതിനോടൊപ്പം വിദ്യാഭ്യാസ സ്ഥാപനങ്ങൾ നിർമ്മിക്കുവാനും ഇദ്ദേഹം മുന്നിൽ നിന്നു. ദേശമംഗലം എം.ഐ.സി, ജാമിഅ ഇസ്‌ലാമിയ, മഞ്ചേരി ദാറുൽ ഹികം ചെമ്മാനിയോട് എന്നീ സ്ഥാപനങ്ങൾ ഇദ്ദേഹത്തിന്റെ പരിശ്രമഫലമായിരുന്നു.`,
      },
      {
        title: " പ്രധാന കൃതികൾ",
        content:
          " തൗഹീദും ശിർക്കും സുന്നത്ത് ജമാഅത്തിനൊരു മുഖവുര മുസ്‌ലിം ലീഗ് സേവന പാതയിൽ മുസലിം ലീഗും ജമാഅത്തെ ഇസ്‌ലാമിയും മാസപ്പിറവി മുസ്‌ലിം വ്യക്തി നിയമം ഖാദിയാനിസം ശരീഅത്ത് മുജാഹിദ് പ്രയാണം, ഹ്യദയ വൈകല്യങ്ങളുടെ കലവറ.",
      },
      {
        title: " മരണം",
        content:
          " നാട്ടിക ഉസ്താദ് എന്ന പേരിലറിയപ്പെട്ടിരുന്ന ഇദ്ദേഹം തന്റെ 49-ാം വയസ്സിൽ 2001 ഒക്ടോബർ 4-ന് ഇഹലോകവാസം വെടിഞ്ഞു.",
      },
    ],
  },
  {
    name: " ആനക്കര കോയക്കുട്ടി മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1437/07/25",
    description:
      " പ്രമുഖ പണ്ഡിതനും സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമാ പ്രസിഡന്റുമായ ആനക്കര സി. കോയക്കുട്ടി മുസ്‌ലിയാര്‍ 81 വയസ്സായിരുന്നു.",
    articles: [
      {
        title: " ജീവിതം",
        content: `സമസ്തകേരള ഇസ്‌ലാം മതവിദ്യാഭ്യാസ ബോര്‍ഡ് എക്‌സിക്യൂട്ടീവ് അംഗം, സമസ്ത പരീക്ഷാബോര്‍ഡ്, ജാമിഅ നൂരിയ പരീക്ഷാബോര്‍ഡ്, സമസ്ത പാലക്കാട് ജില്ലാ പ്രസിഡന്റ്, മലപ്പുറം ജില്ലാ വൈസ് പ്രസിഡന്റ്, പൊന്നാനി താലൂക്ക് ജംഇയ്യത്തുല്‍ ഉലമാ പ്രസിഡന്റ് തുടങ്ങി നിരവധി സ്ഥാനങ്ങള്‍ വഹിച്ചിട്ടുണ്ട്. പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ, വളാഞ്ചേരി മര്‍കസുത്തര്‍ബിയത്തുല്‍ ഇസ്‌ലാമിയ്യ, വളവന്നൂര്‍ ബാഫഖി യതീംഖാന, താനൂര്‍ ഇസ്‌ലാഹുല്‍ ഉലൂം, ദാറുല്‍ ഹിദായ എടപ്പാള്‍ തുടങ്ങി നിരവധി സ്ഥാപനങ്ങളുടെ സാരഥിയും നിരവധി മഹല്ലുകളുടെ ഖാസിയുമായിരുന്നു. 1988 മുതല്‍ സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമാ മുശാവറ അംഗമായ കോയക്കുട്ടി മുസ്‌ലിയാര്‍ 2001 മുതല്‍ വൈസ് പ്രസിഡന്റായും 2012 മുതല്‍ കാളമ്പാടി മുഹമ്മദ് മുസ്‌ലിയാരുടെ കാലശേഷം പ്രസിഡന്റായും തിരഞ്ഞെടുക്കപ്പെട്ടു.1934ല്‍ ചോലയില്‍ ഹസൈനാറിന്റെയും കുന്നത്തേതില്‍ ആഇശത്ത് ഫാത്വിമയുടെയും മകനായിട്ടാണു ജനനം.
      മദ്‌റസാ പ്രസ്ഥാനം രൂപീകരിക്കുന്നതിനു യത്‌നിച്ചവരില്‍ പ്രമുഖനായിരുന്നു.ഒ.കെ.സൈനുദ്ദീന്‍കുട്ടി മുസ്‌ലിയാര്‍, കെ.പി.മുഹമ്മദ് മുസ്‌ലിയാര്‍, കഴുപുറം മുഹമ്മദ് മുസ്‌ലിയാര്‍, സി.കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, ശൈഖ് ഹസന്‍ ഹസ്രത്ത്, ആദം ഹസ്രത്ത്, കണ്ണിയത്ത് അഹ്മദ് മുസ്‌ലിയാര്‍, കെ.കെ.അബൂബക്കര്‍ ഹസ്രത്ത്, ആനക്കര സി.കുഞ്ഞിമുഹമ്മദ് മുസ്‌ലിയാര്‍, കടുപ്രം മുഹമ്മദ് മുസ്‌ലിയാര്‍, കരിങ്ങനാട് കെ.പി.മുഹമ്മദ് മുസ്‌ലിയാര്‍, സി.കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, രായിന്‍കുട്ടി മുസ്‌ലിയാര്‍ പടിഞ്ഞാറങ്ങാടി, കുഞ്ഞാനു മുസ്‌ലിയാര്‍ പട്ടാമ്പി തുടങ്ങിയവര്‍ പ്രധാന ഗുരുനാഥന്മാരാണ്.ഒതുക്കുങ്ങലില്‍ മുദരിസായി രണ്ടുവര്‍ഷം പൂര്‍ത്തിയാക്കിയ ശേഷമാണ് വെല്ലൂര്‍ ബാഖിയാത്തില്‍ ഉന്നത പഠനത്തിനായി പോകുന്നത്.ബാഖവി ആയ ശേഷം തിരൂരങ്ങാടി വലിയപള്ളി, കൊയിലാണ്ടി, വമ്പേനാട്, മൈത്ര, വാണിയന്നൂര്‍, പൊന്‍മുണ്ടം, എടക്കുളം, കൊടിഞ്ഞി, കാരത്തൂര്‍ ബദ്‌രിയ്യാ കോളജ് എന്നിവിടങ്ങളില്‍ മുദരിസായി സേവനം ചെയ്തിട്ടുണ്ട്.
                                    കെ.കെ.അബ്ദുല്ല മുസ്‌ലിയാര്‍ കരുവാരകുണ്ട്, അബ്ദുല്ല മുസ്‌ലിയാര്‍ കടമേരി, അബ്ദുല്ല മുസ്‌ലിയാര്‍ തൃക്കരിപ്പൂര്‍ തുടങ്ങിയവര്‍ പ്രധാന സഹപാഠികളാണ്.ചാപ്പനങ്ങാടി ബാപ്പു മുസ്‌ലിയാര്‍, കെ.സി.ജമാലുദ്ദീന്‍ മുസ്‌ലിയാര്‍, എം.എം.ബശീര്‍ മുസ്‌ലിയാര്‍ തുടങ്ങിയവരോടൊപ്പം സംഘടന വ്യാപിപ്പിക്കാന്‍ പ്രവര്‍ത്തിച്ചു.സൂഫീസരണയിലൂടെ മാതൃകാപരമായ ജീവിതം നയിച്ച അദ്ദേഹം ആധ്യാത്മികരംഗത്തെ നിറഞ്ഞ സാന്നിധ്യമായിരുന്നു.ചാപ്പനങ്ങാടി ബാപ്പു മുസ്‌ലിയാര്‍, കക്കടിപ്പുറം അബൂബക്കര്‍ മുസ്‌ലിയാര്‍, ശൈഖുല്‍ ഖാദിരി ഞങ്ങാടി അബൂബക്കര്‍ ഹാജി എന്നീ സൂഫിവര്യന്മാരുടെ ആത്മീയ പരമ്പരയില്‍ കണ്ണിചേര്‍ന്ന ഉസ്താദ് നിരവധി സ്ഥലങ്ങളില്‍ ആത്മീയ സദസ്സുകള്‍ക്ക് നേതൃത്വം നല്‍കി വരികയായിരുന്നു.
      കാട്ടിപരുത്തി കുഞ്ഞയിദ്രു മുസ്‌ലിയാരുടെ മകള്‍ കെ.കെ ഫാത്വിമയാണ് ഭാര്യ.മക്കള്‍: മുഹമ്മദ്‌നൂര്‍ ഫൈസി ആനക്കര(യു.എ.ഇ), അബ്ദുനാസര്‍ ഫൈസി ആനക്കര, ആബിദുല്‍ ഹകീം ഫൈസി, അബ്ദുസലാം ഫൈസി, അബ്ദുല്‍സമദ്, ഹാജറ, സഫിയ്യ.മരുമക്കള്‍: കുട്ടിരായിന്‍ ഫൈസി കാവനൂര്‍, ഉമര്‍ ഫൈസി കാവനൂര്‍, സുലൈഖ കാടഞ്ചേരി, ബുശ്‌റ കാട്ടിപരുത്തി, ഉമ്മുആഇശ കാരക്കാട്, ഫാത്വിമ കുറ്റിപ്പാല, മുബശ്ശിറത്ത് ചേകന്നൂര്‍.`,
      },
    ],
  },
  {
    name: " ഹൈദരലി ശിഹാബ് തങ്ങൾ",
    born: "Year-Month-Day",
    death: "1443/08/02",
    description:
      " യൂണിവേഴ്‌സിറ്റി വൈസ് ചാൻസലറുമായ ലേഖകൻ, ഹൈദരലി തങ്ങൾ സമസ്ത വിദ്യാർഥി സംഘടനയുടെ പ്രഥമ സംസ്ഥാന പ്രസിഡന്റായിരിക്കെ ജനറൽ സെക്രട്ടറിയായിരുന്നു.",
    articles: [
      {
        title: " ജീവിതം",
        content: `അവിസ്മരണിയമാണി നാമം. ഒരവർണ്ണനിയ വ്യക്തിത്വം, ആത്മീയ ഗുരു, മതനേതാവ്, സമുദായ പരിഷ്‌കർത്താവ്, വിദ്യാഭ്യാസ പ്രചാരകൻ, അനാഥ സംരക്ഷകൻ, ആതുരശുശ്രൂഷകൻ, നിതിന്യായപാലകൻ സർവ്വോപരി സൽഗുണസമ്പന്നരം, സുസമ്മതമായ രാഷ്ട്രീയ നേതാവ് എന്നീ നിലകളിലെല്ലാം പ്രശസ്തവം. പ്രഗത്ഭവുമായിരുന്നു ആ ബഹുമുഖ വ്യക്തിത്വം. അന്ത്യപ്രവാചകനായ സുൽ കരീം (സ)യുടെ 36-ാമത്തെ സന്താനമാണ് മർഹും തങ്ങൾ പാണക്കാട് സയ്യിദ് വംശപരമ്പരയിലെ മലബാറിൽ കുടിയേറിപ്പാർത്ത ആദ്യത്തെ കണ്ണി 18-ാം നൂറ്റാണ്ടിൽ അറേബ്യയിലെ ഹളർമൗത്തിൽ നിന്നാണ് കേരളത്തിൽ വന്നത്. പതിനെട്ടാം നൂറ്റാണ്ടിൽ സയ്യിദലി ശിഹാബുദ്ദീൻ തങ്ങൾ വളപട്ടണത്തു വന്നു താമസമാക്കി. അദ്ദേഹത്തിന്റെ പുത്രൻ സയ്യിദ് ഹുസൈൻ തങ്ങൾ കണ്ണൂർ അറക്കൽ വീട്ടിൽ നിന്ന് വിവാഹം ചെയ്ത് കുടുംബസമേതം കോഴിക്കോട്ട് താമസമാക്കി. പൂക്കോയ തങ്ങളുടെ പിതാമഹനായ സയ്യിദ് ഹുസൈൻ തങ്ങൾ അത്തെ പണ്ഡിതന്മാരിൽ പ്രമുഖനും മഹാരമായിരുന്നു. സാമൂഹ്യ സാംസ്‌കാരിക രംഗത്ത് മായാത്ത വ്യക്തിമുദ്ര പതിപ്പിച്ച അദ്ദേഹം ഇന്ത്യൻ സ്വാതന്ത്ര്യസമരത്തിന് മുസ്‌ലിങ്ങൾക്കകമാനം ആവേശവും, പ്രചോദനവും നൽകി എന്ന കാരണത്താൽ ബ്രിട്ടീഷ് ഗവൺമെന്റ് അദ്ദേഹത്തെ തടങ്കലിൽ വെക്കാനുത്തരവിട്ടു.
      ഹിജ്റ 1302-ൽ നിര്യാതനായ അദ്ദേഹം വെല്ലൂർ ബാഖിയാത്തുസ്സാലിഹാത്തിനു സമീപം അന്ത്യവിശ്രമം കൊള്ളുന്നു.ഈ സ്വാതന്ത്ര്യസമര സേനാനിയുടെ പുത്രൻ സെയ്തു മുഹമ്മദ് കോയത്തിതങ്ങളുടെ പുത്രനാണ് പാണക്കാട് തങ്ങൾ എന്ന പേരിൽ വിഖ്യാതനായ പുതിയ മാളിയേക്കൽ സയ്യിദ് അഹമ്മദ് പൂക്കോയ തങ്ങൾ അഥവാ പി.എം.എസ്.എ.പൂക്കോയ തങ്ങൾ.എല്ലാ അർത്ഥത്തിലും ഒരാത്മീയ നേതാവായിരുന്നു മർഹും തങ്ങൾ. 80 ഓളം പള്ളികളിലെ മേൽ ഖാളിയായിരുന്നു അദ്ദേഹത്തിന്റെ ആശീർവ്വാദങ്ങളോടെ കേരളമൊട്ടുക്കും പണിതീർത്ത പള്ളികളുടേയും, മദ്റസകളുടേയും എണ്ണത്തിന് കയ്യും കണക്കുമില്ല.അദ്ദേഹത്തിൽ നിന്നും 'തബർറുക്ക്' സ്വീകരിച്ചാരംഭിച്ച സ്ഥാപനങ്ങളുടെ എണ്ണവും തിട്ടമായി പറയാൻ ആർക്കും കഴിയില്ല.ഇതര മതസ്ഥരിലും അദ്ദേഹത്തിന്റെ ആത്മിയത ആദരിക്കുന്ന ആയിരക്കണക്കിനാളുകളുണ്ട്.അഹ്ലുസ്സുന്നത്തി വൽജമാത്തിൻ്റെ ആദർശങ്ങളിലാണ് തങ്ങൾ നിലകൊണ്ടിരുന്നതെങ്കിലും മുസ്ലിംങ്ങളിലെ സകല വിഭാഗവും പാണക്കാട് തങ്ങളെ ആത്മീയ നേതാവായിത്തന്നെ ആദരിച്ചുപോന്നു.നാലുപതിറ്റാണ്ട് കേരളത്തിലെ മത- രാഷ്ട്രീയ - വിദ്യാഭ്യാസ - സാംസ്‌കാരിക രംഗങ്ങളിൽ നിർണ്ണായകവും, നിസ്തൂലവുമായ സേവനമനുഷ്ഠിച്ച മഹാനായിരുന്നു പാണക്കാട് പൂക്കോയ തങ്ങൾ.ഇ.കെ അബൂബകർ മുസ്ലിയാർ, ഇ.കെ ഹസൻ മുസ്ലിയാർ, വാണിയമ്പലം അബ്‌ദുർറഹ്‌മാൻ മുസ്ലിയാർ, കെ.വി മുഹമ്മദ് മുസ്ലിയാർ കുറ്റനാട്, കോട്ടുമല അബൂബകർ മുസ്ലിയാർ തുടങ്ങിയ നേതാക്കളുമായി സംഘടനാ സാരഥികൾ എന്ന നിലയ്ക്ക് ആത്മബന്ധമുണ്ടാക്കാനും ഉപദേശ നിർദേശങ്ങൾ തേടാനും ഇരുവർക്കും അവസരമുണ്ടായി.ജാമിഅ ക്യംപസ് മാഗസിൻ അൽമുനീറിന്റെ പത്രാധിപരായി പ്രവർത്തിക്കാനും അക്കാലത്തു സാധിച്ചു.സമസ്‌തയുടെ വിദ്യാർത്ഥി സംഘടന വിപുലപ്പെടുത്താനും ജില്ല, താലൂക്ക് തലങ്ങളിൽ കമ്മിറ്റികൾ രൂപീകരിക്കാനും സംസ്ഥാനത്തുടനീളം ഞങ്ങൾ യാത്രകൾ നടത്തി.സമസ്തയുടെയും അനുബന്ധ സംഘടനകളുടെയും ജില്ല, സംസ്ഥാന ഭാരവാഹികളായി ഒന്നിച്ചു പ്രവർത്തിച്ചു.
      പാണ്ഡിത്യവും നേത്യഗുണവും ഒരേ അളവിൽ മേളിച്ചതിനാൽ മത - രാഷ്ട്രീയ രംഗത്തെ അവസാന വാക്കായി നിലക്കൊള്ളാൻ അദ്ദേഹത്തിനായി.രാഷ്ട്രീയ രംഗങ്ങളിലേതു പോലെ മത വിഷയങ്ങളിലും അദ്ദേഹം സജീവമായി ഇടപെട്ടു.സൗമ്യപ്രകൃതമാണെങ്കിലും സമുദായ - രാഷ്ട്രീയ വിഷയങ്ങളിൽ നിർണായക ഇടപെടലുകൾ നടത്തുമ്പോൾ അതീവ ജാഗ്രതയും കണിശതയും പുലർത്തി.മത സംഘടനയെയും രാഷ്ട്രീയ പാർട്ടിയെയും സക്രിയമായി മുന്നോട്ടുനയിച്ചു.ഏറ്റവും വലിയ മുസ്ലിം രാഷ്ട്രീയ സംഘടനയെയും മത സംഘടനയും ഒരുമിച്ചു ചലിപ്പിക്കുക.എന്ന ശ്രമകരമായ ദൗത്യം അദ്ദേഹം നിഷ്‌കളങ്കമായി നിർവഹിച്ചു.കേരളീയ പരിസരം സാമുദായിക ധ്രുവീകരണത്തിനു വേദിയാകരുതെന്ന നിർബന്ധം തങ്ങൾക്കുണ്ടായിരുന്നു.മതസൗഹാർദ്ദം കാത്തുസൂക്ഷിക്കുന്നതിനും രാഷ്ട്രീയ മത സംഘടനകൾ തമ്മിലുള്ള വാക്പോരുകളുടെ തീവ്രത കുറക്കാനും അദ്ദേഹം ആവതു ശ്രമിച്ചു.മഹല്ല് സംവിധാനം ശാക്തീകരിക്കുന്നതിനും മെച്ചപ്പെട്ട മത - ധാർമിക അന്തരീക്ഷം നിലനിർത്തുന്നതിനും നിർണായക ഇടപെടലുകൾ നടത്തി.മുസ്ലിം ആരാധനായലങ്ങളിലെ ഉച്ചഭാഷിണികൾ, ശബ്ദമലിനീകരണത്തിനു ഹേതുകമാകരുതെന്ന ഹൈദരലി തങ്ങളുടെ കർക്കശ നിർദേശം ശ്രദ്ധേയമായിരുന്നു.നിരവധി മഹല്ലുകളുടെ ഖാദി സ്‌ഥാനം ഏറ്റെടുത്തിരുന്ന തങ്ങൾ പ്രശ്‌നരഹിതമായ സാമൂഹിക അന്തരീക്ഷം സൃഷ്ടിച്ചെടുക്കുന്നതിനു പ്രത്യേകം ശ്രദ്ധിച്ചു.
      കേരളത്തിലെ ബഹുഭൂരിഭാഗം മതവിദ്യാഭ്യാസ സ്‌ഥാപനങ്ങളുടെയും നേതൃപദവിയിലെ അവിഭാജ്യഘടകമായിരുന്നു തങ്ങൾ..വൈജ്ഞാനിക സംരംഭങ്ങളെ കാലികമാക്കുന്നതിനു നേതൃപരമായ പങ്കും വഹിച്ചു.സമന്വയ സംവിധാനത്തിന്റെ പ്രധാന്യവും പ്രസക്‌തിയും തിരച്ചറിഞ്ഞ അദ്ദേഹം പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ, നന്തി ദാറുസ്സലാം വാഫി സ്‌ഥാപനങ്ങൾ തുടങ്ങി ഒട്ടനേകം മത - സമന്വയ സ്‌ഥാപനങ്ങളുടെ കാര്യദർശിയായി.യു.എ.ഇ, ഈജിപ്ത്, തുർക്കി, മൊറോക്കോ രാഷ്ട്രങ്ങളിൽ ഞങ്ങളൊരുമിച്ചു നടത്തിയ യാത്രകൾ ഇന്നും മധുരിക്കുന്ന ഓർമകളാണ്.ഈജിപ്ത‌ിലെ ഗ്രാൻഡ് മുഫ്തി ഡോ.ശൈഖ് അലി ജുമുഅയുമായി കൂടിക്കാഴ്ച്‌ച നടത്താനും മൊറോക്കോയിലെ ഉന്നതവിദ്യാശാലകൾ സന്ദർശിക്കാനും അധികൃതർ, നയതന്ത്രജ്‌ഞർ, മന്തിമാർ എന്നിവരുമായി ബന്ധമുണ്ടാക്കാനും അവസരമുണ്ടായി.ദാറുൽ ഹുദായുമായി സവിശേഷമായൊരു ഹൃദയബന്ധവും അഭിനിവേശവും അദ്ദേഹത്തിനുണ്ടായിരുന്നു. 2008 - ൽ ദാറുൽഹുദായുടെ പ്രസിഡൻ്റ് പദവിയിലെത്തിയ അദ്ദേഹം 2009 മെയ് 10 ന് ഇസ്ലാമിക സർവകലാശാലയായി അപ്‌ഗ്രേഡ് ചെയ്‌തപ്പോൾ പ്രഥമ ചാൻസലറായി തങ്ങളും വൈസ് ചാൻസലറായി ലേഖകനും നിയമിതരായി.ദാറുൽഹുദാ സർവകലാശാലക്ക് അംഗത്വമുള്ള മൊറോക്കോയിലെ ഫെഡറേഷൻ ഓഫ് ദ യൂനിവേഴ്‌സിറ്റീസ് ഓഫ് ദ ഇസ്ലാമിക് വേൾഡിൻ്റെ ആസ്‌ഥാനത്ത് ഞങ്ങൾ ഒരുമിച്ച് പര്യടനം നടത്തിയതും ഇന്ത്യയിൽ ദാറുൽഹുദാ നടത്തുന്ന വിദ്യാഭ്യാസ സംരംഭങ്ങളുടെ വ്യത്യസ്‌ത യാത്രകളിൽ പങ്കാളികളായതും മായാത്ത ഓർമകളായുണ്ട്.
      ഇടപെടലുകളിലെ സൗമ്യത, നിലപാടുകളിലെ കണിശത, പ്രവർത്തനങ്ങളിലെ ഊർജ്ജസ്വലത, അഭിപ്രായ പ്രകടനങ്ങളിലെ വ്യക്തത തുടങ്ങി ഒട്ടനവധി വിശേഷങ്ങളുള്ള അപൂർവ വ്യക്തിത്വമായിരുന്നു അദ്ദേഹം.മുസ്ലിം ലീഗ്, സമസ്‌ത കേരള ജംഇയ്യത്തുൽ ഉലമാ, കീഴ്ഘടകങ്ങൾ, മഹല്ല് സംവിധാനങ്ങൾ, മത - ഭൗതിക സമന്വയ വിദ്യാഭ്യാസ സ്‌ഥാപനങ്ങൾ എന്നിവക്കെല്ലാം സൗമ്യതയുടെ നേത്യമുഖമായി നിലകൊണ്ട ഹൈദരലി ശിഹാബ് തങ്ങളുടെ വിയോഗം മൂലം കടുത്ത ശൂന്യതയാണ് അനുഭവപ്പെടുന്നത്.ദേഹം വിടവാങ്ങിയെങ്കിലും അദ്ദേഹത്തിന്റെ പാതയിൽ സമൂഹത്തെയും സമുദായത്തെയും മുന്നോട്ട് നയിക്കാൻ ശക്തനായ പകരക്കാരനുണ്ടാകട്ടെ എന്നു ഹൃദയം തൊട്ട് പ്രാർത്ഥിക്കുന്നു.`,
      },
    ],
  },
  {
    name: " കെ.കെ. സദഖത്തുല്ലാ മൗലവി",
    born: "1906",
    death: "1408/08/06",
    description:
      "സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമായുടെ മൂന്നാമത്തെ പ്രസിഡണ്ട്, കേരള സംസ്ഥാന ജംഇയ്യത്തുൽ ഉലമായുടെ പിറവിക്കുശേഷം അതിന്റെ സ്ഥാപക ജനറൽ സെക്രട്ടറി, ഗ്രന്ഥ കർത്താവ്, പ്രഭാഷകൻ, പണ്ഡിതശ്രേഷ്ടൻ. ഇതൊക്കെയായിരുന്നു ശൈഖുനാ എന്നറിയപ്പെട്ടിരുന്ന കെ.കെ. സദഖത്തുല്ലാ മൗലവി. ഫില്‌ഹീ മസ്അലകളിൽ ധാരാളം ഫത് വകൾ നല്ലിയിട്ടുണ്ട്.",
    articles: [
      {
        title: " ജീവിതം",
        content: `കൊല്ലവർഷം 1082 മേടം ഒന്ന്, ഹി 1325, ക്രിസ്ത്വബ്ദം 1906ൽ ജനിച്ചു. പ്രഗത്ഭ മുദരിസും പണ്ഡിതനമായ കറന്തക്കാട് കരിമ്പനക്കൽ കുടുംബത്തിലെ പോക്കർ മുസ്ല്യാരാണ് പിതാവ്. മാതാവ് കോഡൂരിലെ മങ്കരത്തൊടി തറവാട്ടിലെ മമ്മു അധികാരിയുടെ മകൾ തിത്തിക്കുട്ടി ഖുത്തുബി മുഹമ്മദ് മുസ്ല്യാർ, വെല്ലൂരിലെ ശാഹ് മുഹമ്മദ് അബ്ദുൽ ജബ്ബാർ ഹള്റത്ത്, ശൈഖ് ആദം ഹളറത്ത് എന്നിവരിൽ നിന്നാണ് മതപഠനം. കണ്ണിയത്ത് അഹ്മദ് മുസ്ല്യാരും സന്ദഖത്തുല്ല മൗലവിയും വാഴക്കാട് ഒന്നിച്ചു പഠിച്ചവരാണ്. 
                             സ്കൂൾ പഠനം അഥവാ ആര്യനെഴുത്ത് പഠിക്കുന്നത് അക്കാലത്ത് മുസ്ലിങ്ങൾക്ക് പതിവില്ലായിരുന്നു. പിതാവിൽ നിന്നാണ് പ്രാഥമിക പഠനം. വാഴക്കാട് ദാറുൽ ഉലൂമിൽ നിന്നും വെല്ലൂർ ബാഖിയാത്തുസ്സ്വാലിഹാത്തിൽ നിന്നും മതപഠനം പൂർത്തിയാക്കി. മാനാ കൈപ്പറ്റ ബീരാൻ കുട്ടി മുസ്ല്യാർ, കണ്ണിയത്ത് അഹ്മദ് മുസി‌ലിയാർ, ഏ.കെ. കുഞ്ഞറമുട്ടി മുസ്‌ലിയാർ, എം.സി.സി ഹസൻ മൗലവി തുടങ്ങിയവർ ദാറുൽ ഉലൂമിലെ സഹപാഠികളായിരുന്നു. 1930 മുതൽ ദർസ് രംഗത്തേക്കു വന്നു. മലപ്പുറത്തിനടുത്തുള്ള ചെമ്മങ്കടവ്, മമ്പാട്, തിരുരങ്ങാടി, വണ്ടൂർ, മറ്റത്തൂർ, തലക്കടത്തൂർ തുടങ്ങിയ സ്ഥലങ്ങളിലാണ് ദർസ് നടത്തിയിരുന്നത്. ജാമി വഹബിയയിൽ പ്രിൻസിപ്പലായും സേവനമനുഷ്ഠിച്ചു. വളവന്നൂർ പരിക്കുട്ടി മുസ്‌ലിയാർ, പൂക്കയിൽ പോക്കരുട്ടി മുസ്‌ലിയാർ, സയ്യിദ് അബ്ദുറഹ്മാൻ പൂക്കോയ തങ്ങൾ, അബുബക്കർ ഹള്റത്ത്, മുസ്തഫാ ആലിം സാഹിബ്, വണ്ടൂർ കുട്ട്യാമു മുസ്‌ലിയാർ, കോഴിക്കോട് വലിയ ലാദി ഇമ്പിച്ചിക്കോയ തങ്ങൾ തുടങ്ങിയ നിരവധി ശിഷ്യഗണങ്ങൾ മൗലവിക്കുണ്ട്. 1940 കളിൽ അൽ വിലായത്തു വൻ കറാമ' എന്ന കെ.എം.മൗലവിയുടെ ഗ്രന്ഥം പുറത്തു വന്ന സാഹചര്യത്തിൽ ഈ വിഷയത്തിലെ സുന്നീ നിലപാട് വിശദീകരിച്ചു കൊണ്ടും പുസ്തകത്തെ ഖണ്ഡിച്ചുകൊണ്ടും 'അൽ മുത്ത് ജിസത്തു വൽ കറാമ് എന്ന അറബി മലയാള കൃതി രചിച്ചു. നമസ്കാരത്തിൽ കൈ ചെയ്യുന്ന വിഷയത്തിൽ ശാഫി മദ്ഹബുകാരുടെ നിലപാട് വിശദീകരിച്ചു കൊണ്ട് 'തക്‌ബീറത്തുൽ ഇഹ്‌റാമിൻറെ ശേഷമുള്ള രണ്ടു കൈകളുടെ ശട്ടം' എന്ന ഗ്രന്ഥം സമസ്തയുടെ പ്രസിഡണ്ടായിരുന്ന (ഹി:1308 13996) കുഞ്ഞായിൻ മുസ്‌ലിയാർ പുറത്തിറക്കിയിരുന്നു. ഇതിന് എം.സി.സി അബ്ദുറഹ്മാൻ മൗലവി ഒരു ഖണ്ഡനകൃതി പുറത്തിറക്കി. 'നെഞ്ചത്തു കൈ വെക്കണം അഥവാ ശട്ടത്തിനൊരു ചൊട്ട്' എന്നായിരുന്നു അതിന്റെ പേര്. ശൈഖുന സ്വദഖത്തുല്ലാ മൗലവി ഇതിനൊരു ഖണ്ഡനമെഴുതി. 'മഫ്'ഉപ്പുബഹി വന്നർ ഫീ വള്ഇൽ യറി തഹ്‌തസ്സ്വരർ അഥവാ ചൊട്ടിനൊരു തട്ട് എന്നാണതിന്റെ പേര്. 1948 ഫെബ്രുവരി 22 നാണ് ഇത് പുറത്തിറങ്ങിയത്. സമസ്തയുടെ മുഖപത്രമായ അൽബയാൻ മാസികയിൽ തുടർച്ചയായി ലേഖനമെഴുതിയിരുന്നു. 1969 ജനുവരി മുതൽ 1985 ന് മരണപ്പെടുന്നതു വരെയും നുസ്രത്തുൽ അനാം മാസികയുടെ പത്രാധിപരായിരുന്നു. 1929 ൽ കോഴിക്കോട് നിന്നാരംഭിച്ച അൽ ബയാനിലും 1950 ൽ രണ്ടാമതാരംഭിച്ച അൽ ബയാനിലും ഹിദായത്തുൽ മുഅ്‌മിനീൻ, സുബുലുസ്സലാം, നൂറുൽ ഇസ്ലാം എന്നീ പ്രസിദ്ധീകരണങ്ങളിലും ലേഖനമെഴുതിയിട്ടുണ്ട്. നുസ്റത്തുൽ അനാമിൽ പ്രസിദ്ധീകരിച്ചു വന്ന എണ്ണൂറോളം ഫത്‌വകളുടെ സമ്പൂർണ ഫതാവായും പ്രസിദ്ധീകൃതമായി വിശുദ്ധ ഖുർആൻ പരിഭാഷ ചെയ്യുന്നത് ഫറാമാണെന്നാണ് ശൈഖുനായുടെ അഭിപ്രായം. ജുമുഅ ഖുതുബക്ക് ലൗഡ്സ്റ്റിക്കർ ഉപയോഗിക്കുന്നത് ഹറാമാണെന്ന ഫത്‌വയും പ്രസിദ്ധമാണ്. ശൈഖുനാ രണ്ട് വിവാഹം ചെയ്തിട്ടുണ്ട്. മലപ്പുറത്തിനടുത്തുള്ള ചെമ്മങ്കടവത്തു നിന്ന് സൂപ്പി കുരിക്കളുടെ മകൾ ഫാതിമയാണ് ആദ്യ ഭാര്യ, അതിൽ 6 പുത്രൻമാരും 3 പുതിമാനുമുണ്ട്. കടലുണ്ടിയിലെ സൈനബാണ് രണ്ടാം ഭാര്യം ഇവരിൽ 2 പുത്രൻമാരും 4 പുത്രിമാരുമുണ്ട്.`,
      },
    ],
  },
  {
    name: " സയ്യിദ് ഉമ്മർ ബാഫക്കി",
    born: "Year-Month-Day",
    death: "1429/08/10",
    description: `ഇ.എം.എസിന്റെ നേതൃത്വത്തിലുള്ള കമ്യൂണിസ്റ്റ് മന്ത്രിസഭക്കെതിരെ വിമോചന സമരത്തിൽ പങ്കെടുത്തതിന് 1959ലും അടിയന്തരാവസ്ഥക്കെതിരെ പ്രസ്താവന നടത്തിയതിന് അടിയന്തരാവസ്ഥക്കാലത്തും ഉമർ ബാഫഖി തങ്ങൾ ജയിൽവാസമനുഷ്ടിച്ചിട്ടുണ്ട്. ആദ്യ തവണ 14 ദിവസവും രണ്ടാം തവണ ഒരു കൊല്ലവും രണ്ട് മാസവുമാണ് ജയിലിൽ കിടന്നത്. 1967ൽ കൊണ്ടോട്ടിയിൽ നിന്നും 1971ൽ താനൂരിൽ നിന്നും അദ്ദേഹം നിയമസഭയിലേക്ക് തെരഞ്ഞെടുക്കപ്പെട്ടു. മൂന്ന് തവണ വഖ്‌ഫ് ബോർഡ് ചെയർമാനായിരുന്നിട്ടുണ്ട്. കേരളത്തിൽ ആദ്യമായി മുകി പെൻഷൻ അനുവദിച്ചത് അദ്ദേഹം വഖഫ് ബോർഡ് ചെയർമാനായിരിക്കുന്ന കാലത്താണ്.
      ചന്ദ്രിക മാനേജിംഗ് ഡയരക്ടർ, സമസ്ത കേരള വിദ്യാഭ്യാസ ബോർഡ് ഖജാൻജി, പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ അറബിക് കോളജ് പ്രസിഡന്റ്, നന്തി ദാറുസ്സലാം അറബിക് കോളജ് പ്രസിഡൻ്റ് എന്നീ സ്ഥാനങ്ങൾ വഹിച്ചിട്ടുണ്ട്.കൂടാതെ പൊന്നാനി മഊനതുൽ ഇസ്‌ലാം സഭ, കാരന്തൂർ മർകസ്സുസഖാഫത്തിസ്സുന്നിയ്യ, സർ സയ്യിദ് കോളജ് തുടങ്ങിയവയുടെ ഭരണസമിതിയിലും പ്രവർത്തിച്ചിട്ടുണ്ട്.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `മൂന്ന് നൂറ്റാണ്ടുകൾക്ക് മുമ്പ് യമനിലെ ഹദ്റമൗതിനടുത്ത തരീം എന്ന സ്ഥലത്ത് നിന്നും കേരളത്തിൽ കുടിയേറിയ ബാഫഖി കുടുംബത്തിലെ അംഗമാണ് മുസ്‌ലിം ലീഗിൻ്റെ നേതാവും നവോത്ഥാന നായകനുമായ ഉമർ ബാഫഖി തങ്ങൾ. 1921 നവംബർ 21ന് പരിശുദ്ധമായ മക്കയിലാണ് അദ്ദേഹത്തിൻ്റെ ജനനം. കൽക്കത്തയിൽ ബിസിനസ് നടത്തിയിരുന്ന സയ്യിദ് ഹുസൈൻ ബാഫഖിയുടെ മകൻ സയ്യിദ് ഹാശിം ബാഫഖിയാണ് പിതാവ്. മാതാവ് ഇന്ത്യൻ യൂണിയൻ മുസ്‌ലിം ലീഗ് നേതാവായിരുന്ന സയ്യിദ് അബ്ദുറഹ്മാൻ ബാഫഖി തങ്ങളുടെ സഹോദരി ശരീഫ റൗദ.
      മക്കയിൽ ജനിച്ചെങ്കിലും ജീവിതത്തിൻ്റെ അവസാന നാളുകൾ വരെ ചെലവിട്ടത് കേരളത്തിലാണ്.മരണം സൗദിയിൽ വെച്ച് തന്നെ ആയതിനാൽ അദ്ദേഹത്തെ ഖബറടക്കിയിരിക്കുന്നത് മക്കയിലാണ്.കൊയിലാണ്ടി മഠത്തിൽ സ്‌കൂൾ, കോഴിക്കോട് ഹിമായത്തുൽ ഇസ്‌ലാം ഹൈസ്‌കൂൾ എന്നിവിടങ്ങളിലും മക്കയിലെ ഒരു മതവിദ്യാലയത്തിലുമായാണ് പഠനം. 1940ൽ പഠനം പൂർത്തിയാക്കിയ ശേഷം കച്ചവടത്തിലേർപ്പെട്ടു.അമ്മാവനായ അബ്ദുറഹ്മാൻ ബാഫഖി തങ്ങളായിരുന്നു ലീഗിലേക്കുള്ള അദ്ദേഹത്തിൻ്റെ വഴികാട്ടി കോഴിക്കോട് താലൂക്ക് മുസ്‌ലിം ലീഗ് പ്രസിഡൻ്റായി ലീഗിൻ്റെ നേത്യ രംഗത്തേക്ക് കടന്നുവന്നു.പിന്നീട് മലബാർ മുസ്‌ലിം ലീഗ് പ്രവർത്തക സമിതിയിൽ അംഗമായി.മുസ്‌ലിം ലീഗ് സംസ്ഥാന വൈസ് പ്രസിഡൻറ്, സംസ്ഥാന ജനറൽ സെകട്ടറി, സംസ്ഥാന ട്രഷറർ എന്നീ നിലകളിൽ പ്രവർത്തിച്ചു.മുസ്‌ലിം ലീഗിലുണ്ടായ ആദ്യ പിളർപ്പിനെ തുടർന്ന് അഖിലേന്ത്യാ ലീഗ് പക്ഷത്ത് നിലയുറപ്പിച്ച ബാഫഖി തങ്ങൾ അഖിലേന്ത്യ ലീഗിൻ്റെ സംസ്ഥാന ജനറൽ സ്‌രകട്ടറി, വൈസ് പ്രസിഡൻ്റ് എന്നീ നിലകളിലും പ്രവർത്തിച്ചിട്ടുണ്ട്.`,
      },
    ],
  },
  {
    name: " വരക്കല്‍ മുല്ലക്കോയ തങ്ങള്‍",
    born: "Year-Month-Day",
    death: " 16/12/1932",
    description: `യമനിലെ ഹളര്‍മൗതില്‍ നിന്ന് ഇസ്‌ലാമിക പ്രചരണത്തിനായി വന്ന പണ്ഡിതനും സ്വൂഫിവര്യനുമായ സയ്യിദ് ഹാമിദ് അലിക്ക് ശേഷം മൂന്നാം തലമുറയിലെ സയ്യിദ് മുഹമ്മദ് ബാ അലവിയുടെയും മരക്കാരകത്ത് ശരീഫ ചെറിയ ബീവിയുടെയും പുത്രനായി സയ്യിദ് അബ്ദുറഹ്മാന്‍ ബിന്‍ മുഹമ്മദ് ബിന്‍ അഹമ്മദ് ബിന്‍ അലവി മുല്ലക്കോയ തങ്ങള്‍ 1840 ല്‍ പുതിയങ്ങാടി വലിയ മാളിയക്കല്‍ ജനിച്ചു. സയ്യിദ് മുഹമ്മദ് കുഞ്ഞി സീതിക്കോയ ബാ അലവി, ശരീഫ മുല്ലബീവി എന്നിവര്‍ സഹോദരങ്ങളാണ്. 1858ല്‍ വിവാഹിതരായി. ആദ്യഭാര്യ കോയമ്മ ബീവി. രണ്ടാം ഭാര്യ ഫാതിമ ബീവി. രണ്ടു ഭാര്യമാരിലും സന്താനങ്ങളുണ്ടായിരുന്നില്ല. പ്രസിദ്ധനായ മുസ്‌ലിം സാമൂഹ്യ പരിഷ്‌കര്‍ത്താവ് സയ്യിദ് അബ്ദുറഹ്മാന്‍ ബാഫഖി തങ്ങള്‍, വരക്കല്‍ തങ്ങളുടെ സഹോദരീ പുത്രനായിരുന്നു.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `കോഴിക്കോട് പുതിയങ്ങാടിയിലെ മുല്ലക്കോയ തങ്ങളുടെ വീട്ടിലേക്ക് കേരളത്തിന്റെ നാനാഭാഗത്തുനിന്നും ജനങ്ങള്‍ എത്തിച്ചേര്‍ന്നത് ട്രെയിന്‍ മാര്‍ഗമായിരുന്നു. ഇന്നത്തെ വെസ്റ്റ്ഹില്‍ റെയില്‍വേ സ്‌റ്റേഷന്റെ പഴയ പേര് വരക്കല്‍ എന്നായിരുന്നു. വരക്കല്‍ സ്റ്റേഷനില്‍ ഇറങ്ങിക്കൊണ്ടായിരുന്നു പുതിയങ്ങാടിയിലെത്തിയിരുന്നത്. അതുകാരണം ദൂരെനിന്ന് വരുന്നവര്‍ വരക്കല്‍ തങ്ങള്‍ എന്നു പറയാന്‍ തുടങ്ങി. ഹിജ്‌റ വര്‍ഷം 1352 (എ.ഡി.1932) ശഅബാന്‍ 17 ന് തൊണ്ണൂറ്റി രണ്ടാം വയസ്സില്‍ പുതിയങ്ങാടിയില്‍ വെച്ച് ആ മഹാനുഭാവന്‍ ഇഹലോകവാസം വെടിഞ്ഞു.


      നിരവധി അമൂല്യ ഗ്രന്ഥങ്ങളാല്‍ പ്രൗഢമായ പുതയങ്ങാടിയിലെ തന്റെ വീടും പള്ളിയും വിട്ട് പ്രാഥമിക പഠനത്തിന് വേറെ ഇടം തേടേണ്ടി വന്ന ജനങ്ങള്‍ക്ക് പ്രമുഖ പണ്ഡിതനും നിരവധി ഗ്രന്ഥങ്ങളുടെ കര്‍ത്താവുമായ കിന്‍സിങ്ങാന്റകത്ത് അബൂബക്കര്‍ കുഞ്ഞിഖാസി, സയ്യിദ് അലി അത്താസ്, (മദീന) അബുദുല്ലാഹില്‍ മഗ്‌രിബി(യെമന്‍) തുടങ്ങിയവര്‍ തങ്ങളുടെ ഗുരുക്കന്മാരില്‍ പ്രമുഖരായിരുന്നു.
      ഭാഷാപഠനത്തിന് തങ്ങള്‍ക്കുള്ള കഴിവ് അപാരമാണ്.അറബി ഗുരുക്കന്‍മാര്‍ ഉണ്ടായതിനാല്‍ തന്നെ അവരില്‍ നിന്ന് അറബി ഭാഷാ സ്വായത്തമാക്കി.അറബിയില്‍ അനായാസം സംസാരിക്കാനും രചനകള്‍ നിര്‍വഹിക്കനുമുള്ള കഴിവ് അദ്ദേഹം നേടിയെടുത്തു.ഉര്‍ദു, പേര്‍ഷ്യന്‍, മലയാളം തുടങ്ങിയ ഭാഷകളില്‍ പ്രയാസം കൂടാതെ എഴുതാനും സംസാരിക്കാനുമുള്ള കഴിവ് തങ്ങള്‍ക്കുണ്ടായിരുന്നു.തങ്ങളുടെ ഈ ഭാഷാ നിപുണത ബ്രിട്ടീഷുകാര്‍ തിരിച്ചറിഞ്ഞിരുന്നു.മലബാര്‍ മാന്വലിന്റെ കര്‍ത്താവായ മലബാര്‍ കളക്ടര്‍ വില്യം ലോഗന്‍ അദ്ദേഹവുമായി സൗഹൃദത്തിലായി.മലബാര്‍ മാന്വലില്‍ മുസ്‌ലിംകളെ സംബന്ധിച്ച വിവരങ്ങള്‍ ഉള്‍പ്പെടുത്തുന്നതിന് മുല്ലക്കോയ തങ്ങളുടെ സേവനം ലോഗനു വളരെയധികം സഹായകമായിത്തീര്‍ന്നു.തുഹ്ഫത്തുല്‍ മുജാഹിദീന്‍ മുതലായ അറബ് ചരിത്ര ഗ്രന്ഥങ്ങളുടെ ഉള്ളടക്കം മനസ്സിലായത് മുല്ലക്കോയ തങ്ങളില്‍ നിന്നാണ്.സായിപ്പുമാരുമായുള്ള ബന്ധം ഇംഗ്ലീഷ് ഭാഷ പഠിക്കാന്‍ തങ്ങളും ഉപയോഗപ്പെടുത്തിയിരുന്നു.അങ്ങനെ, അവരില്‍ നിന്ന് തന്നെ ആംഗലേയ ഭാഷയും തങ്ങള്‍ സ്വായത്തമാക്കി.
      ബഹുഭാഷാ പണ്ഡിതനായിരുന്ന തങ്ങളുടെ കൈവശം ഈ ഭാഷകളിലുള്ള നിരവധി ഗ്രന്ഥങ്ങളുമുണ്ടായിരുന്നു.കേരളത്തിലെ ഏക രാജവംശമായ അറക്കല്‍ രാജവംശത്തിലെ രാജാവായിരുന്ന അറക്കല്‍ ആലി രാജാവും തങ്ങളും നല്ല ബന്ധമായിരുന്നു.അദ്ദേഹത്തിന് അറക്കല്‍ കൊട്ടാരത്തില്‍ ചില പ്രധാന ജോലികള്‍ ഉണ്ടായിരുന്നു.വിദേശ രാജ്യങ്ങളിലേക്കുള്ള കത്തുകള്‍ തയ്യാറാക്കുക.അവിടങ്ങളില്‍നിന്ന് വന്ന കത്തുകള്‍ പരിഭാഷപ്പെടുത്തുക, മറുപടി തയ്യാറാക്കുക തുടങ്ങി തികച്ചും ഔപചാരികമായ ജോലികള്‍.കൂടാതെ ഭരണകാര്യങ്ങളില്‍ വരെ അറക്കല്‍ രാജാവ് തങ്ങളോട് അഭിപ്രായം ചോദിച്ചിരുന്നു.അതിനാല്‍, തന്നെ ഇ്‌സ്ലാമിക ശരീഅത്തിനനുസൃതമായിതന്നെ ഭരണം നടത്താന്‍ അറക്കല്‍ രാജാവിന് കഴിഞ്ഞു.
      ചരിത്രത്തില്‍ പ്രമുഖരായിത്തീര്‍ന്ന പലരും വിദ്യതേടി പുതിയങ്ങാടിയിലെത്തിയിരുന്നു.പാങ്ങില്‍ അഹ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, ഖുതുബി മുഹമ്മദ് മുസ്‌ലിയാര്‍, പുതിയാപ്ല അബ്ദുറഹിമാന്‍ മുസ്‌ലിയാര്‍, മുഹമ്മദ് അബ്ദുല്‍ ബാരി മുസ്‌ലിയാര്‍ അങ്ങനെ നിരവധി പേര്‍ അക്കൂട്ടത്തിലുണ്ട്.അറിവും നേതൃപാടവവും കൊണ്ട് സമൂഹത്തിലെ നാനാതുറകളിലുള്ളവരെയും ആകര്‍ഷിക്കാന്‍ വരക്കല്‍ തങ്ങള്‍ക്ക് സാധിച്ചു.നാടിനെ നശിപ്പിക്കാന്‍ വന്ന ബ്രിട്ടീഷുകാര്‍ക്ക് പോലും തങ്ങളുടെ വ്യക്തിത്വത്തെ അംഗീകരിക്കേണ്ടി വന്നു.

      എന്തുകൊണ്ട് ബ്രിട്ടീഷുകാര്‍ക്ക്
      ബഹുമാന്യനായി ?
                                കേരള മുസ്‌ലിംകളുടെ ചരിത്രത്തില്‍, പ്രത്യേകിച്ച് മലബാര്‍ മുസ്‌ലിംകളുടെ ചരിത്രത്തില്‍ സുപ്രധാനമായൊരു കാലമാണ് എ.ഡി. 1792 മുതല്‍ 1900 വരെയുള്ള 108 വര്‍ഷം.അഞ്ചു തലമുറകള്‍ എന്നുപറയാം.ഈ തലമുറകളിലൂടെ നടന്ന വൃദ്ധി - ക്ഷയങ്ങളുടെ മൊത്തം ലാഭനഷ്ടം കണക്കാക്കിയാല്‍ ഏറ്റവും ഒടുവിലത്തെ തലമുറ അതിദയനീയമായ പരാജയത്തില്‍ ആപതിക്കുകയായിരുന്നു.ബോധപൂര്‍വവും ആസൂത്രിതവും ആദര്‍ശപരവുമായി വളര്‍ന്ന ഒരു സമൂഹത്തിന് ക്രമേണ പലതും സംഭവിക്കുകയും ചെയ്തു.കേന്ദ്രീകൃത നേതൃത്വത്തിന്റെ അഭാവമായിരുന്നു ഇതില്‍ പ്രധാനമെന്ന് നമുക്ക് അനുമാനിക്കാം.ഇക്കാലത്ത് തങ്ങള്‍ നേടിയെടുത്ത ആധിപത്യത്തിന് വിഘ്‌നം നില്‍ക്കുന്നവരെ തന്ത്രപരമായി വശത്താക്കാന്‍ ബ്രിട്ടീഷ് കൊളോണിയല്‍ വര്‍ഗം ശ്രമിക്കുകയുണ്ടായി. 1865 കളില്‍ മാപ്പിളമാരോടുള്ള കര്‍ശന നിലപാടില്‍  ബ്രിട്ടീഷ് ഗവണ്‍മെന്റ് മാറ്റം വരുത്തി.ഈ മാറ്റത്തിന്റെ ഭാഗമായി മാപ്പിള പ്രമാണിമാരെ ഖാന്‍ ബഹദൂര്‍ പട്ടം നല്‍കി ആദരിക്കുകയും മതപണ്ഡിതരെ അര്‍ഹമാം വിധം പരിഗണിക്കുകയും ചെയ്തു.സ്വാഭാവികമായി അന്നത്തെ മുസ്‌ലിം കൈരളിയുടെ അധ്യാത്മിക നേതാവും ഹതാശരുടെ ആലംബവുമായിരുന്ന വരക്കല്‍ മുല്ലക്കോയ തങ്ങല്‍ക്ക് മുമ്പില്‍ ബ്രിട്ടഷുകാര്‍ നമ്രശിരസ്‌കരായി നില്‍ക്കേണ്ടി വന്നു.
      വരക്കല്‍ മുല്ലക്കോയ തങ്ങള്‍ ആത്മീയ രംഗത്ത് ഉന്നത സ്ഥാനത്തായതു പോലെ ഭൗതികരംഗത്തും ഉന്നതസ്ഥാനീയനായിരുന്നു.കളക്ടര്‍ ഉള്‍പ്പെടെയുള്ള ബ്രിട്ടീഷ് ഉദ്യോഗസ്ഥന്മാര്‍ തങ്ങളെ സന്ദര്‍ശിച്ച് മുസ്‌ലിംകളുടെ പ്രശ്‌നങ്ങള്‍ ചര്‍ച്ച ചെയ്യുകയും തങ്ങളുടെ അഭിപ്രായമനുസരിച്ച് പരിഹാരമുണ്ടാക്കുകയും ചെയ്തിരുന്നു.അറക്കല്‍ രാജാവിന്റെ കൊട്ടാരത്തിലെ മതപരമായ എല്ലാ ചടങ്ങുകളുടെയും മേല്‍നോട്ടം തങ്ങള്‍ക്കായിരുന്നു.അറക്കല്‍ കൊട്ടാരത്തില്‍ നിന്ന് അയച്ചുകൊടുക്കാറുള്ള കുതിരവണ്ടിയിലായിരുന്നു തങ്ങള്‍ കണ്ണൂരിലേക്ക് പോകാറ്.വഴി നീളെ ദാഹം തീര്‍ക്കാന്‍ ഓരോ തെങ്ങ് അതാതിടങ്ങളില്‍ തങ്ങള്‍ക്കായി ഏര്‍പ്പെടുത്തിയിരുന്നു.
      ഒന്നാം ലോകമഹായുദ്ധത്തില്‍ സ്ഥാനഭ്രഷ്ടനാക്കപ്പെട്ട മുസ്ലിം ലോകത്തിന്റെ ഖലീഫയുടെ പേരില്‍ ലോകത്തിന്റെ നാനാഭാഗങ്ങളില്‍ പ്രകടമായ പ്രതിഷേധമാണ് ഖിലാഫത്ത് വിപ്ലവം.വിശ്വാസപരമായ ഒരു തക്‌ലീഫ് എന്നതിന് പുറമെ അതിന്റെ കാരണക്കാരും തങ്ങളുടെ ഭരണാധികാരികളുമായ ബ്രിട്ടീഷുകാര്‍ക്കെതിരെയുള്ള സാമ്രാജ്യത്വ വിരുദ്ധ പോരാട്ടമായിരുന്നു ഭാരതത്തിന് ഖിലാഫത്ത്. 1919 ജനുവരി 26 ന് ലഖ്‌നോവില്‍ അബ്ദുല്‍ ബാരി സ്ഥാപിച്ച നാഷണല്‍ ഖിലാഫത്ത് പ്രസ്ഥാനത്തിന്റെ അനുരണനങ്ങല്‍ കേരളത്തിലുമെത്താന്‍ അധികം താമസമുണ്ടായില്ല. 1920 ജൂലൈ 18 ന് കോഴിക്കോട് ജൂബിലി ഹാളില്‍(ഇന്നത്തെ ടൗണ്‍ ഹാള്‍) വെച്ച് മലബാര്‍ ഖിലാഫത്ത് കമ്മിറ്റി രൂപീകരിക്കുകയും ചെയ്തു.

      എന്നാല്‍ ഖിലാഫത്ത് പ്രസ്ഥാനത്തിന്റെ എതിരാളിയായിട്ടാണ് മുല്ലക്കോയ തങ്ങള്‍ അറിയപ്പെട്ടിരുന്നത്.മുുഹമ്മദ് നബി(സ) ക്കും അവിടുത്തെ കുടുംബപരമ്പരക്കും മാത്രമെ ഖിലാഫത്ത് നടത്താന്‍ അധികാരമുള്ളൂ എന്നായിരുന്നു മുല്ലക്കോയ തങ്ങളുടെ വാദം.ഇത് ഖിലാഫത്തിന് എിതാരയ ബ്രിട്ടീഷ് സര്‍ക്കാരിന് അദ്ദേഹത്തെപോലുള്ള ഒരു ആത്മീയ നേതാവില്‍ ബഹുമാനം വര്‍ധിപ്പിക്കാനിടയായി.ഈ എതിര്‍പ്പ് അധികകാലം നീണ്ടുനിന്നില്ല.രാഷ്ട്രീയകാര്യങ്ങള്‍ കയ്യാളുന്നതോടൊപ്പം ഇസ്‌ലാം മതാഭിവൃദ്ധിക്കു വേണ്ടിയും ഖിലാഫത്ത് പ്രസ്ഥാനം പ്രവര്‍ത്തിക്കണമെന്ന് വരക്കല്‍ മുല്ലക്കോയ തങ്ങള്‍ ഉപാധിവെച്ചു.മതപരവും രാഷ്ട്രീയപരവുമായ സംരംഭങ്ങള്‍ക്കും ആത്മീയ ബോധനത്തിനും ശക്തമായ നേതൃത്വം നല്‍കിയെന്നു മാത്രമല്ല, 1920 നവംബര്‍ 3ാം തിയ്യതി സഭാടൗണ്‍ ഹാളില്‍ വിളിച്ചുകൂട്ടിയ ലോക്കല്‍ ഖിലാഫത്ത് കമ്മിറ്റിയുടെ പൊതുയോഗത്തില്‍ വരക്കല്‍ മുല്ലക്കോയ തങ്ങള്‍ അധ്യക്ഷപദവി അലങ്കരിക്കുകയും ചെയ്തു.

      പണ്ഡിതന്മാര്‍ ഒന്നിക്കുന്നു
      മുസ്‌ലിം പൊതു സമൂഹത്തില്‍ നിലവിലുണ്ടായിരുന്ന രീതികളെ പൊളിച്ചെഴുതി, വിശ്വാസപരവും അനുഷ്ഠാനപരവുമായ പരിഷ്‌കരണ പ്രവര്‍ത്തനങ്ങള്‍ നടത്താന്‍ വന്ന ചിലര്‍ കേരളത്തിന്റെ പലഭാഗത്തും തലപൊക്കിയപ്പോള്‍ അവ നിയന്ത്രിക്കേണ്ടതാണെന്ന് 1922 മുതല്‍ കേരളത്തിലെ പ്രബലമായ പണ്ഡിത സമൂഹത്തിന് തോന്നുകയുണ്ടായി.സ്വഹാബികളുടെ കാലം മുതല്‍ കേരളത്തിലുണ്ടായിരുന്ന ഇസ്‌ലാമിന്റെ പരമ്പരാഗത രൂപം തന്നെയാണ് കേരളത്തില്‍ വേണ്ടതെന്ന് അവര്‍ ശഠിച്ചു.അഹ്മദ് കോയ ശാലിയാത്തി, പാങ്ങില്‍ അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, അച്ചിപ്ര കുഞ്ഞി മുഹമ്മദ് മുസ്‌ലിയാര്‍, പള്ളിപ്പുരം അബ്ദുല്‍ ഖാദര്‍ മുസ്‌ലിയാര്‍ തുടങ്ങിയ പണ്ഡിത നേതാക്കള്‍ അവരില്‍ പ്രമുഖരായിരുന്നു.
      കോഴിക്കോട് ആസ്ഥാനമാക്കി ഈ വിഭാഗത്തിന്റെ പ്രവര്‍ത്തനം ആരംഭിച്ചപ്പോഴാണ് പണ്ഡിതര്‍ മഹാനായ വരക്കല്‍ മുല്ലക്കോയ തങ്ങളുടെ വസതിയിലെത്തി അദ്ദേഹവുമായി കാര്യങ്ങള്‍ ചര്‍ച്ച ചെയ്തത്.ഇസ്‌ലാമിക പാരമ്പര്യത്തില്‍ അടിയുറച്ച രീതികളാണ് മുസ്‌ലിം കേരളത്തിന് അഭികാമ്യമെന്നും മറു വിഭാഗത്തിന്റെ പ്രവര്‍ത്തനങ്ങളെ ചെറുത്തു തോല്‍പ്പിക്കണമെന്നും തങ്ങളുടെ നേതൃത്വത്തില്‍ അവര്‍ തീരുമാനിച്ചു.ഇതിനൊരു താല്‍ക്കാലിക സംഘടനാ സംവിധാനം വേണമെന്ന ആശയത്തില്‍ നിന്നാണ് 1925 ന് അവര്‍ കോഴിക്കോട് കുറ്റിച്ചിറ ജുമുഅത്ത് പള്ളിയില്‍ യോഗം ചേരുകയും ഒരു പണ്ഡിത സംഘടനക്ക് രൂപം നല്‍കുകയും ചെയ്തത്.കെ.പി മുഹമ്മദ് മീറാന്‍ മൗലവി പ്രസിഡന്റും പാറോല്‍ ഹുസൈന്‍ മൗലവി സെക്രട്ടറിയുമായിട്ടായിരുന്നു ആ കമ്മിറ്റി.

                                തുടര്‍ന്ന് 1926 ജൂണ്‍ 26 ന് കോഴിക്കോട് ടൗണ്‍ഹാളില്‍ ചേര്‍ന്ന പണ്ഡിതന്മാരുടെ ഒരു ബൃഹത്തായ കണ്‍വെന്‍ഷനിലാണ്, വരക്കല്‍ മുല്ലക്കോയ തങ്ങളുടെ അധ്യക്ഷതയില്‍ സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമാഅ് എന്ന സംഘടന രൂപം കൊള്ളുന്നത്.വരക്കല്‍ മുല്ലക്കോയ തങ്ങള്‍ പ്രസിഡന്റും, പാങ്ങില്‍ അഹ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, വാഴക്കുളം അബ്ദുല്‍ ബാരി മുസ്‌ലിയാര്‍, കെഎം അബ്ദുല്‍ ഖാദര്‍ മുസ്‌ലിയാര്‍ മങ്കട, പി.കെ മുഹമ്മദ് മീറാന്‍ മുസ്‌ലിയാര്‍ എന്നിവര്‍ വൈസ് പ്രസിഡന്റുമാരും, പിവി മുഹമ്മദ് മുസ്‌ലിയാര്‍ വി.കെ.മുഹമ്മദ് മുസ്‌ലിയാര്‍ എന്നിവര്‍ സെക്രട്ടറിമാരായും ഈ കമ്മിറ്റി നിലവില്‍ വന്നു.ഇന്ന് സി.കോയക്കുട്ടി മുസ്‌ലിയാര്‍ ആനക്കരയും, ചെറുശ്ശേരി സൈനുദ്ദീന്‍ മുസ്‌ലിയാരുമാണ് ഈ സംഘടനക്ക് നേതൃത്വം നല്‍കുന്നത്.

      1952 ല്‍ വിദ്യാഭ്യാസ പ്രവര്‍ത്തനങ്ങളില്‍ കൂടുതല്‍ ശ്രദ്ധ കേന്ദ്രീകരിക്കാന്‍ ഒരു ബോര്‍ഡ് രൂപീകരിക്കുകയും തുടര്‍ന്ന് മുസ് ലിം കേരളത്തിന്റെ മത സാമൂഹ്യ വിദ്യാഭ്യാസ രംഗത്ത് ശ്രദ്ധേയമായ ചുവടുകള്‍ക്ക് തുടക്കം കുറിക്കുറിച്ചുകൊണ്ട് സമൂഹത്തിന് നേതൃത്വം നല്‍കുന്ന ഒരു മഹനീയ പ്രസ്ഥാനമാണ് സമസ്ത.

      1932 ൽ തൊണ്ണൂറ്റി രണ്ടാം വയസ്സിലാണ് മുല്ലക്കോയ തങ്ങൾ അന്തരിക്കുന്നത്.വരക്കൽ മഖാമിലാണ് ഖബറടക്കം ചെയ്തത്.`,
      },
    ],
  },
  {
    name: " കോട്ട അബ്ദുൽ ഖാദർ മുസ്ലിയാർ",
    born: "17/11/1939",
    death: "1430/09/03",
    description:
      "എം.ഐ.സി മുതവ്വൽ കോളേജ്, ഉമത്തൂർ അറബിക് കോളേജ് പ്രിൻസിപ്പലായി സേവനമനുഷ്ഠിച്ചു. ജ്യോതിശാസ്ത്രത്തിലും ഇസ്‌ലാമിക നിയമശാസ്ത്രത്തിലും ശ്രദ്ധേയനായ വ്യക്തിത്വവും അറബി, ഇംഗ്ലീഷ്, ഉറുദു, മലയാളം, പേർഷ്യൻ ഭാഷകളിൽ പ്രാവീണ്യമുള്ളതിനാൽ അദ്ദേഹം പ്രശസ്തനായിരുന്നു.",
    articles: [
      {
        title: " ജീവിതം",
        content: `കാസർഗോട് ജില്ലയിൽ സീ-മാൻ കോട്ട മുഹമ്മദിൻ്റെയും (മമ്മുഞ്ഞി) ഖദീജയുടെയും മകനായി ജനിച്ചു . കുമ്പള ഹൈസ്കൂളിൽ നിന്ന് ഉപരിപഠനം പൂർത്തിയാക്കിയ അദ്ദേഹം പിന്നീട് വിവിധ ദർസുകളിൽ പ്രവേശനം നേടി ഒലിയത്തൂർ, പടന്ന, ഇച്ചിലങ്കോട്. ഉപരിപഠനത്തിനായി 1965-കളുടെ തുടക്കത്തിൽ ദയൂബന്ദിലേക്കും ഡൽഹിയിലേക്കും പോയി. കസർഗോട് ഗ്രാമമായ കുമ്പഡാജയിലെ ഖാസിയായിരുന്ന അബ്ദുൽ റഹ്മാൻ മുസ്ലിയാരുടെ മകൾ റൂഖിയ്യയെയാണ് അദ്ദേഹം വിവാഹം കഴിച്ചത് 
      ദേബണ്ടില്‍ നിന്ന് കോഴ്സ് പൂര്‍ത്തിയാക്കിയ ശേഷം മലബാര്‍ ഇസ്ലാമിക് കോംപ്ലക്സ്, ചട്ടങ്ങല്‍, കാസര്‍കോട്, ഷാഫി മസ്ജിദ്(കണ്ണൂർ) , ഖിളർ ജുമാ മസ്ജിദ്(തായലങ്ങാടി, കസർഗോട്) തുരുത്തി ജുമാ മസ്ജിദ്, പറങ്കിപ്പാട്ട് ജുമാമസ്ജിദ്, നെല്ലിക്കുന്ന് മുഹിയദ്ദീൻ ജുമാമസ്ജിദ്, നെല്ലിക്കുന്ന് മുഹിയദ്ദീൻ ജുമാ മസ്ജിദ്, ജുമാമസ്ജിദ് എന്നിവിടങ്ങളിൽ സേവനമനുഷ്ഠിച്ചു.കോളേജ്.മുസ്‌ലിം സമൂഹത്തിൻ്റെ ഉയർച്ചയ്ക്ക് ജീവൻ പണയപ്പെടുത്തി അദ്ദേഹത്തിൻ്റെ വിലപ്പെട്ട സേവനം സാമൂഹികവും മതപരവുമായ മേഖലകളിലേക്ക് വ്യാപിച്ചു.സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമയുടെ ജോയിന്റ് സെക്രട്ടറി, മംഗലാപുരം ഖാസി(1990- 2008), സമസ്‌ത് കണ്ണൂർ വിഭാഗം ജില്ലാ സെക്രട്ടറി, സമസ്‌ത് വിദ്യാഭ്യാസ ബോർഡ് അംഗം, എംഐസി വൈസ് പ്രസിഡൻ്റ് എന്നീ സ്ഥാനങ്ങൾ വഹിച്ചു.`,
      },
      {
        title: " മരണം",
        content:
          "2008 സെപ്തംബർ 3ന് അന്തരിച്ച അദ്ദേഹത്തെ മൊഗ്രാൽ കടപ്പുറം ജുമാമസ്ജിദിൽ ഖബറടക്കി.",
      },
    ],
  },
  {
    name: " കെ കെ അബൂബക്കർ ഹസ്റത്ത്",
    born: ". 20/02/1929 ",
    death: "1415/09/05",
    description:
      " സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമ പ്രസിഡന്റായിരുന്നു (1993) കെ അബുബക്കർ ഹസ്‌റത്ത്.",
    articles: [
      {
        title: " ജീവിതം",
        content: `വിവിധ പള്ളി ദർസുകളിലെ പഠനത്തിനു ശേഷം വെല്ലുരിലും ദയൂബന്ദിലുമായി ഉപരിപഠനം പൂർത്തിയാക്കി. വെല്ലൂർ ബാഖിയാത്തിൽ അധ്യാപകനായിട്ടുണ്ട്. പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ പൊട്ടച്ചിറ അൻവാരിയ അറബിക് കോളെജ്, തമിഴിനാട്ടിലെ കായൽ പട്ടണം മഹ്ദറതുൽ ഖാദിരിയ്യ എന്നീ സ്ഥാപനങ്ങളിൽ അധ്യാപകനായും പ്രധാനാധ്യാപകനായും സേവനമനുഷ്ടിച്ചു. 1958ൽ സമസ്ത കേരള ജംഇയ്യതുൽ ഉലമയുടെ മുശാവറ അംഗം, 1971ൽ സമസ്ത കേരള ജംഇയ്യതുൽ മുഅല്ലിമീൻ പ്രസിഡൻ്റ്, 1976ൽ മുഅല്ലിം ക്ഷേമനിധി ചെയർമാൻ എന്നീ സ്ഥാനങ്ങൾ വഹിച്ചു. 'അൽ മുഅല്ലിം' മാസികയുടെ പത്രാധിപരായിരുന്നു. അറബിയിലും മലയാളത്തിലും നിരവധി ലേഖനങ്ങളെഴുതിയിട്ടുണ്ട്. 'ഹാശിയതു ഫത്ഹിൽ മുൽഹി. അലാ ഫത്ഹിൽ മുള്ളൻ', 'സുറയുന്നൂർ അറബി മലയാളം വ്യാഖ്യാനം' എന്നീ ക്യതികളുടെ കർത്താവാണ്. 
                                    .പിതാവ് കക്കാടംപറമ്പിൽ കുഞ്ഞുമുഹമ്മദ്, മാതാവ് ആഇശ ഉമ്മ.`,
      },
      {
        title: " മരണം",
        content: ". 1995 ഫെബ്രുവരി 6ന് മരണം.",
      },
    ],
  },
  {
    name: " സി.എം. മുഹമ്മദ്‌ അബൂബക്കർ മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "Year-Month-Day",
    description: "Short description of the scholar.",
    articles: [
      {
        title: "Article Title 1",
        content: "Content of the article.",
      },
    ],
  },
  {
    name: "Scholar 2",
    born: "1340/03/12",
    death: "1441 /10/04",
    description: ` കേരളീയ ആദർശ ചരിത്രത്തിൽ അനല്പമായ പ്രാധാന്യമർഹിക്കുന്ന എസ് വൈ എസ് എറണാകുളം സമ്മേളനം ഇവിടെ ഏറെ പ്രസ്‌താവ്യമാണ്. രാഷ്ട്രീയ തൽപരരായ ചില കുബുദ്ധികളുടെ നിരന്തരമായ കുതന്ത്രങ്ങൾ മൂലം ഏറെ ആകുലതകൾ നേരിട്ട പ്രസ്‌തുത സമ്മേളന പശ്ചാത്തലത്തിൽ ആവലാതിയുമായി സംഘാടകർ എ പി ഉസ്താദിനൊപ്പം ശൈഖുനക്കരികിലെത്തി. ആഗമനോദ്ദേശം ആരായും മുന്നേ "നിങ്ങൾ എറണാകുളത്ത് പോവുക സമ്മേളനം വിജയിച്ചിരിക്കുന്നു"വെന്ന പ്രവചനാത്മകമായ ആശീർവാദമാണ് സംഘാടകരെ വരവേറ്റത്. വിമർശനങ്ങളെ നിശേഷം കാറ്റിൽ തള്ളി സമ്മേളനം പ്രതീക്ഷിച്ചതിലുപരിയായ വിജയമായിരുന്നു. അവസാന കാലം കോഴിക്കോട് മമ്മൂട്ടി മൂപ്പൻ്റെ വസതിയിലായിരുന്നു. ആശയറ്റ ആബാലവൃദ്ധം ജനങ്ങൾ ആവശ്യങ്ങളോതി അനുദിനം ആ സന്നിധിയിലെത്തി. നിസ്‌തുലമായ അനവധി കറാമത്തുകൾക്കുടമയായിരുന്ന മഹാൻ മാറാവ്യാധികളുമായി അരികെയെത്തിയ ആയിരങ്ങൾക്ക് "അതുവേണ്ട യെന്ന ഒരു വാക്കിൽ ശമനം പകർന്നു.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `ഇലാഹീ അനുരാഗത്തിന്റെ അനന്തവിഹായസ്സിലേക്ക് അനേകം വിശ്വാസികളെ വഴിതെളിച്ച് ജീവിത വിശുദ്ധിയിലൂടെ ആദ്ധ്യാത്മികതയുടെ അകം തൊട്ട ആത്മജ്ഞാനിയായിരുന്നു "സി എം വലിയുള്ളാഹി " എന്നറിയപ്പെട്ട സി എം മുഹമ്മദ് അബൂബക്കർ മുസ്ലിയാർ.
      മടവൂർ കുഞ്ഞി മാഹിൻ കോയ മുസ്ലിയാരുടെയും പെരിയട്ടിച്ചാലിൽ ഇമ്പിച്ചി മൂസയുടെ പുത്രി ആയിശ ഹജ്ജുമ്മയുടെയും മകനായി ഹിജ്റ 1340 റബിഉൽ അവ്വൽ 12 നാണ് മഹാനുഭാവൻ്റെ ജനനം.
      അവിടത്തെ ഗർഭധാരണ പശ്ചാത്തലത്തിൽ ഹജ്ജിനു പുറപ്പെട്ട പിതാവ് കുഞ്ഞി മാഹീൻ കോയ മുസ്ലിയാർക്ക് വിശുദ്ധ മക്കയിൽ വെച്ച് സ്വപ്‌നദർശനമുണ്ടായി.പ്രിയ ഗർഭം ധരിച്ചതായും പ്രസവിച്ചാലുടൻ കുഞ്ഞിന് 'മുഹമ്മദ് അബൂബക്കർ' എന്ന് നാമകരണം ചെയ്യേണ്ടതായുമായിരുന്നു ആ സ്വപ്‌നസന്ദേശം.ഏറെകാലത്തെയഭിലാഷം പൂവണിഞ്ഞിരിക്കുന്നു.നാടണഞ്ഞയുടൻ ഖാദിരിയ്യ ത്വരീഖത്തിന്റെ ശൈഖായിരുന്ന മുഹമ്മദ് അബൂബക്കർ അൽ ഹസനിയുമായി പിതാവ് സ്വപ്‌ന വിവരം പങ്കുവെച്ചു.സ്വപ്‌നം യാഥാർത്ഥ്യമെന്ന് പ്രസ്താവിച്ച മഹാൻ പിറക്കാനിരിക്കുന്ന കുഞ്ഞിൻ്റെ അസാധാരണത്വം പ്രവചിക്കുകയും ചെയ്തു.
      ഹൃദയത്തെ ഇലാഹി ചിന്തയിൽ നിന്നും അകറ്റി നിർത്തുന്ന വിനോദങ്ങളിൽ നിന്നും അനാവശ്യ കൂട്ടുകെട്ടിൽ നിന്നും പാടെ പുറംതിരിഞ്ഞിരുന്ന ബാല്യകാലം.പിതൃവ്യർ നെടിയാട് നിന്നും മടവൂരിലേക്ക് താമസം മാറിയവരായിരുന്നു.പണ്ഡിതശ്രേഷ്‌ഠരും ഉജ്ജ്വല വാഗ്മിയും ഖാളിയുമായിരുന്ന പിതാമഹൻ കുഞ്ഞു മാഹിൻ മുസ്‌ലിയാരിൽ നിന്നാണ് പ്രാഥമിക പഠനം.ശേഷം മടവൂർ, കൊടുവള്ളി, മങ്ങാട്, കൊയിലാണ്ടി എന്നിവിടങ്ങളിൽ നിന്ന് മതപഠനവും ശേഷം തളിപ്പറമ്പ് ഖുവ്വത്തുൽ ഇസ്ലാമിലും വെല്ലൂർ ബാഖിയാത്തുസ്സ്വാലിഹാത്തിലുമായി ഉപരി പഠനവും പൂർത്തിയാക്കി.അറിവന്വേഷകനായി ജ്ഞാന സപര്യ തീർത്ത മഹാൻ അക്കാലത്തെ പ്രസിദ്ധരായ അനേകം പണ്ഡിത ശ്രേഷ്ഠരിൽ നിന്ന് വിജ്ഞാനം നുകർന്നു.മോങ്ങം അവറാൻ മുസ്ലിയാർ, മലയമ്മ അബൂബക്കർ മുസ്ലിയാർ, കുറ്റിക്കാട്ടൂർ ഇമ്പിച്ചാലി മുസ്ലിയാർ, ഇ കെ അബൂബക്കർ മുസ്ലിയാർ, ശൈഖ് ആദം ഹസ്രത്ത്, ശൈഖ് ഹസൻ ഹസ്റത്ത്, കൊയിലാണ്ടി കുഞ്ഞി മുഹമ്മദ് മുസ്ലിയാർ തുടങ്ങിയവർ ഗുരുവര്യരിൽ പ്രധാനികളാണ്.
      വെല്ലൂരിൽ നിന്ന് ഉപരിപഠനാനന്തരം നാട്ടിലേക്കു തിരിച്ച മഹാൻ സ്വദേശമായ മടവൂരിൽ ദർസാരംഭിക്കുകയും പ്രദേശത്തെ ഖാളിയായി നിയോഗിക്കപ്പെടുകയും ചെയ്‌തു.ശിഷ്യരായി തൻ്റെ കീഴിലന്ന് നൂറോളം വിദ്യാർത്ഥികളുണ്ടായിരുന്നു.നിമിഷാർദ്ധങ്ങളെ അശേഷം പാഴാക്കാതെ അതീവ സൂക്ഷ്‌മതയോടെ വിനിയോഗിച്ച ശൈഖുന അധ്യാപനം കഴിഞ്ഞാലുടൻ തന്റെ ആരാധനാ കാര്യങ്ങളിൽ നിമഗ്നനാകും.അധ്യാപന കാലത്ത് ചെറിയ ശമ്പളമൊക്കെ കൈപ്പറ്റിയിരുന്നെങ്കിലും അവ നിശേഷം തന്റെ വിദ്യാർത്ഥികൾക്കും മറ്റുമായി ചിലവഴിക്കാറായിരുന്നു പതിവ്.വൃത്തിയുള്ള വസ്ത്രം ധരിക്കാനും ശുചിത്വം ശീലമാക്കാനും തന്റെ ശിഷ്യഗണങ്ങളെ സദാ ഉപദേശിക്കുകയും ചെയ്തു.അധ്യാപന ജീവിതത്തിനിടക്ക് ഒരുവേള മഹാൻ ഹജ്ജിനു പുറപ്പെടുകയുണ്ടായി.പ്രസ്‌തുത യാത്രാവേളയിലും ഹജ്ജ് കർമങ്ങൾക്കിടയിൽ വെച്ചും മഹാനുഭാവനിൽ നിന്ന് അനിതരസാധാരണമായ അനേകം അൽഭുതങ്ങൾ ദർശിക്കാനായതായി അനുഭവസ്ഥർ സാക്ഷ്യപ്പെടുത്തുന്നു.
      ഹജ്ജാനന്തരം ഏറെ വ്യതിരിക്തമായ ജീവിത ചിട്ടകളോടെയാണ് മഹാനവർകളെ കാണപ്പെട്ടത്.തന്റെ കീഴിൽ പഠനം നിർവഹിച്ചിരുന്ന വിദ്യാർത്ഥികൾക്ക് യോജ്യമായ മറ്റിടങ്ങൾ തരപ്പെടുത്തിക്കൊടുത്ത് പിന്നീടുള്ള കാലം രിയാളകളിലും പ്രത്യേക ആരാധനാകർമങ്ങളിലുമായി കഴിഞ്ഞുകൂടുകയും ചെയ്‌തു.പകലഖിലം നോമ്പനുഷ്ഠിച്ചും രാത്രികാലങ്ങളിൽ പൂർണ്ണമായി നിസ്‌കാരം നിർവഹിച്ചും ജീവിതം ചിട്ടപ്പെടുത്തി.സൂചിത കാലത്ത് സച്ചരിതരായ മൺമറഞ്ഞ മഹാരഥന്മാരുടെ മസാറുകൾ തേടി ഏറെ നീണ്ട യാത്രകളുണ്ടായിട്ടുണ്ട്.യാത്രാവേളയിൽ വന്യജീവി സങ്കേതങ്ങളായ കൊടുംകാടുകളിൽ വരെ പലവുരു മഹാനവർകളെ കാണാനിടയായതായി അനുഭവസ്ഥർ പങ്കുവെക്കുന്നു.
      " മടവൂർ ദേശത്ത് ഖാസി സ്ഥാനത്തിരിക്കെ ഒരു പുത്തൻ വാദി ശൈഖുനയെ തൻറെ വീട്ടിലേക്ക് നിക്കാഹിന് ക്ഷണിച്ചു. മറുപുറം ചിന്തിക്കാതെ മഹാനവർകൾ നിരസിച്ചു. തുടർന്ന് ആക്ഷേപവും കുത്ത് വാക്കുകളുമായി ഭൗതികരായ ചിലർ എതിർപക്ഷത്ത് നിലയുറപ്പിച്ചെങ്കിലും അവിടുത്തെ കണിശമായ നിലപാടിനു മുന്നിൽ അവരും ശിരസ്സ് കുനിക്കുകയാണുണ്ടായത്.
      പുത്തൻ വാദ പ്രസ്ഥാനങ്ങളോടും ആദർശ വൈരികളോടും അണുമണി വിട്ടുവിഴ്‌ചയില്ലാത്ത സമീപനമായിരുന്നു.മടവൂർ ദേശത്ത് ഖാസി സ്ഥാനത്തിരിക്കെ ഒരു പുത്തൻ വാദി ശൈഖുനയെ തൻറെ വീട്ടിലേക്ക് നിക്കാഹിന് ക്ഷണിച്ചു.മറുപുറം ചിന്തിക്കാതെ മഹാനവർകൾ നിരസിച്ചു.തുടർന്ന് ആക്ഷേപവും കുത്തുവാക്കുകളുമായി ഭൗതികരായ ചിലർ എതിർപക്ഷത്ത് നിലയുറപ്പിച്ചെങ്കിലും അവിടുത്തെ കണിശമായ നിലപാടിനു മുന്നിൽ അവരും ശിരസ്സ് കുനിക്കുകയാണുണ്ടായത്.
      ഒരു പുരുഷായുസ്സ് മുഴുവൻ ആധ്യാത്മികതയുടെ അകം പൊരുളാവാഹിച്ച ആ ശ്രേഷ്‌ഠ ജീവിതം മരിക്കാത്ത സ്‌മരണയായി ഇന്നും ജനഹൃദയങ്ങളിൽ ജീവിക്കുന്നു.`,
      },
    ],
  },
  {
    name: " ഖുതുബി മുഹമ്മദ് മുസ്ലിയാർ",
    born: "1299",
    death: "1385/10/06",
    description:
      "കർമ്മശാസ്ത്രവിഷയത്തിൽ പ്രതിഭാശാലിയായിരുന്ന ഖുതുബി നൂതനമായ അനേകം പ്രശ്നങ്ങൾക്ക് ഫത്‌വ നൽകിയിട്ടുണ്ട്. നാദാപുരം കലന്തൻ മുസ്‌ലിയാർ, വാവൂർ മീരാൻകുട്ടി മുസ്ലിയാർ, മൗലാനാ കണ്ണിയത്ത് അഹ്മദ് മുസ്‌ലിയാർ, കൈപ്പറ്റ വീരാൻകുട്ടി മുസ്‌ലിയാർ, വണ്ടൂർ സ്വദഖത്തുള്ള മുസ്‌ലിയാർ, കടവത്തൂർ പോക്കർ മുസ്‌ലിയാർ, മേപ്പിലാശ്ശേരി മുഹ്യുദ്ദീൻ മുസ്‌ലിയാർ, കൊല്ലോളി അബ്‌ദുൾഖാദിർ മുസ്ലിയാർ, നെടിയിരുപ്പ് മരക്കാർ മുസ്‌ലിയാർ, കുനിങ്ങാടി കുഞ്ഞബ്‌ദുള്ള മുസ്ല‌ിയാർ, കുരിറ്റിപ്പറമ്പ് മോയിൻകുട്ടി മുസ്‌ലിയാർ തുടങ്ങിയ മഹാരഥന്മാർ ഖുതുബിയുടെ ശിഷ്യന്മാരിൽപ്പെട്ടവരാണ്.",
    articles: [
      {
        title: " ജീവിതം",
        content: `ഇപ്പോൾ എ.ആർ. നഗർ എന്ന പേരിൽ അറിയപ്പെടുന്ന കോടുവായൂരിലെ ചെപ്പിയാലം ഗ്രാമത്തിലെ ചെറുചാലിൽ അഹ്മദ് എന്നവരുടെ മകനായി ഹിജ്റ 1299 ലാണ് ഖുതുബി മുഹമ്മദ് മുസ്ല‌ിയാർ ജനിച്ചത്. ചെപ്പിയാലം പള്ളിയുടെ അടുത്താണ് ജന്മവീട്. സ്വദേശത്തു വെച്ചുള്ള പ്രാഥമിക പഠനത്തിനു ശേഷം തലക്കടത്തൂർ ജുമാമസ്‌ജിദിലെ ദർസിൽ ചേർന്നു പഠനമാരംഭിച്ചു. സ്വദഖത്തുള്ള മുസ്‌ലിയാരുടെ പിതാവായ പോക്കർ മുസ്ലിയാരായിരുന്നു മുദർറിസ്. ശേഷം തിരൂരങ്ങാടി തറമ്മൽ പള്ളി ദർസിൽ ചേർന്നു. ചാലിലകത്ത് കുഞ്ഞഹ്മദ്ഹാജി ആയിരുന്നു അവിടത്തെ ഗുരുനാഥൻ. അദ്ദേഹം തിരൂരങ്ങോടി ദർസ് ആരംഭിച്ചപ്പോൾ ഖുതുബിയും അദ്ദേഹത്തെ അനുഗമിച്ചു. പെരിങ്ങാടിയിൽ നിന്ന് കുഞ്ഞഹമ്മദാജി പുളിക്കലിലേക്ക് മാറിയപ്പോൾ സ്മര്യപുരുഷനും ഗുരുവിനെ പിന്തുടർന്നു. പ്രസിദ്ധമായ ഖിബ്‌ല പ്രശ്ന‌ം ഉദ്ഭവിക്കുന്നത് പുളിക്കൽ വെച്ചാണ്. അക്കാലത്ത് വലിയ ചെച്ചെപ്പാടുകളും, വാദപ്രതിവാദങ്ങളും അരങ്ങേറിയ ആ പ്രശ്ന‌ത്തിൽ ഭൂരിഭാഗം പണ്ഡിതരും കുഞ്ഞഹമ്മദ് ഹാജിയുടെ പക്ഷത്തായിരുന്നു. ഈ പ്രശ്ന‌ത്തെ തുടർന്നു പുളിക്കലിൽ നിന്നു മാറാൻ അദ്ദേഹം തിരുമാനിച്ചു. അങ്ങിനെ ഖാൻ ബഹാദൂർ കോയപ്പത്തൊടി മുഹമ്മദ്കുട്ടി അധികാരിയുടെയും, ചെറുശ്ശേരി അഹ്മദ് കുട്ടി മുസ്‌ലിയാരുടെയും ക്ഷണ പ്രകാരം വാഴക്കാട് തൻമിയ്യത്തുൽ ഉലും അറബിക് കോളേജിൽ അധ്യാപകനായി സ്ഥാനമേറ്റു. ഇന്ന് ദാറുൽ ഉലും എന്നാണ് ആ സ്ഥാപനത്തിൻ്റെ പേര് കൊയപ്പത്തൊടി അക്കാലത്ത് സ്ഥാപനത്തിന്റെ മാനേജറും, ചെറുശ്ശേരി പ്രധാന മുദർറിസുമായിരുന്നു. ഖുതുബി മുഹമ്മദ് മുസ്‌ലിയാർ അവിടെ വിദ്യാർത്ഥിയായി മുന്നു കൊല്ലത്തോളം താമസിച്ച ശേഷം ഉസ്താദിന്റെ സമ്മതപ്രകാരം 1331-ൽ പാനൂരിൽ ദർസ് ആരംഭിച്ചു. പതിനഞ്ചു വർക്കാലം അവിടെ സ്‌തുത്യർഹമായ നിലയിൽ സേവനം ചെയ്തു. പിന്നെ ദാറുൽ ഉലൂമിൽ പ്രിൻസിപ്പലായി ചാർജെടുത്തു. 1345-ൽ ആയിരുന്നു അത്. വൈത്തല അഹ്മദ്കുട്ടി മുസ്ല‌ിയാർ. ചാലിയപ്പുറം വലിയ മമ്മദ്കുട്ടി മുസ്‌ലിയാർ എന്നിവരായിരുന്ന അവിടത്തെ മറ്റു ഉസ്താദുമാർ. പിന്നീട് കുറച്ചുകാലം നാദാപുരത്തും, ശേഷം താനൂരിലും ദർസ് നടത്തി. താനൂരിൽ നിന്നും വിടപറഞ്ഞു, മുസ്‌ലിം സമൂഹത്തിൻ്റെ ദീനീ വിഷയത്തിലുള്ള പുരോഗതിക്കായി പൊതുപ്രവർത്തന ഗോദയിൽ ശ്രദ്ധ കേന്ദ്രീകരിച്ചു. തർക്ക വിഷയങ്ങൾ പരിഹരിക്കുന്നതിലും, ദിനി സ്ഥാപനങ്ങൾ പടത്തുയർത്തുന്നതിലും വിലപ്പെട്ട സംഭാവനകളാണ് ഖുതുബി സമർപ്പിച്ചത്. പെരിങ്ങാടിയിൽ ഓതിത്താമസിക്കുന്ന കാലത്താണ് വിവാഹിതനായത്. ചൊക്ലി കാട്ടിൽപീടികയിൽ അഹ്മദ് മുസ്ല‌ിയാരുടെ മകൾ മറിയം ആയിരുന്നു ഭാര്യ. അതിൽ മൂന്ന് ആൺമക്കളും, അഞ്ചുപെൺമക്കളുമുണ്ട്. പിന്നീട് പരപ്പനങ്ങാടി ചംബ കുഞ്ഞാലൻ എന്നവരുടെ മകൾ താത്തുമ്മയെ വിവാഹം ചെയ്‌തു. ആ ബന്ധത്തിലുണ്ടായ പുത്രനാണ് അബ്‌ദുർ റഹ്മാൻ മുസ്‌ലിയാർ. സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമായുടെ രൂപികരണ കാലഘട്ടത്തിൽ ഖുതുബിയായിരുന്നു അതിന്റെ മുഖ്യ കാര്യദർശി. സമസ്തയുടെ പലയോഗങ്ങളിലും അദ്ദേഹം ആദ്ധ്യക്ഷം വഹിച്ചിട്ടുണ്ട്
                                    .ചൊക്ലിയിലെ സ്വവസതിയിൽ ഹിജ്റ 1385- ൽ ശവ്വാൽ മാസത്തിലെ അവസാനത്തെ വെള്ളിയാഴ്ച രാവിലെയാണ് ആ പണ്ഡിത ജ്യോതിസ്സ് വഫാത്തായത്.വീട്ടിനടുത്ത് സ്വന്തമായി നിർമ്മിച്ച പള്ളിയുടെ സമീപത്ത് അന്ത്യവിശ്രമം കൊള്ളുന്നു.കടമേരി അരിക്കൽ അബ്‌ദുൾ റഹ്മാൻ മുസ്‌ലിയാർ, കൊടുവായൂർ സൈതലവിക്കോയ തങ്ങൾ, അബ്‌ദുറഹ്മാൻ അസ്‌ഹരിതങ്ങൾ തുടങ്ങിയപണ്ഡിതന്മാർ ആ മഹാനുഭാവനെക്കുറിച്ച് വിലാപകാവ്യങ്ങൾ എഴുതിയിട്ടുണ്ട്.`,
      },
    ],
  },
  {
    name: " ഹാജി കെ. മമ്മത് ഫൈസി",
    born: "Year-Month-Day",
    death: "1438/10/11",
    description:
      " സഹോദരനും സമസ്‌ത ജനറൽ സെക്രട്ടറിയുമായ കെ. ആലിക്കുട്ടി മുസ്‌ലിയാർ ഉൾപ്പെടെ പ്രമുഖ പണ്ഡിതരുടെ ദർസുകളിൽ മതപഠനം നടത്തിയ ശേഷം പട്ടിക്കാട്ട് ജാമിഅ നൂരിയയിൽനിന്നു ഫൈസി ബിരുദം നേടി. ശംസുൽ ഉലമാ ഇ.കെ. അബുബക്കർ മുസ്‌ലിയാർ, കോട്ടുമല അബുബക്കർ മുസ്‌ലിയാർ തുടങ്ങി സമുന്നത ഇസ്‌ലാമിക പണ്ഡിതർ ഗുരുനാഥൻമാരാണ്.",
    articles: [
      {
        title: " ജീവിതം",
        content:
          "മങ്കട പ്രമുഖ മത പണ്ഡിതനും എസ്‌വൈഎസ് സംസ്‌ഥാന ട്രഷററുമായ ഹാജി കെ. മമ്മത് ഫൈസി തിരൂർക്കാട്(68) നിര്യാതനായി. ഹൃദയ സംബന്ധമായ അസുഖത്തെ തുടർന്നു പെരിന്തൽമണ്ണ സ്വകാര്യ ആശുപത്രിയിൽ ചികിൽസയിലായിരുന്നു. ഇന്നു പുലർച്ചെ നാലിനാണു മരിച്ചത്. തിരൂർക്കാട് കുന്നത്ത് പരേതനായ മുസ ഹാജിയുടെ മകനാണ്. സമസ്‌ത കേരള ജംഇയ്യത്തുൽ ഉലമാ ജനറൽ സെക്രട്ടറി ആലിക്കുട്ടി മുസ്ലിയാർ മുത്ത സഹോദരനാണ്. സഹോ സമസ്ത‌ കേരള ഇസ്‌ലാം മത വിദ്യാഭ്യാസ ബോർഡ് എക്‌സിക്യുട്ടീവ് അംഗം, പട്ടിക്കാട് ജാമിഅ നുരിയ്യ സെക്രട്ടറി, സുപ്രഭാതം ദിനപത്രം ഡയറക്‌ടർ, സുന്നീ അഫ്‌കാർ വാരിക എക്‌സിക്യുട്ടീവ് ഡയറക്ടർ, പട്ടിക്കാട് എംഇഎ എഞ്ചിനീയറിങ് കോളജ് വൈസ് ചെയർമാൻ, കേരളാ പ്രവാസി ലീഗ് ചെയർമാൻ, സമസ്‌ത ലീഗൽ സെൽ സംസ്‌ഥാന ചെയർമാൻ, സമസ്‌ത മലപ്പുറം ജില്ലാ ജോ. സെക്രട്ടറി തുടങ്ങി വിവിധ പദവികൾ വഹിക്കുകയായിരുന്നു. തിരൂർക്കാട് അൻവാറുൽ ഇസ്ലാം ഇസ്‌ലാമിക് കോംപ്ലക്‌സ് ഉൾപ്പെടെ നിരവധി വിദ്യാഭാസ സ്‌ഥാപനങ്ങളുടെ പ്രധാന ഭാരവാഹിയും സംഘാടകനുമാണ്.",
      },
    ],
  },
  {
    name: " ഇ.കെ ഹസൻ മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1402/10/25",
    description: ` ജീവിത ചരിത്രം രചിക്കാൻ ആർക്കും കഴിയും പക്ഷേ ഒരു മഹാചരിത്ര ജീവിതത്തെ അർഹിക്കും വിധമുള്ള അർഥതലങ്ങളോടെ പകർത്താൻ പ്രയാസമാണ് . അഹ്ലു സുന്നയുടെ ആദർശ ഭൂമികയെ ആളിലും അർത്ഥത്തിലും സ്വജീവിതം കൊണ്ട് അടയാളപ്പെടുത്തിയ ഇ.കെ ഹസൻ മുസ്ലിയാരുടെ ജീവിതമാകുമ്പോൾ പ്രത്യേകിച്ചും
      പണ്ഡിതന്റെ നിർവചനങ്ങളേയും ജീവിതത്തിൽ നിർവഹിച്ചെടുത്ത സാത്വിക വ്യക്തിത്വം.ലാളിത്യത്തിന്റെ വിചാര ശീലുകളിൽ ആർശ കാർക്ഷത്തിന്റെ വീര ചരിത്രം രചിച്ച മഹാമനീഷി, ആത്മീയ പണ്ഡിത സമാജത്തിൽ സമാനതകളില്ലാത്ത സാന്നിധ്യമാണ്.
                              ബിദ്അത്തുകാർ സുന്നികൾക്കിടയിൽ ആശയക്കുഴപ്പം സൃഷ്ടിക്കാൻ ശ്രമിച്ചത് അറിഞ്ഞാൽ അതെവിടെയാണങ്കിലും എത്ര ത്യാഗം സഹിച്ചും ഇ.കെ ഹസൻ മുസ്ലിയാർ അവിടെ ഓടിയെത്തുമായിരുന്നു.സത്യം തുറന്നു പറയുന്നതിൽ മുഖം നോക്കുന്ന സ്വഭാവക്കാരനായിരുന്നില്ല.എന്ത് ആനുകൂല്യം നൽകിയാലും സത്യം തുറന്നടിച്ച് പറയുന്നതിൽ നിന്ന് പിൻമാറില്ലായിരുന്നു.ധീരതയും വിനയും ഇബാദത്തും സമ്മേളിച്ച മഹദ് വ്യക്തിയായിരുന്നു.`,
    articles: [
      {
        title: " ജീവിതം",
        content:
          "   കോഴികോട് ജില്ലയിലെ പറമ്പിൽകടവിലെ പണ്ഡിത തറവാടായ എഴുത്തച്ചൻ കണ്ടി വീട്ടിൽ 1926 ജനിച്ചു .കോയട്ടി മുസ്ലിയാരാണ് പിതാവ് . മതാവ് ഫാത്തിമ ബീവി . പിതാവിൽ നിന്ന് പ്രാഥമിക പഠനം നടത്തി .ചെറുമുക്ക്‌, കോട്ടുമല, ഇടപ്പള്ളി ,തളിപ്പറമ്പ് ,പാറക്കടവ് എന്നിവിടങ്ങളിൽ ദർസിൽ പഠിച്ചു .വെല്ലൂർ ബാഖിയാത്തിൽ നിന്നും ബിരുദം നേടി .ഉരുളിക്കുന്ന് ,പുത്തുപാടം ,ഇരുമ്പുചോല  , പാലക്കാട്‌, കസർകോഡ് എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി . 1965 ൽ സുന്നി യുവജനസംഘത്തിന്റെ നേതൃനിരയിൽ വന്നു .അതിന്റെ വൈ .പ്രസിഡന്റായും 1976 ആഗസ്റ്റിൽ പ്രസിഡന്റായും തെരഞ്ഞെടുക്കപെട്ടു .1982 ആഗസ്റ്റ് 14 ന് വഫാത്തായി.",
      },
    ],
  },
  {
    name: " വേങ്ങര കോയ പാപ്പ",
    born: "Year-Month-Day",
    death: "11/05",
    description: `ജഡപിടിച്ച മുടി, നീണ്ടു വളര്‍ന്ന താടിമീശകള്‍, ചുണ്ടിനിരുവശവും ഒലിച്ചിറങ്ങുന്ന മുറുക്കാന്‍ ചണ്ടി. കോരിച്ചൊരിയുന്ന മഴയത്തല്ലാതെ ഒരിക്കല്‍പോലും നനയാത്ത വൃത്തിഹീനമായ ശരീരം. 'പിരാന്തന്‍ കുഞ്ഞയമ്മുദു' എന്ന് വേങ്ങരക്കാര്‍ കളിയാക്കി വിളിച്ചിരുന്ന കുഞ്ഞയമ്മുദുവിനെ പില്‍ക്കാലത്ത് 'താജുല്‍ ഔലിയ'യായി വാനോളം ഉയര്‍ത്താന്‍ സമസ്തക്കാര്‍ക്ക് മേല്‍പറഞ്ഞ യോഗ്യതകളൊക്കെ എമ്പാടും മതിയായിരുന്നു. പിരാന്തന്‍ കുഞ്ഞയമ്മുദു പിന്നീട് കോയപ്പാപ്പയായും മരണത്തിന് ശേഷം താജുല്‍ ഔലിയയായും പരിണമിക്കുമ്പോള്‍ അതിന് പിന്നില്‍ 'സമസ്ത'പണ്ഡിതന്മാരുടെ കരങ്ങളുണ്ടായിരുന്നു. പിരാന്തന്‍ കുഞ്ഞയമ്മുദു ഏതു നാട്ടുകാരനാണെന്ന് വേങ്ങരക്കാര്‍ക്കറിയില്ല. മറ്റത്തൂര്‍ സ്വദേശിയാണെന്ന് ചില പഴമക്കാര്‍ പറഞ്ഞ അറിവേ വേങ്ങരക്കാര്‍ക്കുള്ളൂ. വേങ്ങരയും മറ്റത്തൂരും ഈ ലേഖകന്റെ തൊട്ടടുത്ത പ്രദേശങ്ങളാണ്. പക്ഷെ കോയപ്പാപ്പാന്റെ ബന്ധുക്കള്‍ മറ്റത്തൂരിലും ഉള്ളതായി ഈ ലേഖകനറിയില്ല. ബന്ധുത്വവും പാരമ്പര്യവും ജീവചരിത്രവും സമസ്തക്കാര്‍ക്ക് 'വിലായത്തിന്' ഒരു തടസ്സവുമല്ല.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `വേങ്ങര വ്യാപാരി വ്യവസായി യൂണിറ്റ് പുറത്തിറക്കിയ 'കാഷ്' (കള്‍ച്ചറല്‍ ആന്റ് സോഷ്യല്‍ ഹിസ്റ്ററി) എന്ന പുസ്തകത്തില്‍ വേങ്ങരയുടെ ചരിത്രം പറയുന്ന കൂട്ടത്തില്‍ സ്വാഭാവികമായും കോയപ്പാപ്പയുംകടന്നുവരുന്നുണ്ട്. കോയപ്പാപ്പ ഒരിക്കലും കുളിച്ചതായി വേങ്ങരക്കാര്‍ കിട്ടില്ലെന്ന് പ്രസ്തുതപുസ്തകം പറയുന്നു. പിരാന്തന്‍ കുഞ്ഞയമ്മുദു കോയപ്പാപ്പയായതിന് പിന്നിലെ ഐതിഹ്യം 'കാഷ്'വിവരിക്കുന്നുണ്ട്. പിരാന്തന്‍ കുഞ്ഞയമ്മുദു ആരെക്കണ്ടാലും 'കോയാ' എന്നേ വിളിക്കാറുള്ളുവത്രേ.ആ വിളിയാണ് പിരാന്തന്‍ കുഞ്ഞയമ്മദുവിനെ പിന്നീട് കോയപ്പാപ്പയാക്കിയത്. കോയപ്പാപ്പ ശേഷം'താജുല്‍ ഔലിയ' ആയതിന് പിന്നിലെ ഐതിഹ്യമാകട്ടെ നമുക്ക് വ്യക്തമാണ്താനും. ചോദിക്കാനും പറയാനും ആരുമില്ലാത്ത വട്ടന്മാരെപിടിച്ച് 'ഔലിയ'യാക്കുന്നതിലൂടെ തങ്ങള്‍ക്ക് വരുമാനം എമ്പാടും ലഭിക്കുമെന്ന 'സമസ്ത' പണ്ഡിതന്മാരുടെ കണ്ടെത്തല്‍ കേരളക്കരയില്‍ നിരവധി 'ഔലിയാക്കളെ' സൃഷ്ടിച്ചിട്ടുണ്ടല്ലോ. വേങ്ങര കോയപ്പാപ്പയുടെ ഒരു ഏകദേശ രൂപം 'കാഷ്' വിവരിക്കുന്നത് കാണുക. ''അഴുക്ക് പുരണ്ട് മുഷിഞ്ഞു മാത്രമേ മൂപ്പരെ കണ്ടിട്ടുള്ളൂ. മഴ നനയുമ്പോഴല്ലാതെ ആ ശരീരത്തില്‍ വെള്ളം വീഴാറില്ല. ഉടുവസ്ത്രങ്ങള്‍ ഊരാറില്ല. കഴുകാറില്ല, കുപ്പായങ്ങള്‍ ഒന്നിലേറെ ഉള്ളതുകൊണ്ട് നന്നേ അടിയിലുള്ളത് എപ്പോഴും വിയര്‍പ്പില്‍ മുങ്ങിയിരിക്കും. അത് ക്രമേണ പൊടിഞ്ഞുകീറും. മുഷിഞ്ഞുകീറിയ കുപ്പായം മൂപ്പര്‍തന്നെ സമയാസമയങ്ങളില്‍ പൊട്ടിച്ചുമാറ്റി ദൂരെ എറിയും. ഇടക്കുനടക്കുന്ന ആ പ്രക്രിയ നിമിത്തമാണ് അരമുതല്‍ കഴുത്തുവരെയുള്ള കഥാനായകന്റെ മേനിഭാഗത്ത് അടിഞ്ഞുകൂടിയിരുന്ന അഴുക്ക് പോക്കിയിരുന്നത് എന്ന് ചില സൂക്ഷ്മ ദൃക്കുകള്‍ പറയുന്നു'' (കാഷ്: പേജ്. 23)ഇത്രത്തോളം വൃത്തികെട്ടരീതിയില്‍ നടന്നിരുന്ന ഈ മനുഷ്യന്‍ മരണപ്പെട്ടപ്പോള്‍ മയ്യിത്ത് നമസ്‌കാരത്തിന് നേതൃത്വം നല്‍കിയത് പാണക്കാട് മുഹമ്മദലി ശിഹാബ് തങ്ങളായിരുന്നുവെന്ന് മനസ്സിലാക്കുമ്പോള്‍ ഈ ബഹുമത സമൂഹത്തില്‍ മുസ്‌ലിംകളുടെ 'ഔലിയ' വിശ്വാസത്തെ പരിഹാസ്യമാക്കിയതില്‍ പണ്ഡിതന്മാര്‍ക്ക് എത്രത്തോളം പങ്കുണ്ടെന്ന് മനസ്സിലാവും. ഈ മനുഷ്യന്‍ വലിയ്യ്? ആയത് ഫര്‍ളുംസുന്നത്തും ഇടമുറിയാതെ അനുഷ്ടിച്ചതുകൊണ്ടായിരുന്നില്ല. പിന്നെയോ? അതും പ്രസ്തുത പസ്തകംതന്നെ പറയട്ടെ. ''ദിവ്യത്വവും അമാനുഷികതയുമൊന്നും കഥാനായകന് ഒരൊറ്റ നാള്‍കൊണ്ട്ലഭിച്ചതല്ല.
      2 വേങ്ങര കോയപ്പാപ്പ
      സമൂഹം ക്രമേണ മൂപ്പര്‍ക്കത് നല്‍കുകയായിരുന്നു.പൊലിമ ചാലിച്ചുചേര്‍ത്ത വര്‍ത്തമാനങ്ങളിലൂടെ, കഥകളിലൂടെയും(കാഷ്: പേജ്. 24)
     ഒരു വ്യക്തിക്കോ സമൂഹത്തിനോ സഭക്കോ നല്‍കാവുന്നതാണോ ഇസ്‌ലാമിലെ വിലായത്ത്? പ്രവാചകന്റെ ഹദീസുകള്‍ പഠിപ്പിക്കുന്നത് അല്ലെന്നാണ്.ശരീഅത്ത് നിയമങ്ങള്‍ അക്ഷരം പ്രതി പാലിക്കുക വഴി സുന്നത്തുകള്‍ അധികരിപ്പിച്ച് അല്ലാഹുവിലേക്കടുക്കുന്നവനാരോ അവനാണ് അല്ലാഹുവിന്റെ വലിയ്യ്.മേല്‍പറഞ്ഞ പിരാന്തന്‍ കുഞ്ഞയമ്മുദുവിനെപ്പോലെയുള്ളവരെ യല്ലാതെ അല്ലാഹുവിന്റെ കല്‍പനകള്‍പാലിക്കുന്ന വിലക്കുകള്‍ ലംഘിക്കാതിരിക്കുന്ന ഒരൊറ്റ വലിയ്യിനെപ്പോലും ഇവര്‍ക്ക് ഇന്ന് ഉയര്‍ത്തിക്കാണിക്കാനില്ല എന്നതാണ് ഖേദകരം.
     പിരാന്തന്‍ കോയാക്ക കഴിച്ച് ബാക്കിവെച്ച ഭക്ഷണങ്ങള്‍പോലും ആര്‍ത്തിപൂണ്ട് വാരിവലിച്ച് തിന്നാന്‍മല്‍സരിക്കുന്നവരെ തുടക്കത്തില്‍ വേങ്ങര നിവാസികള്‍ കണ്ടത് അരക്കിറുക്കന്മാരായാണ്.പക്ഷെ, അവിടെയും മാതൃക കാണിക്കാന്‍ മുഴുക്കിറുക്കന്മാരായ സമസ്ത മുസ്‌ലിയാരുട്ടികള്‍തന്നെ മുന്നോട്ട് വന്ന്ജനങ്ങളുടെ അറപ്പ് മാറ്റിക്കൊടുത്തു.വേങ്ങര കോയപ്പാപ്പയെ ഒന്ന് കണ്‍കുളിര്‍ക്കെകണ്ട് സങ്കടങ്ങളുംആവലാതികളും ബോധിപ്പിക്കാന്‍ അന്യദേശത്തുനിന്നുപോലും ഭക്തന്മാര്‍ വന്ന് മാസങ്ങളോളം കാത്തിരിക്കുമായിരുന്നുവത്രേ.വിശിഷ്ട ഭക്ഷണങ്ങളും മറ്റു പാരിതോഷികങ്ങളും അവര്‍ കോയപ്പാപ്പാക്ക് സമ്മാനമായി നല്‍കാറുമുണ്ടായിരുന്നുവത്രേ.സത്യത്തില്‍ ഭ്രാന്ത് സമസ്തക്കാര്‍ക്കാണോ അവര്‍ കൊണ്ടുനടക്കുന്ന ഔലിയാക്കള്‍ക്കാണോ എന്ന് സംശയിക്കത്തക്കരീതിയിലാണ് ഇവരുടെ ജീവിതം.സ്വന്തം പിഞ്ചുകുഞ്ഞുങ്ങള്‍ ദേഹത്തൊന്ന് മൂത്രമൊഴിച്ചാല്‍ അതിനെ അറപ്പോടുകൂടി കാണുന്നവര്‍ ഇത്തരം ഭ്രാന്തന്മാരുടെ ശിഷ്ട ഭക്ഷണം വിഴുങ്ങാനും അവരെ ചുംബിക്കാനും വേണ്ടി വന്നാല്‍ അവരുടെ വിസര്‍ജ്ജ്യം വരെ നക്കിത്തുടക്കാനും യാതൊരു മടിയും കാണിക്കാതെ മുമ്പോട്ടുവരുന്നത് കാണുമ്പോള്‍ മേല്‍സംശയം ന്യായമാണ്താനും.കോയപ്പാപ്പയുടെ കിറുക്ക് പിടിച്ച സംസാരങ്ങളും ചേഷ്ട കളും അമാനുഷിക രീതിയില്‍ വ്യാഖ്യാനിക്കാന്‍ തുടങ്ങിയതുമുതല്‍ ആരംഭിക്കുന്നു ഇദ്ദേഹത്തിന്റെ കറാമത്ത് പ്രചാരണങ്ങള്‍.കോയപ്പാപ്പയുടെ സംസാര ചേഷ്ടകളെക്കുറിച്ച് 'കാഷ്' വിവരിക്കുന്നത് കാണുക.''അതുപോലെ ആകാശത്തേക്ക് നോക്കി മൂപ്പര്‍ പിറുപിറുത്തിരുന്നത് അദൃശ്യരായ ജിന്നുകളോടും മലക്കുകളോടുമായിരുന്നുവത്രേ. 'ഠോ' എന്ന് പൊട്ടിച്ചിരുന്നത് അദൃശ്യരുമായുള്ള സംഭാഷണത്തിനിടക്ക്കയറി വരുന്ന ശപിക്കപ്പെട്ട ശൈതാനെ ഓടിക്കാനാണെന്ന് പറഞ്ഞ് പരത്തിയവരുമുണ്ട്' (കാഷ്: പേജ്.24)ഇത്തരം വിടുവായത്തങ്ങള്‍ കെട്ടി എഴുന്നള്ളിച്ച് ഒരു ഭ്രാന്തനെ 'ഔലിയാക്കളുടെ കിരീടം' എന്ന ഓമനപ്പേരിട്ട് ചില കുല്‍സിത താല്‍പര്യക്കാര്‍ മറ്റു മതസ്ഥര്‍ക്കിടയില്‍ പരിശുദ്ധ ഇസ്‌ലാമിനെ പരിഹാസ്യമാക്കുവാന്‍ തുനിഞ്ഞിറങ്ങുമ്പോള്‍ അതിനെ തടയിടേണ്ട പണ്ഡിത സയ്യിദന്മാര്‍ വളം വെച്ചുകൊടുക്കുകയാണ് ചെയ്തത്. ലോക മുസ്‌ലിംകളുടെ ആത്മീയ നേതാവ് (?) എന്ന് വിശേഷിപ്പിക്കപ്പെടുന്ന പാണക്കാട് മുഹമ്മദലി ശിഹാബ് തങ്ങളാണ് കോയപ്പാപ്പയുടെ മയ്യിത്ത് നമസ്‌കാരത്തിന് നേതൃത്വം നല്‍കിയതത്രേ! ഒരാള്‍ മരണപ്പെട്ടാല്‍ ആ മയ്യിത്ത് നമസ്‌കാരത്തിന് നേതൃത്വം നല്‍കുക എന്നത് തെറ്റൊന്നുമല്ല. പക്ഷെ, ഇതുപോലെ പല ഭ്രാന്തന്‍മാരും അനാഥരും മുമ്പും ശേഷവും മരണപ്പെട്ടിട്ടുണ്ടല്ലോ. ആ നമസ്‌കാരത്തിനൊന്നും നേതൃത്വം നല്‍കാന്‍ ഒരു സയ്യിദന്മാരും ഇതുവരെ മെനക്കെട്ട് കണ്ടിട്ടില്ല. പക്ഷെ ഇതൊരു കേവല ഭ്രാന്തനല്ലെന്നും നാളെ സമൂഹത്തിന് ആദരിച്ചുകൊണ്ട് നടക്കാനുള്ള ഒരു ഭ്രാന്തനാണെന്നും ഈ സയ്യിദന്മാര്‍ക്കും അറിയാതിരിക്കില്ലല്ലോ. അല്ലെങ്കിലും സമൂഹം പോകുന്ന വഴിക്ക് തെളിക്കാനുള്ള ഫത്‌വകള്‍ നല്‍കാനാണല്ലോ ഇരുസമസ്തയിലേയും പണ്ഡിതന്മാര്‍ക്ക് താല്‍പര്യം.
      മരണത്തിന് ശേഷം ലോകത്ത് ഇന്നുവരെ കേട്ടുകേള്‍വിപോലുമില്ലാത്ത ഒരു കറാമത്താണ് പ്രധാനമായും കോയപ്പാപ്പാക്കുമേല്‍ ചാര്‍ത്തപ്പെട്ടത്.ആ കറാമത്തെന്താണെന്ന് കാന്തപുരം 'സുന്നി'കളുടെപ്രസിദ്ധീകരണമായ സുന്നത്തുമാസികയില്‍നിന്നുതന്നെ നമുക്ക് വായിക്കാം.
      3 വേങ്ങര കോയപ്പാപ്പ
      ''കടുത്ത വരള്‍ച്ച, എവിടെയും വെള്ളത്തിന് ക്ഷാമം, വേങ്ങര നിവാസികളായ ഏതാനും ആളുകള്‍ തങ്ങളെ സമീപത്തെത്തി.കാര്യം ധരിപ്പിച്ചു. ''ഓ മഴയില്ല അല്ലേ'' എന്ന് പറഞ്ഞ് മൂപ്പര്‍ ഉടുതുണി പൊക്കി അങ്ങ് മൂത്രിച്ചു. ''ഇനി നിങ്ങള്‍ പോയിക്കൊള്ളൂ, മഴ ഉടന്‍ ഉണ്ടാകും'' ആശ്ചര്യം, അതാ വരുന്നു തകര്‍പ്പന്‍ മഴ''(സുന്നത്ത് മാസിക. 1995 ജനുവരി) അല്ലാഹുവിന്റെ റസൂല്‍ മഴയില്ലാതായപ്പോള്‍ കൈകള്‍ പൊക്കിപ്രാര്‍ത്ഥിച്ച് മഴ പെയ്ത സംഭവം ഹദീസുകളില്‍ കണ്ടിട്ടുണ്ട്.പക്ഷെ ഒരു ഭ്രാന്തന്‍ നിന്നു മൂത്രമൊഴിച്ചപ്പോള്‍ മഴ പെയ്തു എന്ന് ഉളുപ്പില്ലാതെ എഴുതി വിടാന്‍ സമസ്തക്കാര്‍ക്ക് മാത്രമേ തൊലിക്കട്ടി വരികയുള്ളൂ.നിന്നു മൂത്രിച്ച സംഭവം മുമ്പും ഉണ്ടായിട്ടുണ്ട് എന്നും സുന്നത്ത് മാസിക രേഖപ്പെടുത്തുന്നുണ്ട്.സമസ്ത പണ്ഡിതന്മാരുടെ കൂട്ടായ ആശിര്‍വാദവും പ്രചാരണവും ഇത്തരം വട്ടുകഥകള്‍ക്കുണ്ട്.ആരാരുമില്ലാത്ത പിരാന്തന്‍ കുഞ്ഞയമ്മുദു ഇന്ന് സമസ്തക്കാരുടെ സിയാറത്ത് കേന്ദ്രങ്ങളില്‍ പ്രധാനപ്പെട്ട ഒന്നാണെന്ന് നാം മനസ്സിലാക്കണം.ഏതായാലും 'കാഷ്' ല്‍ വേങ്ങര കോയപ്പാപ്പയുടെ ചരിത്രം എഴുതിയ വേങ്ങരക്കാരന്‍ ലേഖകന്‍ കോയപ്പാപ്പയെ ഒരു ദിവ്യപുരുഷനായി കാണുന്നില്ല എന്ന് ആശ്വസിക്കാം.നിരുപദ്രവകാരിയായ ഒരു പാവം മനുഷ്യന്‍ എന്നതിലപ്പുറം കോയപ്പാപ്പാക്ക് പ്രത്യേക പൊലിമ നല്‍കാനും ലേഖകന്‍ തയ്യാറാവുന്നില്ല.പക്ഷെ ഇങ്ങനെ ചിന്തിക്കുന്നവര്‍ വളരെ തുച്ഛമാണെന്നും പ്രസ്തുത ലേഖകന്‍ എഴുതുന്നുണ്ട്.ആ ലേഖനത്തില്‍ കോയപ്പാപ്പയുടെ ചരിത്രം അവസാനിക്കുന്നത് താഴെക്കാണുന്ന വരികളോടുകൂടിയാണ്. ''മറ്റത്തൂരില്‍നിന്നെത്തി മുണ്ടിയന്‍ തടത്തിന്റെ മാനസപുത്രനായി ജീവിച്ച് ഇപ്പോള്‍ ഇവിടെ ഈ മഖ്ബറയില്‍ അന്ത്യവിശ്രമം കൊള്ളുന്ന കഥാനായകന്‍ നാളെ പുതുതലമുറക്ക് ഒരു 'ലജന്റ്'(ഇതിഹാസം) ആയി മാറുമോ''(കാഷ് പേജ്. 25) നിന്നു മൂത്രമൊഴിച്ചപ്പോള്‍ മഴ പെയ്തു എന്ന് സമസ്തയുടെ പ്രസിദ്ധീകരണങ്ങള്‍ കോയപ്പാപ്പയെക്കുറിച്ച് പറയുന്നത് ഒരിക്കലും പരിഹാസ്യമായിട്ടല്ല, മറിച്ച് ഇതിഹാസമായിട്ടുതന്നെയാണ്.ഇതില്‍കൂടുതല്‍ ഒരു ഇതിഹാസമായി മാറാന്‍ ഒരു മനുഷ്യന് എങ്ങനെ സാധിക്കും.? മുജാഹിദുകള്‍ക്ക് സംശയം വേറെയാണ്.ഇത്തരം ഭ്രാന്തന്മാരുടെ മഖ്ബറയില്‍പോയി പ്രാര്‍ത്ഥിക്കുന്ന സമസ്തക്കാര്‍ തങ്ങളുടെ പ്രാര്‍ത്ഥന ആരാധനയല്ല എന്നാണ് സാധാരണ പറയാറുള്ളത്.പക്ഷെ മറ്റത്തൂര്‍കാരനായ പിരാന്തന്‍ കുഞ്ഞയമ്മുദു കോയപ്പാപ്പയായും ഇന്ന് താജുല്‍ ഔലിയയായും മാറിയിട്ടുണ്ടെങ്കില്‍ നാളെ ഇയാള്‍ക്ക് ഞങ്ങള്‍ ആരാധന തന്നെ ചെയ്യുമെന്ന് പറയാന്‍ സമസ്തക്കാര്‍ ധൈര്യം കാണിക്കുമോ? കേരളത്തില്‍ സമസ്തയുടെ പേരില്‍ പ്രവര്‍ത്തിക്കുന്ന അവസാനത്തെ കണ്ണി നിലനില്‍ക്കുംവരെ ഈ ചോദ്യത്തിന് പ്രസക്തിയുണ്ട്.`,
      },
    ],
  },
  {
    name: " കാളമ്പാടി മുഹമ്മദ് മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1432/11/15",
    description:
      " എട്ട് വർഷം സമസ്തയെ പക്വമായ നേതൃത്വത്തിൽ നയിച്ച നേതാവാണ് കാളമ്പാടി ഉസ്താദ് എന്ന പേരിൽ അറിയപ്പെടുന്ന കാളമ്പാടി മുഹമ്മദ് മുസ്‌ലിയാർ. വിവിധ സ്ഥാപനങ്ങളിൽ വിദ്യ അഭ്യസിക്കുകയും പകരുകയും ചെയത കാളമ്പാടി ഉസ്താദ് രണ്ട് തവണ ഹജ്ജ് കർമവും നിർവഹിച്ചു.",
    articles: [
      {
        title: " ജീവിതം",
        content: `1934 ൽ അരിക്കുന്നത്ത് അബ്ദുറഹ്മാൻ ഹാജിയുടെയും ആഇശയുടെയും മൂത്ത മകനായിട്ടാണ് ഇദ്ദേഹം ജനിക്കുന്നത്. അറിവിന്റെ പ്രാഥമിക പാഠങ്ങൾ ബാപ്പയിൽനിന്ന് തന്നെ നുകർന്ന ഇദ്ദേഹം പിന്നീട് മലപ്പുറത്തെ എയ്‌ഡഡ് മാപ്പിള സ്‌കുളിൽ ചേർന്നു. രാവിലെ പത്ത്‌മണിവരെ പുലാമന്തോൾ മമ്മുട്ടി മൊല്ലാക്കയിൽ നിന്ന് മതവിദ്യാഭ്യാസവും ശേഷം സ്‌കൂൾ പഠനവും എന്നതായിരുന്നു അദ്ദേഹത്തിൻ്റെ അന്നത്തെ ജീവിതരീതി.
      പിന്നീട് മലപ്പുറം, കുട്ടിലങ്ങാടി, വറ്റലൂർ, പരപ്പനങ്ങാടി തുടങ്ങിയ ദർസുകളിൽ പഠനം നടത്തിയ കാളമ്പാടി മുഹമ്മദ് മുസ്‌ലിയാർ ഫത്ഹുൽ മുഈൻ, അൽഫിയ, ജലാലൈനി, ശർഹു അഹ്‌ദീബ്, മുസ്‌ലിം, ഖുതുബി തുടങ്ങിയ ഗ്രന്ഥങ്ങളിൽ അവഗാഹം നേടി.നിരവധി പണ്ഡിതരുടെ ശിഷ്യത്വം നേടിയ ഇദ്ദേഹം കോട്ടുമല ഉസ്താദിൽ നിന്നാണ് ശർഹുൽ അകാഇദ്, ബൈളാവി, ബുഖാരി, ജംഅ്, മഹല്ലി തുടങ്ങിയ ഗ്രന്ഥങ്ങൾ സ്വായത്തമാക്കിയത്.നാട്ടിലെ പഠനത്തിനുശേഷം 1959ൽ വെലലൂർ ബാഖിയാതുസ്സാ ലിഹാതിൽ ഉപരിപഠനത്തിന് ചേരുകയും 1961ൽ ബിരുദം കരസ്ഥമാക്കുകയും ചെയ്തു.
      നാട്ടിലെത്തിയ ഇദ്ദേഹം അരിക്കോട് ജുമാമസ്‌ജിദിൽ മുദരിസായി ചേർന്നാണ് അധ്യാപന ജീവിതത്തിന് തുടക്കം കുറിക്കുന്നത്.വെറും ദർസ് മാത്രയായി അവിടെ 12 വർഷം കാളമ്പാടി ഉസ്താദ് സേവന നിരതനായി.തുടർന്ന് മൈത്ര, മുണടകുളം, കൊച്ചിനിക്കാട്, മുണ്ടുപറമ്പ്, നെല്ലിക്കുത്ത്, കിടങ്ങയം സ്ഥലങ്ങളിൽ ഖാളിയായും മുദരിസായും സേവനമനുഷ്ഠിച്ചു.നീണ്ട 36 വർഷം ഈ രംഗത്ത് തുടർന്ന അദ്ദേഹം 1999 ൽ ജാമിഅ നൂരിയ്യയിൽ ചേർന്നു.
      1959 ൽ മുണ്ടേൽ അഹ്മദ് ഹാജിയുടെ മകളെ വിവാഹം ചെയ്ത കാളമ്പാടി ഉസ്താദിന് ആറ് ആൺമക്കളും അഞ്ച് പെൺമക്കളുമുണ്ട്. 2014 ൽ നിര്യാതനായി.`,
      },
    ],
  },
  {
    name: " പറവണ്ണ മുഹ്‌യിദ്ദീന്‍ കുട്ടി മുസ്‌ലിയാര്‍",
    born: "Year-Month-Day",
    death: "1376/11/29",
    description: `പണ്ഡിതന്‍, വാഗ്മി, എഴുത്തുകാരന്‍, വിദ്യാഭ്യാസ വിചക്ഷണന്‍ ബഹുഭാഷാ വിദഗ്ധന്‍ തുടങ്ങിയ നിലകളില്‍ തന്റേതായ ഇടം സമൂഹത്തില്‍ പ്രതിഫലിപ്പിച്ച അതുല്യ പ്രതിഭയായിരുന്നു പറവണ്ണ അബുല്‍ ബശീര്‍ കെ.പി.എ മുഹ്‌യിദ്ദീന്‍കുട്ടി മുസ്‌ലിയാര്‍. തികച്ചും പ്രതികൂലമായ സാഹചര്യത്തില്‍ ജനിക്കുകയും തന്റെ പ്രാഗത്ഭ്യം കൊണ്ടും അത്യദ്ധ്വാനം കൊണ്ടും ഇച്ഛാശക്തികൊണ്ടും സമുന്നതനായിത്തീരുകയും ഒരു സമൂഹത്തിന്റെ സമുദ്ധാരണത്തിന് വേണ്ടി തന്റെ കഴിവുകളെല്ലാം വിനിയോഗിക്കുകയും ചെയ്ത യുഗസ്രഷ്ടാവായിരുന്നു മഹാനവര്‍കള്‍.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `1898ല്‍ കുഞ്ഞവറാന്‍ മരക്കാരകത്ത് കമ്മത് ആലി, അയനിക്കാട് പറമ്പില്‍ കുട്ടിആയിശമ്മ എന്നിവരുടെ മകനായി പറവണ്ണയിലാണ് ജനിക്കുന്നത്. നാട്ടിലെ പ്രാഥമിക പഠനത്തിന് ശേഷം അവിടെയുണ്ടായിരുന്ന ദര്‍സില്‍ ചേരുകയും പിന്നീട് ചാലിലകത്ത് കുഞ്ഞഹമ്മദാജിയുടെ മണ്ണാര്‍ക്കാട് ദര്‍സിലും ശേഷം കൂട്ടായി ബാവ മുസ്‌ലിയാരുടെ കൂട്ടായി ദര്‍സിലും പഠനം പൂര്‍ത്തിയാക്കി. ശേഷം വെല്ലൂര്‍ ലത്വീഫിയ്യ അറബിക് കോളേജില്‍ ഒരു വര്‍ഷവും ബാഖിയാതില്‍ മൂന്ന് വര്‍ഷവും ഉപരി പഠനം പൂര്‍ത്തിയാക്കി. ബാഖവിയായി കേരളത്തിലെത്തിയത് മുതല്‍ വിദ്യാഭ്യാസ സാമൂഹിക നവോത്ഥാന മേഖലയില്‍ നവനവങ്ങളായ ചിന്തകളും പ്രവര്‍ത്തനങ്ങളുമായി മുേറുകയായിരുന്നു. 
       ജ്ഞാനപ്രസരണത്തില്‍ ദര്‍സ് രംഗം സജീവമായിരുന്ന അക്കാലത്ത് പുളിക്കല്‍, പെരിങ്ങത്തൂര്‍, പറമ്പത്ത്, പരപ്പനങ്ങാടി, താനൂര്‍, വാഴക്കാട് എിവടങ്ങളില്‍ നീണ്ട കാലം മുദരിസായി പ്രശോഭിച്ചു.സൂഫിവര്യന്‍ ചാപ്പനങ്ങാടി ബാപ്പു മുസ്‌ലിയാര്‍, സമസ്ത പ്രസിഡന്റായിരുന്ന കെ.കെ അബൂബക്ര്‍ ഹസ്രത്, കക്കോവ് എ.പി അഹ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, എ.പി ഇബ്രാഹീം മുസ്‌ലിയാര്‍ ചെമ്മലശ്ശരി, ജാമിഅ നൂരിയ്യ പ്രിന്‍സിപ്പളായിരുന്ന കെ.കെ അബ്ദുല്ല മുസ്‌ലിയാര്‍ കരുവാരക്കുണ്ട് തുടങ്ങിയവര്‍ ആ ഗുരുമുഖത്ത് നിന്ന് ജ്ഞാനം പകര്‍ത്തിയ ശിഷ്യരില്‍ പ്രമുഖരാണ്.
       സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമയുടെ സമുന്നത നേതാവായി സമൂഹത്തിന് സാരഥ്യം വഹിക്കുമ്പോഴും ജനങ്ങള്‍ക്കിടയില്‍ ഇറങ്ങിപ്രവര്‍ത്തിക്കാനും, വിദ്യാഭ്യാസ ബോര്‍ഡിലൂടെ വിജ്ഞാന പ്രസരണത്തിന് അവസരം സൃഷ്ടിക്കുവാനും മഹാനവര്‍കള്‍ക്ക് സാധിച്ചു.ചെറുപ്പത്തില്‍ പ്രത്യേക ട്യൂഷനിലൂടെ ഇംഗ്ലീഷ് ഭാഷയും പിന്നീട് അറബി, ഉര്‍ദു, തമിഴ്, ഫാരിസി ഭാഷകള്‍ വശമുണ്ടായിരുന്ന അദ്ദേഹം പരിണതപ്രജ്ഞനായ എഴുത്തുകാരന്‍ കൂടിയായിരുന്നു. 
       ഒരു പ്രതിഭയുടെ വളര്‍ച്ചക്ക് പിന്നില്‍ വര്‍ത്തിക്കുന്ന നിരവധി ഘടകങ്ങളില്‍ പ്രധാനമാണ് ഗുരുനാഥന്‍.കേരളത്തിലെ വിദ്യാഭ്യാസ സംവിധാനത്തില്‍ കരിക്കുലം സിസ്റ്റം കൊണ്ട് വന്ന ചാലിലകത്ത് കുഞ്ഞഹമ്മദാജിയുടെ ശിക്ഷണത്തില്‍ വളര്‍ന്നത് കൊണ്ട് തന്നെ മുഹ്‌യിദ്ദീന്‍കുട്ടി മുസ്‌ലിയാര്‍ക്ക് കേരളീയ പശ്ചാതലത്തില്‍ വിദ്യാഭ്യാസ മേഖലയില്‍ ചെറുതല്ലാത്ത സംഭാവനകള്‍ ചെയ്യാന്‍ സാധിച്ചിട്ടുണ്ട്. 
       ഇരുപതാം നൂറ്റാണ്ടു കണ്ട നവോത്ഥാന നായകരില്‍ മുന്‍ നിരയിലാണ് മുഹ്‌യിദ്ദീന്‍ മുസ്‌ലിയാരുടെ സ്ഥാനം.പഠന കാലം മുതലേ ഈ മേഖലയില്‍ പ്രവര്‍ത്തനങ്ങളെ ഏകീകരിക്കാന്‍ അദ്ദേഹത്തിന് സാധിച്ചു.ബാഖിയാതില്‍ പഠിക്കു കാലത്ത് മലയാളികള്‍ക്ക് ആദ്യമായി സാഹിത്യസമാജം രൂപീകരിച്ചതും അതിന്റെ പ്രഥമ പ്രസിഡന്റായി നിയമിതനായതും അദ്ദേഹമാണ്.ബാഖവി ബിരുദം നേടിയ ശേഷം നാട്ടിലെത്തി ഈ മേഖലയില്‍ കൂടുതല്‍ ശ്രദ്ധ കേന്ദ്രീകരിക്കാന്‍ സാധിച്ചു. 1928ല്‍ നാട്ടില്‍ ദര്‍സിന് വേണ്ടി ജുമുഅത്ത് പള്ളിക്ക് സമീപം മദ്‌റസതുൂരിയ്യ സ്ഥാപിക്കുകയും ആദ്യം ഒരു വര്‍ഷം വേതനരഹിതമായി അവിടെ ദര്‍സ് നടത്തുകയും ചെയ്തു.ഇരു നില കെട്ടിടത്തില്‍ ഒന്നാം നിലയില്‍ ദര്‍സ് ഹാളും, ലൈബ്രറിയും ഉസ്താദുമാരുടെ റൂമും, രണ്ടാം നിലയില്‍ വിദ്യാര്‍ത്ഥികള്‍ക്കുള്ള ഹോസ്റ്റല്‍ സൗകര്യവുമാണുണ്ടായിരുത്. 
       സമസ്ത കേരള ഇസ്‌ലാം മത വിദ്യാഭ്യാസ ബോര്‍ഡിന് കീഴില്‍ മദ്രസകള്‍ സ്ഥാപിതമാകുന്നതിന് മുമ്പ് തന്നെ മുഹ്‌യിദ്ദീന്‍ മുസ്‌ലിയാര്‍ സ്വന്തം നാട്ടില്‍ മദ്‌റസതുല്‍ ബനാത് എന്ന നാമത്തില്‍ മദ്രസ സ്ഥാപിക്കുകയും പെകുട്ടികള്‍ക്ക് പ്രത്യേകം സിലബസ് നിര്‍മ്മിച്ച് പഠനം ആരംഭിക്കുകയും ചെയ്തു.വിദ്യാഭ്യാസ ബോര്‍ഡിനു കീഴില്‍ മദ്രസകള്‍ക്ക് അംഗീകാരം നല്‍കാന്‍ തുടങ്ങിയപ്പോള്‍ രണ്ടാം മദ്രസയായി അംഗീകരിക്കപ്പെട്ടത് മദ്‌റസതുല്‍ബനാത് ആയിരുന്നു.
        സമസ്തയുടെ മദ്രസകളില്‍ പഠിപ്പിക്കുവാനുള്ള പുസ്തകങ്ങള്‍ ആദ്യകാലങ്ങളില്‍ തയ്യാറാക്കിയിരുന്നതും പരിശോധനയും പരീക്ഷയും നടത്തിയിരുന്നതും അധ്യാപകര്‍ക്ക് ട്രൈനിംഗ് നല്‍കുകയും ചെയ്തിരുന്നത് ഉസ്താദ് തെയായിരുന്നു. 1951ല്‍ സമസ്ത കേരള ഇസ്‌ലാം മത വിദ്യാഭ്യാസ ബോര്‍ഡ് രൂപീകരിക്കപ്പെടുമ്പോള്‍ അതിന്റെ പ്രഥമ പ്രസിഡന്റായി പറവണ്ണ ഉസ്താദിനെ നിയമിക്കുന്നതില്‍ രണ്ടഭിപ്രായമുണ്ടായിരുന്നില്ല.വിദ്യാഭ്യാസ രംഗത്തും സംഘടനാ രംഗത്തും തന്റെ ദീര്‍ഘ വീക്ഷണത്തില്‍ രൂപപ്പെടുത്തിയ പദ്ധതികള്‍ അദ്ദേഹത്തിന്റെ കാലശേഷവും സമ്പൂര്‍ണ്ണമായി നടപ്പിലാക്കാന്‍ ആര്‍ക്കും സാധ്യമായിട്ടില്ലെന്ന് മര്‍ഹൂം എം.എം ബശീര്‍ മുസ്‌ലിയാര്‍ അനുസ്മരിക്കുമായിരുന്നത്രെ. 
       മികച്ച പ്രഭാഷകനും തൂലികക്കുടമയുമായ മുഹ്‌യിദ്ദീന്‍ മുസ്‌ലിയാര്‍ പുത്തന്‍ വാദികളുടെ പേടിസ്വപ്നം കൂടിയായിരുന്നു.പ്രൗഢമായ വിഷയങ്ങള്‍ അയത്‌നലളിതമായി അവതരിപ്പിക്കാനുള്ള അദ്ദേഹത്തിന്റെ കഴിവ് വേറെത്തെയായിരുന്നു.എഴുത്തിലൂടെയും പ്രഭാഷണത്തിലൂടെയും പുത്തന്‍ ചിന്തകളിലേക്ക് തെിമാറിയവരെ തിരികെക്കൊണ്ടുവരാന്‍ സാധിച്ച പണ്ഡിതപ്രതിഭയാണ് പറവണ്ണ ഉസ്താദ്. 1945 ആഗസ്റ്റ് ഒന്നാം തിയ്യതിക്ക് ചേര്‍ന്ന മുശാവറ യോഗത്തില്‍ സമസ്തക്ക് കീഴില്‍ അറബിമലയാളത്തിലും, മലയാളത്തിലും മാസിക പ്രസിദ്ധീകരിക്കണമെന്ന് തീരുമാനിക്കുകയും പറവണ്ണയെ പത്രാധിപരായി തിരഞ്ഞെടുക്കുകയും ചെയ്തു.നൂറുല്‍ഇസ്‌ലാം എന്ന പേരില്‍ സ്വന്തമായി പ്രസിദ്ധീകരിച്ചിരുന്ന മാസികയിലും അല്‍ബയാനിലും അദ്ദേഹത്തിന്റെ പഠനലേഖനങ്ങള്‍ വന്നിട്ടുണ്ട്.ബിദഇകള്‍ക്കെതിരെ സുന്നീ സമൂഹത്തിന് രേഖകള്‍ വെച്ച് സംവദിക്കാന്‍ ഈ ലേഖനങ്ങള്‍ ഏറെ സഹായകമായിരുു.അറബി, ഉര്‍ദു, ഇംഗ്ലീഷ്, തമിഴ്, ഫാരിസി ഭാഷകള്‍ കൈകാര്യം ചെയ്തിരു അദ്ദേഹം നിരവധി ഗ്രന്ഥങ്ങളും രചിച്ചിട്ടുണ്ട്.
       സമസ്തയുടെ രണ്ടാമത്തെ ജനറല്‍ സെക്രട്ടറിയും വിദ്യാഭ്യാസബോര്‍ഡിന്റെ പ്രഥമപ്രസിഡന്റുമായി സമൂഹത്തിന് നേതൃത്വം നല്‍കിയ പറവണ്ണ മുഹ്‌യിദ്ദീന്‍ മുസ്‌ലിയാര്‍ പ്രസ്ഥാനത്തിന് സഞ്ചാരദിശ നിര്‍ണ്ണയിച്ച് കൊടുത്ത പ്രമുഖനാണ്.കാര്യവട്ടം സമ്മേളനത്തില്‍ വൈസ്പ്രസിഡന്റായി തിരഞ്ഞെടുക്കപ്പെട്ടാണ് പറവണ്ണ മുഹ്‌യിദ്ദീന്‍ മുസ്‌ലിയാര്‍ സമസ്തയുടെ നേതൃരംഗത്തേക്ക് കടുവത്.സമസ്തയുടെ പ്രവര്‍ത്തനം കൂടുതല്‍ സജീവമമാക്കുന്നതിന്റെ ഭാഗമായി ആ യോഗത്തില്‍ രൂപീകരിക്കപ്പെട്ട ഇശാഅത് കമ്മിറ്റിയുടെ കവീനറായും തിരഞ്ഞെടുക്കപ്പെട്ടത് അദ്ദേഹം തന്നെ. 1951ല്‍ നടന്ന വടകര സമ്മേളനത്തില്‍ വെച്ച് ചേര്‍ മുശാവറ യോഗത്തിലാണ് അദ്ദേഹം സമസ്തയുടെ ജനറല്‍ സെക്രട്ടറിയായി തിരഞ്ഞെടുക്കപ്പെടുന്നത്.വിദ്യാഭ്യാസ ബോര്‍ഡ് രൂപീകരണവുമായി ബന്ധപ്പെട്ട സജീവ ചര്‍ച്ചകള്‍ക്ക് ഈ സമ്മേളന വേദി സാക്ഷിയായി.പറവണ്ണ ഉസ്താദ് കവീനറായി തിരഞ്ഞെടുക്കപ്പെട്ട സമിതി മുന്‍കൈയ്യെടുത്ത് വിളിച്ച് ചേര്‍ത്ത വിദ്യാഭ്യാസ പ്രവര്‍ത്തകരുടെ യോഗമാണ് ബോര്‍ഡിന്റെ പ്രഥമ നിര്‍വ്വാഹക സമിതി. 
       1954 ഫെബ്രുവരി 6ന് താനൂരില്‍ നടന്ന മുശാവറ യോഗത്തില്‍ സമസ്തക്ക് കീഴില്‍ ഉത കോളേജ് വേണമെന്ന ആലോചന വരികയും അതിന് വേണ്ടി ഇസ്‌ലാഹുല്‍ഉലൂം അറബിക് കോളേജ് അതിന്റെ മാനേജിംഗ് കമ്മിറ്റിയില്‍ നിന്ന് ഏറ്റെടുക്കാന്‍ നിയമിച്ച സമിതിയുടെ കവീനറും സ്ഥാപനം തുടങ്ങിയപ്പോള്‍ അതിന്റെ മാനേജറും പറവണ്ണ ഉസ്താദായിരുു.
       ഒരേ സമയം സമസ്തയുടെ ജനറല്‍ സെക്രട്ടറി, വിദ്യാഭ്യാസ ബോര്‍ഡ് പ്രസിഡന്റ്, ഇസ്‌ലാഹുല്‍ഉലൂം മാനേജര്‍, അല്‍ബയാന്‍ പത്രാധിപര്‍, എന്നീ മേഖലയില്‍ സേവനം ചെയ്യാന്‍ അദ്ദേഹം തിരഞ്ഞെടുക്കപ്പെട്ടത് തന്റെ കഴിവുകള്‍ക്കുള്ള സാക്ഷ്യമാണ്.അനാരോഗ്യം കാരണം 1957 ഫെബ്രുവരിയില്‍ ചേര്‍ന്ന മുശാവറ യോഗത്തില്‍ ഈ പദവികളെല്ലാം ഒഴിഞ്ഞ പറവണ്ണയുടെ സ്ഥാനത്തേക്ക് വ്യത്യസ്ഥ പ്രമുഖരാണ് നിയോഗിക്കപ്പെട്ടത്.സമസ്ത സെക്രട്ടറിയായി മഹാനായ ശംസുല്‍ഉലമയും, വിദ്യാഭ്യാസ ബോര്‍ഡ് പ്രസിഡന്റായി അയിനിക്കാട് പി.ഇബ്രാഹീം മുസ്‌ലിയാരും, അല്‍ബയാന്‍ പത്രാധിപരായി കോട്ടുമല അബൂബക്ര്‍ മുസ്‌ലിയാരും ഇസ്‌ലാഹുല്‍ഉലൂം മാനേജറായി കൂറ്റനാട് കെ.വി മുഹമ്മദ് മുസ്‌ലിയാരും തിരഞ്ഞെടുക്കപ്പെടുകയുണ്ടായി.`,
      },
    ],
  },
  {
    name: " കോട്ടുമല അബൂബക്കർ മുസ്ലിയാർ ",
    born: "Year-Month-Day",
    death: "1407/12/05",
    description:
      "1956-ൽ പരപ്പനങ്ങാടി പനയത്തിൽ മസ്ജിദിൽ മുഖ്യ മുദർരിസ് (മത ഉപദേശകൻ) ആയി നിയമിതനായ അദ്ദേഹം 1963-ൽ സ്ഥാപിതമായ മലബാർ മേഖലയിലെ പ്രശസ്ത അറബിക് കോളേജായ പട്ടിക്കാട് ജാമിഅ നൂരിയ്യയുടെ സ്ഥാപകൻ മുദർരിസായിരുന്നു. 1977 മുതൽ 1987 വരെ ശംസുൽ ഉലമയും ഒപ്പം ഉണ്ടായിരുന്നു പതി മുസ്ലിയാർ തൻ്റെ വിമത വിരുദ്ധ പ്രവർത്തനത്തിൽ. 1951-ൽ സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമയുടെ മസുഹവര ബോർഡിൽ (കൺസൾട്ടേഷൻ ബോഡി) ചേരുകയും വിയോഗം വരെ ആ സ്ഥാനത്ത് തുടരുകയും ചെയ്തു..",
    articles: [
      {
        title: " ജീവിതം",
        content: `കുന്നാലി ഹാജി-ഫാത്തിമ ദമ്പതികളുടെ മകനായി 1918-ൽ മലപ്പുറത്തിനടുത്ത് പെരിങ്ങോട്ടുപുലം ഗ്രാമത്തിൽ ജനിച്ചു. ജന്മനാട്ടിൽ പ്രാഥമിക ക്ലാസുകൾ പഠിച്ച അദ്ദേഹം പിന്നീട് ക്ലാസിക്കൽ ഗ്രന്ഥത്തിൽ വിദഗ്ധനായ മൗലാന അബ്ദുൾ അലി മുസ്ലിയാരുടെ കീഴിൽ പരപ്പനങ്ങാടി പനയത്തിൽ ദർസെയിൽ (മസ്ജിദ് അധിഷ്ഠിത കോളേജ്) പോയി. 1943 ആയപ്പോഴേക്കും വെല്ലൂർ ബാഖിയാത്ത് സ്വാലിഹാത്തിൽ നിന്ന് ഇസ്ലാമിക് ക്ലാസിക്കൽ ഗ്രന്ഥത്തിൽ ബിരുദാനന്തര ബിരുദം പൂർത്തിയാക്കി. സമസ്ത മുശാവറ അംഗം കോമു ഉസ്താദിൻ്റെ മകൾ ഫാത്തിമയെയാണ് വിവാഹം കഴിച്ചത്. അദ്ദേഹത്തിന് രണ്ട് പെൺമക്കളും രണ്ട് ആൺമക്കളും ഉണ്ടായിരുന്നു. സമസ്തയുടെ സജീവ പ്രവർത്തകനും കടമേരി റഹ്മാനിയ്യ അറബിക് കോളേജ് പ്രിൻസിപ്പലുമായിരുന്ന പരേതനായ ശൈഖുനാ കോട്ടുമല ബാപ്പു മുസ്ലിയാരുടെ മകനാണ്.
      ബിരുദാനന്തര ബിരുദത്തിനു ശേഷം ഊർക്കം ഗ്രാമത്തിലെ കോട്ടുമലയിൽ മൂന്ന് വിദ്യാർത്ഥികളുമായി ദര്സെ(മസ്ജിദ് അധിഷ്ഠിത കോളേജ്) ആരംഭിച്ചു, പിന്നീട് എം എം ബഷീർ മുസ്ലിയാർ, ഇ കെ ഹസൻ മുസ്ലിയാർ തുടങ്ങിയ പുതിയ വിദ്യാർത്ഥികളുടെ വരവോടെ സ്ഥാപനം പ്രശസ്തമായി. 1956-ൽ പരപ്പനങ്ങാടി പനയത്തിൽ മസ്ജിദിൽ മുഖ്യ മുദർരിസ്(മത ഉപദേശകൻ) ആയി നിയമിതനായ അദ്ദേഹം 1963-ൽ സ്ഥാപിതമായ മലബാർ മേഖലയിലെ പ്രശസ്ത അറബിക് കോളേജായ പട്ടിക്കാട് ജാമിഅ നൂരിയ്യയുടെ സ്ഥാപകൻ മുദർരിസായിരുന്നു. 1977 മുതൽ 1987 വരെ ശംസുൽ ഉലമയും ഒപ്പം ഉണ്ടായിരുന്നു പതി മുസ്ലിയാർ തൻ്റെ വിമത വിരുദ്ധ പ്രവർത്തനത്തിൽ. 1951-ൽ സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമയുടെ മസുഹവര ബോർഡിൽ(കൺസൾട്ടേഷൻ ബോഡി) ചേരുകയും വിയോഗം വരെ ആ സ്ഥാനത്ത് തുടരുകയും ചെയ്തു. 1957 ഫെബ്രുവരി 23-ന് കേരളത്തിലെ ഏറ്റവും വലിയ സ്വകാര്യ വിദ്യാഭ്യാസ സ്ഥാപനമായ സമസ്ത കേരള മാതാ വിദ്യാഭ്യാസ ബോർഡിൻ്റെ ജനറൽ സെക്രട്ടറിയായി തിരഞ്ഞെടുക്കപ്പെടുകയും മരണം വരെ ആ സ്ഥാനത്ത് തുടരുകയും ചെയ്തു.`,
      },
      {
        title: " മരണം",
        content:
          "1987 ജൂലായ് 31-ന് അന്തരിച്ച അദ്ദേഹത്തെ അടുത്തുള്ള ജുമാ മസ്ജിദിൽ ഖബറടക്കി.",
      },
    ],
  },
  {
    name: " സയ്യിദ് അബ്ദുറഹ്മാൻ ബാഫക്കി തങ്ങൾ",
    born: "Year-Month-Day",
    death: "1393/12/13",
    description:
      "മുസ്ലിം ലീഗിന്റെയും സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമയുടെയും പ്രമുഖ നേതാവും കേരളത്തിലെ ഐക്യമുന്നണി സംവിധാനത്തിൻ്റെ ശില്പികളിൽ ഒരാളുമായിരുന്നു സയ്യിദ് അബ്ദുറഹ്മാൻ ബാഫഖി തങ്ങൾ (1905-1973). യമനിൽ നിന്നും കേരളത്തിലെത്തിയ 'ബാ ഫഖീഹ്' കുടുംബം പതിനെട്ടാം നൂറ്റാണ്ടിന്റെ തുടക്കത്തിലാണ് കേരളത്തിൽ സ്ഥിരാമസമാക്കിയത്r.",
    articles: [
      {
        title: " ജീവിതം",
        content: `കോഴിക്കോട് നഗരത്തിലെ പ്രമുഖ വ്യവസായ കുടുംബമായിരുന്നു തങ്ങളുടേത്. 1906 ഫെബ്രുവരി 19 ന് കൊയിലാണ്ടിയിലെ അബ്ദുൽ ഖാദർ ബാഫഖി തങ്ങൾ ഫാത്വിമ മുല്ലബീവി ദമ്പതികളുടെ മകനായി ബാഫഖി തങ്ങൾ പുതിയ മാളിയേക്കൽ തറവാട്ടിൽ ജനിച്ചു.
      പൊന്നാനിയിലെ പഠനത്തിനു ശേഷം 19-ാം വയസ്സിൽ അദ്ദേഹം കോഴിക്കോട്ടെ കയറ്റുമതി കച്ചവടത്തിലേക്കു തിരിഞ്ഞു. 1949-50 കാലഘട്ടത്തിൽ ബർമയിലെ റംഗൂണിലെ മുഗൾ സ്ട്രീറ്റിൽ 'ബാഫഖി ആൻഡ് കമ്പനി ആരംഭിച്ചു. അക്കാലത്തെ വൻകിട കയറ്റുമതി സ്ഥാപനങ്ങളിലൊന്നായിരുന്നു ഇത്.
      മുപ്പതാമത്തെ വയസ്സിൽ രാഷ്ട്രീയത്തിലേക്ക് കടന്നു. 1936 ൽ കോഴിക്കോട് കുറുമ്പനാട് മണ്ഡലത്തിലെ ഒരു അഖിലേന്ത്യാ മുസ്‌ലിം ലീഗ് സ്ഥാനാർഥിക്കെതിരെ പ്രചാരകനായാണ് ബാഫഖി തങ്ങൾ സജീവ രാഷ്ട്രീയത്തിലേക്ക് പ്രവേശിച്ചത്.പിന്നീട് 1938 ൽ ഇന്ത്യൻ യൂണിയൻ മുസ്ലിം ലീഗിൽ ചേർന്നു.അബ്ദുസത്താർ സേട്ട് പ്രസിഡണ്ടായിരുന്ന മലബാർ മുസ്‌ലിം ലീഗിൻ്റെ വൈസ് പ്രസിഡണ്ട് സ്ഥാനത്തേക്ക് തെരഞ്ഞെടുക്കപ്പെട്ടു.തെക്കേ മലബാറിലെ സമുദായ നേതാവായിരുന്ന പാണക്കാട് പൂക്കോയ തങ്ങളെ ലീഗിൽ ചേരാൻ പ്രേരിപ്പിക്കാനും സഹായിച്ചു.
      1956 ൽ കേരള സംസ്ഥാനം രൂപീകൃതമായപ്പോൾ സംസ്ഥാന മുസ്‌ലിം ലീഗ് പ്രസിഡണ്ടായി തെരഞ്ഞെടുക്കപ്പെട്ടു.അഖിലേന്ത്യാ പ്രസിഡണ്ട് മുഹമ്മദ് ഇസ്മാഈൽ സാഹിബിൻ്റെ മരണത്തെ തുടർന്ന് അഖിലേന്ത്യാ പ്രസിഡണ്ടുമായി.മുസ്‌ലിം ലീഗിൻ്റെ ദേശീയ പ്രസിഡണ്ട് ആയ ആദ്യത്തെ മലയാളിയും ബാഫഖി തങ്ങളായിരുന്നു.ആദ്യമായി മുസ്ല‌ിം ലീഗിന് കേരളത്തിൽ ഭരണ പങ്കാളിത്തം നേടിക്കൊടുത്ത 1967 ലെ കമ്യൂണിസ്റ്റ് സഖ്യത്തിൻ്റെ മുഖ്യശില്പികളിലൊരാളുമാണ് ബാഫഖി തങ്ങൾ.മത സാംസ്ക‌ാരിക രാഷ്ട്രീയ രംഗത്തെ സജീവ സാന്നിധ്യമായിരുന്നു തങ്ങൾ.സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമായുടെ കീഴിലുള്ള വിദ്യാഭ്യാസ ബോഡിന് രൂപം നല്ക്കുന്നതിലും പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ അറബിക്കോളേജ് സ്ഥാപിക്കുന്നതിലും നേതൃപരമായ പങ്ക് വഹിച്ചു.കേരള വഖ്ഫ് ബോഡിൻ്റെ രൂപീകരണ കാലം മുതൽ വഖ്ഫ് ബോഡ് അംഗമായിരുന്നു.തിരുരങ്ങാടി മുസ്‌ലിം യത്തീംഖാനയുടെ പള്ളിക്ക് തറക്കല്ലിട്ടത് ബാഫഖി തങ്ങളായിരുന്നു എന്നത് സ്മരണീയമാണ്.കേരള സംസ്ഥാന മുസ്‌ലിം ലീഗ് കമ്മിറ്റിയുടെ പ്രഥമ പ്രസിഡണ്ടായി ബാഫഖി തങ്ങളെ നിർദേശിച്ചത് പണ്ഡിതനായ ഒ.എം മൗലവിയായിരുന്നു.
      പയ്യോളിയിലും നടുവട്ടത്തും മണത്തലയിലും അങ്ങാടിപ്പുറത്തും തലശ്ശേരിയിലുമെല്ലാം വിവിധ കാലങ്ങളിൽ സാമുദായിക സംഘർഷങ്ങളും കലാപങ്ങളുമുണ്ടായപ്പോൾ ശരിതെറ്റുകൾ വേർതിരിക്കുന്നതിനപ്പുറം കലാപം ശമിപ്പിക്കുന്നതിന് മുഖ്യപരിഗണന നല്കി.അസാമാന്യ ധൈര്യത്തോടെ കലാപ മേഖലയിൽ കയറിച്ചെന്ന് സമാധാനപ്രവർത്തനങ്ങൾക്ക് ബാഫഖി തങ്ങൾ നേതൃത്വം കൊടുത്തിരുന്നു.
      13 ആൺ മക്കളും 7 പെൺമക്കളുമുണ്ട്.`,
      },
      {
        title: " മരണം",
        content:
          " ഇരുപതിലേറെ തവണ ഹജ്ജു കർമം നിർവ്വഹിച്ച അദ്ദേഹം അവസാന ഹജ്ജുവേളയിൽ 1973 ജനുവരി 19 ന് വെള്ളിയാഴ്ച മക്കയിൽ വെച്ചു മരണപ്പെട്ടു.",
      },
    ],
  },
  {
    name: " പാങ്ങിൽ അഹ്മദ് കുട്ടി മുസ്‌ലിയാർ",
    born: "Year-Month-Day",
    death: "1365/12/25",
    description: `സജീവ കോൺഗ്രസ്‌ പ്രവർത്തകനായിരുന്ന അദ്ദേഹം മലബാർ സമരാനന്തരം ബന്ധം ഉപേക്ഷിച്ച് മുസ്‌ലിം ലീഗിൽ സജീവമാവുകയായിരുന്നു. പഠന കാലത്തു തന്നെ സാഹിത്യ രംഗത്ത് മികവു തെളിയിച്ച പാങ്ങിൽ 23 ലധികം അറങ്ങി കുതികൾ രചിച്ചിട്ടുണ്ട്. അന്നഹ്ൽ വവിം, അൽയാനാഫി, തൽവീഹുൽ മന്ത്വില്, നള്‌മു അലാഖാത്തിൽ മജാസിൽ മുർസൻ, ഇബ്‌റാസുൽ മുഹ്‌യൽ, തുഹ്ഫത്തു അഹ്ബാബി തളിപ്പറമ്പ്, ഇസാലത്തുൽ ഖുറാഫാത്ത്, ഇസാഹത്തുൽ ഹംസ, അൽ മൻഹലുറവി, മവാഹി ബുൽ ജലിൽ, അന്നഫഹാത്തുൽ ജലില, താബുൽ വസാജൻ, അൽ ഫൈളുൽ മുൻജി, അത്തുഹ്ഫത്തു റബിയ്യ, അൽ ഖസ്വീദത്തുൽ ഖുത്‌വ്‌ബിയ്യ, അൽ ഫൈജുൽ മജീദ്, ഖസ്വീദത്തുത്ത ഹാനി, തൻബീഹുൽ ഗഫൂൽ, തൽബിഹുൽ അനാം, അൽ ഖൗലുസ്സീദ്, അൽഖൗലുൽ മുത്തസല്, ഹാശിയത്തുൻ അലാ മുഖദ്ദിമത്തി തുഹ് ഫത്തിൽ മുഹ്‌താജ്, ശറഹു ഖസ്വീദത്തി ജമർ മക്‌നുനി ഖസ്വീദത്തു തുഹ്‌ഫത്തി റബിയ്യ എന്നിവയാണ് പ്രധാന കൃതികൾ. അദ്ദേഹത്തിന്റെ ചേനകൾ മഞ്ചൂഅത്തുർറസാ ഇവിൽ മുല്ലവിയ്യ എന്ന പേരിൽ ചരിത്ര ഗവേഷകനായ സി.പി ബാസിത് ഹുദവി പ്രസിദ്ധീകരിച്ചിട്ടുണ്ട്.`,
    articles: [
      {
        title: " ജീവിതം",
        content: `കേരളത്തിലെ പ്രമുഖ പണ്ഡിതനും സമസ്ത കേരള ജംഇയ്യത്തുൽ ഉലമയുടെ സ്ഥാപകരിൽ പ്രധാനിയുമായിരുന്നു പാങ്ങിൽ അഹ്‌മദ് കുട്ടി മുസ്‌ലിയാർ. 1888 ൽ മലപ്പുറം ജില്ലയിലെ കുറുവ പഞ്ചായത്തിലെ പാങ്ങ് പ്രദേശത്താണ് അഹ്‌മദ് കുട്ടി മുസ്ലിയാർ ജനിച്ചത്. പിതാവ് ആറങ്ങോട്ട് പുത്തൻപീടികക്കൽ നൂറുദ്ദീൻ മാതാവ് പഴമടത്തിൽ തിത്തികുട്ടി കേരളത്തിൽ ഇസ്‌ലാമിക പ്രബോധനത്തിനെത്തിയ താബിഉകളിൽ പ്രമുഖനായ ഹബീബ് ബ്‌നു മാലികിൻ്റെ സന്താന പരമ്പരയായ മുല്ലവി കുടുംബമാണ് അദ്ദേഹത്തിൻറേത്. പ്രാഥമിക പഠനത്തിനു ശേഷം കട്ടിലശ്ശേരി അലി മുസ്‌ലിയാർ, കരിമ്പനക്കൽ അഹമ്മദ് മുസ്‌ലിയാർ, മടത്തൊടിയിൽ കാപ്പാട് മുഹമ്മദ് മുസ്‌ലിയാർ എന്നിവരുടെ കീഴിൽ ദർസ് പഠനം. തുടർന്ന് വെല്ലൂർ ബാഖിയാത്തു സ്വാലിഹാത്ത്, ലസ്വീഫിയ്യ എന്നിവിടങ്ങളിൽ ഉപരിപഠനവും നടത്തി. ശാഹ് അബ്ദുൽ വഹാബ് ഹസ്റത്ത്, അബ്ദുൽ ഖാദിർ ബാദ്ഷാ ഹസ്റത്ത്, ശൈഖ് അബ്ദുൽ ജബ്ബാർ ഹസ്‌റത്ത്, മുഹമ്മദ് ഹുസൈൻ ഖാൻ (ഫാരിസി ബാൻ), ശൈവ അബ്ദുറഹീം എന്നിവർ ഗുരുനാഥൻമാരായിരുന്നു. പഠനാനന്തരം പാങ്ങ് തുമുഅത്ത് പള്ളിയിൽ ദർസ് അധ്യാപനം തുടങ്ങി. മണ്ണാർക്കാട് മന്നിൽ ഉലും മദ്റസ, താനൂർ വലിയകുളങ്ങര പള്ളി, ഇസ്‌ലാഹുവ് ഇലും അറബി മദ്റസ, പടന്ന ജുമുഅത്ത് പള്ളി എന്നിവിടങ്ങളിലും ദർസ് നടത്തി. 
                അബ്ദുൽ ഖാദിർ ഫള്ഫരി, കാപ്പാട് കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാർ, താഴേക്കോട് കുഞ്ഞലവി മുസ‌ലിയാർ, ഇരുമ്പാലശ്ശേരി കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാർ, അരിപ്ര മുഹമ്മദ് കുട്ടി മുസ്‌ലിയാർ, തുതക്കൽ കുഞ്ഞാപ്പു മുസ്‌ലിയാർ, കുളപ്പുറം കുട്ടി ഹസൻ മുസ‌ലിയാർ, ഓമച്ചപ്പുഴ അബുബക്കർ മുസ്‌ലിയാർ, നിറമരുതൂർ ബീരാൻകുട്ടി മുസ്‌ലിയാർ, കരിങ്കപ്പാറ മുഹമ്മദ് മുസ്‌ലിയാർ, വെള്ളിയാമ്പുറം സെയ്താലി മുസ്‌ലിയാർ തുടങ്ങിയവർ ശിഷ്യ പ്രമുഖരാണ്. അധ്യാപനം, പ്രഭാഷണം. തുടങ്ങിയ മേഖലകളിൽ പ്രാശാഭിച്ചു നിൽക്കുമ്പോഴാണ് മലബാറിൽ ഖിലാഫത്ത് കുടിയാൻ പ്രസ്ഥാനങ്ങൾ ശക്തിപ്പെടുന്നത്. വൈകാതെ പ്രസ്ഥാനത്തിൻ്റെ പ്രഥമ പ്രവർത്തകരിലൊരാളായി അദ്ദേഹം മാറി. സമരാനുകൂലിയായതിനാൽ മണ്ണാർക്കാട്ടെ സേവനം അവസാനിപ്പിച്ചു. മലബാറിൻ്റെ വിവിധ ഭാഗങ്ങളിൽ ഖിലാഫത്ത് കോൺഗ്രസ് പ്രസ്ഥാനം ശക്തിപ്പെടുത്താൻ മുന്നിട്ടറങ്ങി. 1921 ജൂലൈ 24-ന് പുതുപൊന്നാനിയിൽ നടന്ന ഉലമാ സമ്മേളനത്തിൽ പങ്കെടുത്തു. 
                1921 ആഗസ്റ്റ് 16-ന് കലക്ടർ ഇ.എഫ് തോമസ് സമർപ്പിച്ച നിർബന്ധമായും അറസ്റ്റ് ചെയ്യപ്പെടേണ്ട 18 പേരുടെ ലിസ്റ്റിൽ അദ്ദേഹവും സഹോദരൻ അലവിക്കുട്ടി മുസ്‌ലിയാരും ഉൾപ്പെട്ടും സമരത്തിൻ്റെ നിയന്ത്രണം നഷ്ടപ്പെട്ടപ്പോൾ രഥം ശാന്തമാക്കാൻ അദ്ദേഹം മുന്നിട്ടിറങ്ങി. ആലി മുസ്‌ലിയാർ വിചാരണയെ നേരിട്ട് കൊലമരത്തിലേക്ക് നിങ്ങുകയും കെ.എം. മൗലവി നാടുവിടേങ്ങി വരികയും ചെയ്തപ്പോൾ അഹ്‌മദ് കുട്ടി മുസ്‌ല്യാർ ഒളിച്ചു നടന്ന് വഴിതെറ്റുന്ന സമര ഭടന്മാരെ പിടിച്ചുനിർത്താൻ ശ്രമിച്ചു കൊണ്ടിരുന്നു. മലബാർ സമരാനന്തരം നൂറ്റാണ്ടുകൾ പഴക്കമുള്ള താനൂർ വലിയകുളങ്ങര പള്ളിയിലെ മുദരിസായി പാങ്ങിൽ നിയമിക്കപ്പെട്ടു. 1924-ൽ ജന ദർസിന് ജൂസ്‌ലാഹുൽ ഉലും അറബി മദ്റസ എന്ന് നാമകരണം നടത്തി. മദ്റസയുടെ മാനേജറായും സ്വാർ മുദരിസായും അദ്ദേഹം തന്നെ പ്രവർത്തിച്ചു. സ്ഥാപനത്തിന് വേണ്ടി വെല്ലൂർ ബാഖിയാത്ത് മാതൃകയിൽ കെട്ടിടം നിർമിച്ചു. 1943 വരെ ഇസ്‌ലാഹു ഉല്യമിൽ സേവനം ചെയ്തു. പിന്നീടുള്ള അധ്യാപനം പടന്നയിലായിരുന്നു. 
                1925 ജൂൺ 1,2 തിയതികളിൽ കോഴിക്കോട് നടന്നെ കഐക്യസംഘത്തിൻ്റെ മുന്നാം വാർഷിക സമ്മേളനം മലബാറിലേക്കുള്ള പ്രസ്ഥാനത്തിൻ്റെ വരവറിയിച്ചു. അഹ്‌മദ് കോയ ശാലിയാത്തി, അച്ചിപ്ര കുഞ്ഞിമുഹമ്മദ് മുസ്ലിയാർ, പള്ളിപ്പുറം അബ്ദുൽഖാദിർ മുസ്‌ലിയാർ തുടങ്ങിയവരോടൊപ്പം പാങ്ങിലും പ്രതിരോധ നിരയിലേക്ക് എടുത്തുചാടി. വരക്കൽ മുല്ലക്കോയ തങ്ങളുടെ ആശിർവാദ ത്തോടെ ഐക്യസംഘത്തിൻ്റെ സമ്മേളനം നടന്ന കോഴിക്കോട് തന്നെ പണ്ഡിത സംഗമം വിളിച്ചു ചേർത്തു. കുറ്റിച്ചിറ ജുമുഅത്ത് പള്ളിയിൽ നടന്ന സംഗമത്തിൽ പണ്ഡിതൻമാർ സംഘടിക്കേണ്ട ആവശ്യകത ബോധ്യപ്പെടുത്തി പ്രസംഗിച്ചു. കേരള ജംഇയ്യത്തുൽ ഉലമാക്ക് രൂപം നൽകി. ഈ സംഘം ഒരു വർഷം പ്രവർത്തിക്കുകയും മലബാറിന്റെ വിവിധ ഭാഗങ്ങളിലായി അമ്മ പൊതുയോഗങ്ങൾ സംഘടിപ്പിക്കുകയും ചെയ്തു. ഇവയുടെയെല്ലാം മുഖ്യസുത്രധാരനും പ്രധാന പ്രവർത്തകനും പാങ്ങിൽ അഹ്‌മദ് കുട്ടി മുസ്‌ലിയാരായിരുന്നു. 1026 ജൂൺ 26 ശനിയാള കോഴിക്കോട് ജൂബിലി ടൗൺഹാളിൽ വെച്ച് സമസ്ത കോള രംഇയ്യത്തുൽ ഉലമാ എന്ന പുതിയ സംഘടന രൂപീകരിക്കപ്പെട്ടു. പ്രസിഡൻ്റ് സ്ഥാനത്തേക്ക് പാങ്ങിലിനെ നിർദേശിക്കപ്പെട്ടെങ്കിലും സാത്വികനും സയ്യിദമായ വരക്കൽ തങ്ങളെ ആ സ്ഥാനത്തേക്കിരുത്തി സമുദായത്തിന് മാതൃകയാവുകയായിരുന്നു. പ്രഥമ കമ്മിറ്റിയിലെ വൈസ് പ്ര സിഡൻറ് സ്ഥാനം വഹിച്ചിരുന്ന പാങ്ങിലിൻ്റെ തുടർന്നുള്ള ജീവിതം സമസ്തക്ക് സമർപിക്കപ്പെട്ടതായിരുന്നു. 
                1927 ഫെബ്രുവരി 7-ന് പാങ്ങിൽ അഹ്‌മദ് കുട്ടി മുസ്‌ലിയാരുടെ തളകമായ താനൂരിൽ സമസ്തയുടെ പ്രഥമ സമ്മേളനം നടന്നു. 1927 ഡിസംബർ 31-ന് മോളൂരിൽ നടന്ന രണ്ടാം സമ്മേള ത്തിൽ പാങ്ങിലായിരുന്നു അധ്യക്ഷൻ. മൂന്നാം സമ്മേളനം 1928 ജനുവരി 7-ന് ചെമ്മൻകുഴിയിലും നാലാം സമ്മേളനം 1930 മാർച്ച് 17-ന് മണ്ണാർക്കാടും അഞ്ചാം സമ്മേളനം 1931 മാർച്ച് 11-ന് വെള്ളിയഞ്ചേരിയിലും നടന്നു. 1932-ൽ വരക്കൽ മുല്ലക്കോയ തങ്ങൾ നിര്യാതനായതോടെ തൽസ്ഥാനത്തേക്ക് പാങ്ങിൽ തിരഞ്ഞെടുക്കപ്പെട്ടു. 1913 മാർച്ച് 5-ന് ഫറോക്കിൽ നടന്ന ആറാം സമ്മേളനം അദ്ദേഹം പ്രസിഡൻറായതിനു ശേഷമുള്ള പ്രഥമ സമ്മേളനമായിരുന്നു. ഫറോക്ക് സമ്മേളനത്തിനു ശേഷം 9 സമ്മേളനങ്ങൾ നടന്നു. 1945 മെയ് 27, 28 തീയതികളിൽ കാര്യവട്ടത്തു നടന്ന 16-ാം സമ്മേളനത്തിനുള്ള ഒരുക്കങ്ങൾക്കിടെയാണ് അദ്ദേഹം രോഗിയാവുന്നത്. മലബാറിലെ സാമൂഹിക രാഷ്ടീയ വിദ്യാഭ്യാസ മേഖലകളിൽ അദ്ദേഹം നിറഞ്ഞുനിന്നു. മഊനത്തുൽ ഇസ്‌ലാം സഭാ മാനേജറായും സേവനം ചെയ്തു. മലബാർ ടെക്സ്റ്റ് ബുക്ക് കമ്മിറ്റി, മദ്രാസ് പ്രൊവിൻഷ്യൽ ഹജ്ജ് കമ്മിറ്റി എന്നിവയിൽ അംഗമായിരുന്നു. സജീവ കോൺഗ്രസ്‌ പ്രവർത്തകനായിരുന്ന അദ്ദേഹം മലബാർ സമരാനന്തരം ബന്ധം ഉപേക്ഷിച്ച് മുസ്‌ലിം ലീഗിൽ സജീവമാവുകയായിരുന്നു. പഠന കാലത്തു തന്നെ സാഹിത്യ രംഗത്ത് മികവു തെളിയിച്ച പാങ്ങിൽ 23 ലധികം അറങ്ങി കുതികൾ രചിച്ചിട്ടുണ്ട്. അന്നഹ്ൽ വവിം, അൽയാനാഫി, തൽവീഹുൽ മന്ത്വില്, നള്‌മു അലാഖാത്തിൽ മജാസിൽ മുർസൻ, ഇബ്‌റാസുൽ മുഹ്‌യൽ, തുഹ്ഫത്തു അഹ്ബാബി തളിപ്പറമ്പ്, ഇസാലത്തുൽ ഖുറാഫാത്ത്, ഇസാഹത്തുൽ ഹംസ, അൽ മൻഹലുറവി, മവാഹി ബുൽ ജലിൽ, അന്നഫഹാത്തുൽ ജലില, താബുൽ വസാജൻ, അൽ ഫൈളുൽ മുൻജി, അത്തുഹ്ഫത്തു റബിയ്യ, അൽ ഖസ്വീദത്തുൽ ഖുത്‌വ്‌ബിയ്യ, അൽ ഫൈജുൽ മജീദ്, ഖസ്വീദത്തുത്ത ഹാനി, തൻബീഹുൽ ഗഫൂൽ, തൽബിഹുൽ അനാം, അൽ ഖൗലുസ്സീദ്, അൽഖൗലുൽ മുത്തസല്, ഹാശിയത്തുൻ അലാ മുഖദ്ദിമത്തി തുഹ് ഫത്തിൽ മുഹ്‌താജ്, ശറഹു ഖസ്വീദത്തി ജമർ മക്‌നുനി ഖസ്വീദത്തു തുഹ്‌ഫത്തി റബിയ്യ എന്നിവയാണ് പ്രധാന കൃതികൾ. അദ്ദേഹത്തിന്റെ ചേനകൾ മഞ്ചൂഅത്തുർറസാ ഇവിൽ മുല്ലവിയ്യ എന്ന പേരിൽ ചരിത്ര ഗവേഷകനായ സി.പി ബാസിത് ഹുദവി പ്രസിദ്ധീകരിച്ചിട്ടുണ്ട്. സമസ്തയുടെ കീഴിൽ അറബി മലയാളത്തിൽ അൽബയാൻ മാസികയും ആരംഭിച്ചു. 1929 ഡിസംബറിൽ മൗലാനാ പാങ്ങിൽ അഹ്‌മദ് കുട്ടി മുസ്‌ലിയാർ ചീഫ് എഡിറ്ററായി അൽബയാൻ പ്രഥമ ലക്കം പുറത്തിറങ്ങി. മൂന്ന് വിവാഹം കഴിച്ചിരുന്നു അഹമ്മദ്‌കുട്ടി മുസ്‌ലിയാർ കൊറ്റോത്ത് വീട്ടിൽ സൈതലവി ഹാജിയുടെ മകൾ ഖദീജയാണ് ഒന്നാം ഭാര്യ, വല്ലപ്പുഴ ബീരാൻകുട്ടി മുസ്‌ലിയാരുടെ മകൾ ഫാത്വിമയാണ് രണ്ടാം ഭാര്യ. ഇവരിൽ അദ്ദേഹത്തിന് നാലുമക്കളുണ്ടായി. പിന്നീട് പൊന്നാനിയിൽ നിന്ന് ഒരു വിവാഹംകൂടി അദ്ദേഹം ചെയ്തിരുന്നു.`,
      },
      {
        title: " മരണം",
        content: " ഹിജ്‌റ 1365 ദുൽഹിജ്ജ 25ന് (സിജു 1944) മരണപ്പെട്ടു.",
      },
    ],
  },
  {
    name: " വാവാട് കുഞ്ഞിക്കോയ മുസ്‌ലിയാർ",
    born: "Year-Month-Day",
    death: "1442/12/29",
    description:
      " വട്ടക്കുണ്ട്, കത്തറമ്മൽ, അടിവാരം, വെസ്‌റ്റ് കൈതപ്പൊയിൽ, കാക്കവയൽ കുന്നിക്കൽ, കാരാടി, നൂറാം തോട്, ചുരം രണ്ടാം വളവ്, മലയമ്മ, വെള്ളന്നൂർ തുടങ്ങിയ മഹല്ലുകളിലെ ഖാദിയായും പ്രവർത്തിച്ചു വരു കയായിരുന്നു. റിയാദ് കോഴിക്കോട് ജില്ലാ മുസ്‌ലിം ഫെഡറേഷൻറെ പാറന്നൂർ ഉസ്താദ് പണ്ഡിത പ്രതിഭ പുരസ്കാരം ലഭിച്ചിട്ടുണ്ട്..",
    articles: [
      {
        title: " ജീവിതം ",
        content: `പ്രമുഖ പണ്ഡിതനും സൂഫിവര്യനും സമസ്‌ത മുശാവറ അംഗവുമായ വാവാട് മൂന്നുക്കും പു റായിൽ പി.കെ. കുഞ്ഞിക്കോയ മുസ്‌ലിയാർ നിരവധി മഹല്ലുകളുടെ ഖാദി കൂടിയായിരുന്ന അദ്ദേഹം കേരളത്തിനകത്തും പുറത്തും ആത്മീ യ വേദികളിലെ നിറസ്സാന്നിധ്യമായിരുന്നു. വാവാട് മഹല്ല് കമ്മിറ്റി പ്രസിഡൻറ്, സൈനുൽ ഉലമ മെമ്മോറി യൽ അറബിക് കോളജ് പ്രിൻസിപ്പൽ, കൊടുവള്ളി സിറാജുൽ ഹുദ കമ്മിറ്റി അംഗം, കൊടുവള്ളി മുസ്ല‌ിം യതീംഖാന കമ്മിറ്റി അംഗം, മടവൂർ സി.എം മഖാം പ്രസിഡൻറ്, പരപ്പൻപോയിൽ റിയാക്റ്റൽ ഉലും മദ്റസ പ്രസിഡൻറ്, താമരശ്ശേരി റേഞ്ച് ഉപദേശക സമിതി ചെയർമാൻ തുടങ്ങി ഒട്ടേറെ മത സ്ഥാപനങ്ങളുടെ ഭാര വാഹിയായിരുന്നു.
      വട്ടക്കുണ്ട്, കത്തറമ്മൽ, അടിവാരം, വെസ്‌റ്റ് കൈതപ്പൊയിൽ, കാക്കവയൽ കുന്നിക്കൽ, കാരാടി, നൂറാം തോട്, ചുരം രണ്ടാം വളവ്, മലയമ്മ, വെള്ളന്നൂർ തുടങ്ങിയ മഹല്ലുകളിലെ ഖാദിയായും പ്രവർത്തിച്ചു വരു കയായിരുന്നു.റിയാദ് കോഴിക്കോട് ജില്ലാ മുസ്‌ലിം ഫെഡറേഷൻറെ പാറന്നൂർ ഉസ്താദ് പണ്ഡിത പ്രതിഭ പുരസ്കാരം ലഭിച്ചിട്ടുണ്ട്.അണ്ടോണ പുല്ലോറക്കുന്നുമ്മൽ പരേതനായ അബ്‌ദുറഹിമാൻറെയും ഖദീജയു ടെയും മകനായാണ് ജനനം.വാവാട് ജുമാ മസ്‌ജിദിൽ നടന്ന മയ്യിത്ത് നമസ്ക്‌കാരത്തിന് സമസ്ത പ്രസിഡ ൻറ് സയ്യിദ് ജിഫ്രി മുത്തു കോയ തങ്ങൾ നേതൃത്വം നൽകി.
                                    ഭാര്യ: ഫാത്തിമ.മക്കൾ: അബ്‌ദുറഹിമാൻ, റാലം, സഫിയ, സൽമ മുഹമ്മദ് ബാഖവി ഹൈതമി(മുദരിസ്, ടൂങ്ങാക്കാട് മഖാം), ബരീറ മരുമക്കൾ: താഹിറ, പരേതനായ ബാവ മുസ്‌ലിയാർ, ഉബൈദുല്ല ഫൈസി ആ ലുംതറ, അബ്‌ദുൽ സലാം മുസ്‌ലിയാർ വാവാട്, ഫാത്തിമ, ടി.വി.സി അബ്‌ദുസ്സമദ് ഫൈസി വാഴക്കാട്.`,
      },
    ],
  },
  {
    name: " കണ്ണിയത്ത് അഹ്മദ് മുസ്ലിയാർ",
    born: "Year-Month-Day",
    death: "1414/04/02",
    description:
      " ദാരിദ്ര്യം മൂലം അരവയർ പോലും നിറയ്ക്കാൻ കഴിയാതിരുന്ന ക്ഷാമകാലത്തും ആ വിദ്യാർഥി മതപഠനം മുടക്കിയില്ല. വാഴക്കാട് ദാറുൽ ഉലൂമിലേക്ക് അര മുണ്ടും തൊപ്പിയും ധരിച്ച് കയറിവന്നിരുന്ന ആ വിദ്യാർഥിയിൽ ചാലിലകത്ത് കുഞ്ഞഹമ്മദ് ഹാജിയെപ്പോലുള്ള ഗുരു നാഥന്മാർ ഒരു പണ്ഡിത വര്യനെ സ്വപ്നം കണ്ടു. ആ യുവാവാണ് പിന്നീട്, അണികൾ റഈസുൽ മുഹഖ്‌ഖിഖീൻ എന്ന് ആദരപൂർവം വിളിച്ച കണ്ണിയത്ത് അഹമ്മദ് മുസ്‌ലിയാരായി വളർന്നത്.",
    articles: [
      {
        title: " ജീവിതം ",
        content: `മരക്കാട്ടുപറമ്പിൽ അവറാൻ കുട്ടി മൊല്ലയുടെയും ചുള്ളിക്കാട്ടിൽ ഖദീജയുണ്ണിടെയും മകനായി കണ്ണിയത്ത് കുടുംബത്തിൽ 1900 ജനുവരി 17ന് തോട്ടക്കാട്ട് ജനനം. മാലിക് ദീനാറിൻ്റെകുടുംബ പരമ്പരയിൽപെട്ടതാണ് അഹമ്മദ് മുസ്‌ലിയാ രുടെ പൂർവപിതാമഹനെന്ന് പറയപ്പെടുന്നു. കുടുംബത്തിൽ നിന്ന് പ്രാഥമിക വിദ്യാഭ്യാസം നേടി. തുടർന്ന് തലപ്പെരുമണ്ണ, ഊരകം മൊറയൂർ, തുടങ്ങിയ ദറസുകളിൽ പഠനം. വാഴക്കാട് ദാറുൽ ഉലൂമിലും പഠിച്ചു ഖുതുബി മുഹമ്മദ് മുസ്ലിയാരായിരുന്നു പ്രധാന ഗുരു.
      വാഴക്കാട് ദാറുൽ ഇലും, പട്ടിക്കാട് ജാമിഅ നൂരിയ്യ ഉത്തൂർ സഖാഫത്തുൽ ഇസ്‌ലാം കോളെജ് എന്നിവയുടെ പ്രിൻസിപ്പലായിരുന്നിട്ടുണ്ട്.പ്രമുഖ പണ്ഡിതരായിരുന്ന ഇ കെ അബുബക്കർ മുസ്‌ലിയാർ, കെ കെ സദഖത്തല്ല മൗലവി, സി എച്ച് അബുദുറഹ്മാൻ മുസ്‌ലിയാർ തുടങ്ങി നീണ്ട നിര മുസ്ലിയാരുടെ ശിഷ്യഗണങ്ങളായുണ്ട്.
                                    തത്വശാസ്ത്രം, അലങ്കാര ശാസ്ത്രം, വ്യാകരണം, തർക്കശാസ്ത്രം തുടങ്ങിയ ശാഖകളിൽ വ്യുൽപ്പത്തി നേടി.സമസ്തയുടെ പ്രമുഖ മുഫ്തിയുമായിരുന്നു.സമസ്തയുടെ വളർച്ചയുൽ സുപ്രധാന പങ്കുവഹിച്ച കണ്ണിയത്ത് ആശയ പ്രചരണ വേദികളിലെ സ്ഥിരം സാന്നിധ്യവും വാദപ്രതിവാദങ്ങളിലെ നാവുമായിരുന്നു.സമസ്ത സമ്മേളനങ്ങളിൽ പ്രമേയങ്ങൾ തയ്യാറാക്കി അവതരിപ്പിച്ചിരുന്നതും മുസ്‌ലിയാർ തന്നെ.
      1967ൽ, സമസ്തയുടെ പ്രസിഡന്റായിരുന്ന സദഖത്തുല്ല മൗലവി രാജിവെച്ചപ്പോൾ ആ സ്ഥാനത്ത് നിയോഗിക്കപ്പെട്ടത് കണ്ണിയായിരുന്നു. 1993 സെപ്തംബർ 19 ന് മരിക്കുന്നതു വരെ ആ സ്ഥാനത്ത് തുടർന്നു.തസ്‌ഹീലുൽ മത്വാലിബിസ്സനിയ്യ, രിസാലത്തുൻ ഫിൽ വിൻദസ എന്നിവ പ്രധാന കൃതികൾ.
      രണ്ടു ഭാര്യമാർ.നാലു മക്കൾ.`,
      },
    ],
  },
];
